podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/****************************************************************************************************//**
 * @file     LPC11Cxx.h
 *
 * @brief    CMSIS Cortex-M Peripheral Access Layer Header File for LPC11Cxx.
 *           Equivalent: 
 *
 * @version  V10
 * @date     2017/05
 *
 *******************************************************************************************************/

#ifndef MCU_LPC11CXX
#define MCU_LPC11CXX

#include <stdint.h>
#ifdef __cplusplus
extern "C" {
#endif

/**
* @addtogroup Interrupt_vector_numbers_GROUP Interrupt vector numbers
* @brief Vector numbers required for NVIC functions
* @{
*/
/* -------------------------  Interrupt Number Definition  ------------------------ */

/**
 * Interrupt vector numbers
 */
typedef enum {
/* ------------------------  Processor Exceptions Numbers  ------------------------- */
  Reset_IRQn                    = -15,   /**<   1 Reset Vector, invoked on Power up and warm reset                                 */
  NonMaskableInt_IRQn           = -14,   /**<   2 Non maskable Interrupt, cannot be stopped or preempted                           */
  HardFault_IRQn                = -13,   /**<   3 Hard Fault, all classes of Fault                                                 */
  SVCall_IRQn                   =  -5,   /**<  11 System Service Call via SVC instruction                                          */
  PendSV_IRQn                   =  -2,   /**<  14 Pendable request for system service                                              */
  SysTick_IRQn                  =  -1,   /**<  15 System Tick Timer                                                                */
/* ----------------------   LPC11Cxx VectorTable                     ---------------------- */
  PIO0_0_IRQn                   =   0,   /**<  16 System configuration                                                             */
  PIO0_1_IRQn                   =   1,   /**<  17 System configuration                                                             */
  PIO0_2_IRQn                   =   2,   /**<  18 System configuration                                                             */
  PIO0_3_IRQn                   =   3,   /**<  19 System configuration                                                             */
  PIO0_4_IRQn                   =   4,   /**<  20 System configuration                                                             */
  PIO0_5_IRQn                   =   5,   /**<  21 System configuration                                                             */
  PIO0_6_IRQn                   =   6,   /**<  22 System configuration                                                             */
  PIO0_7_IRQn                   =   7,   /**<  23 System configuration                                                             */
  PIO0_8_IRQn                   =   8,   /**<  24 System configuration                                                             */
  PIO0_9_IRQn                   =   9,   /**<  25 System configuration                                                             */
  PIO0_10_IRQn                  =  10,   /**<  26 System configuration                                                             */
  PIO0_11_IRQn                  =  11,   /**<  27 System configuration                                                             */
  PIO1_0_IRQn                   =  12,   /**<  28 System configuration                                                             */
  C_CAN_IRQn                    =  13,   /**<  29 C_CAN controller                                                                 */
  SPI1_IRQn                     =  14,   /**<  30 SPI0                                                                             */
  I2C_IRQn                      =  15,   /**<  31 I2C-bus interface                                                                */
  CT16B0_IRQn                   =  16,   /**<  32 16-bit counter/timer                                                             */
  CT16B1_IRQn                   =  17,   /**<  33 16-bit counter/timer                                                             */
  CT32B0_IRQn                   =  18,   /**<  34 32-bit counter/timer                                                             */
  CT32B1_IRQn                   =  19,   /**<  35 32-bit counter/timer                                                             */
  SPI0_IRQn                     =  20,   /**<  36 SPI0                                                                             */
  UART_IRQn                     =  21,   /**<  37 UART                                                                             */
  ADC_IRQn                      =  24,   /**<  40 10-bit ADC                                                                       */
  WDT_IRQn                      =  25,   /**<  41 Windowed WatchDog Timer                                                          */
  BOD_IRQn                      =  26,   /**<  42 System configuration                                                             */
  FMC_IRQn                      =  27,   /**<  43 Flash programming firmware                                                       */
  GPIO3_IRQn                    =  28,   /**<  44 GPIO0                                                                            */
  GPIO2_IRQn                    =  29,   /**<  45 GPIO0                                                                            */
  GPIO1_IRQn                    =  30,   /**<  46 GPIO0                                                                            */
  GPIO0_IRQn                    =  31,   /**<  47 GPIO0                                                                            */
} IRQn_Type;

/**
 * @} */ /* End group Interrupt_vector_numbers_GROUP 
 */
/**
* @addtogroup Interrupt_handler_prototypes_GROUP Interrupt handler prototypes
* @brief Prototypes for interrupt handlers
* @{
*/
/* -------------------------  Exception Handlers  ------------------------ */
extern void NMI_Handler(void);                 /**< Non maskable Interrupt, cannot be stopped or preempted                           */
extern void HardFault_Handler(void);           /**< Hard Fault, all classes of Fault                                                 */
extern void SVC_Handler(void);                 /**< System Service Call via SVC instruction                                          */
extern void PendSV_Handler(void);              /**< Pendable request for system service                                              */
extern void SysTick_Handler(void);             /**< System Tick Timer                                                                */
extern void PIO0_0_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_1_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_2_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_3_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_4_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_5_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_6_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_7_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_8_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_9_IRQHandler(void);           /**< System configuration                                                             */
extern void PIO0_10_IRQHandler(void);          /**< System configuration                                                             */
extern void PIO0_11_IRQHandler(void);          /**< System configuration                                                             */
extern void PIO1_0_IRQHandler(void);           /**< System configuration                                                             */
extern void C_CAN_IRQHandler(void);            /**< C_CAN controller                                                                 */
extern void SPI1_IRQHandler(void);             /**< SPI0                                                                             */
extern void I2C_IRQHandler(void);              /**< I2C-bus interface                                                                */
extern void CT16B0_IRQHandler(void);           /**< 16-bit counter/timer                                                             */
extern void CT16B1_IRQHandler(void);           /**< 16-bit counter/timer                                                             */
extern void CT32B0_IRQHandler(void);           /**< 32-bit counter/timer                                                             */
extern void CT32B1_IRQHandler(void);           /**< 32-bit counter/timer                                                             */
extern void SPI0_IRQHandler(void);             /**< SPI0                                                                             */
extern void UART_IRQHandler(void);             /**< UART                                                                             */
extern void ADC_IRQHandler(void);              /**< 10-bit ADC                                                                       */
extern void WDT_IRQHandler(void);              /**< Windowed WatchDog Timer                                                          */
extern void BOD_IRQHandler(void);              /**< System configuration                                                             */
extern void FMC_IRQHandler(void);              /**< Flash programming firmware                                                       */
extern void GPIO3_IRQHandler(void);            /**< GPIO0                                                                            */
extern void GPIO2_IRQHandler(void);            /**< GPIO0                                                                            */
extern void GPIO1_IRQHandler(void);            /**< GPIO0                                                                            */
extern void GPIO0_IRQHandler(void);            /**< GPIO0                                                                            */

/**
 * @} */ /* End group Interrupt_handler_prototypes_GROUP 
 */
/* ================================================================================ */
/* ================      Processor and Core Peripheral Section     ================ */
/* ================================================================================ */

/**
* @addtogroup Cortex_Core_Configuration_GROUP Cortex Core Configuration
* @brief Configuration of the cm4 Processor and Core Peripherals
* @{
*/
#define __CM0PLUS_REV             0x0000     /**< CPU Revision                                        */
#define __MPU_PRESENT             0          /**< Whether MPU is present                              */
#define __NVIC_PRIO_BITS          2          /**< Number of implemented bits in NVIC PRIO register    */
#define __Vendor_SysTickConfig    0          /**< Whether Vendor implemented SYSTICK timer is present */
#define __FPU_PRESENT             0          /**< Whether FPU is present                              */
#define __VTOR_PRESENT            0          /**< Whether VTOR register is present                    */

/**
 * @} */ /* End group Cortex_Core_Configuration_GROUP 
 */
#include "core_cm0plus.h"       /* Processor and core peripherals     */
#include "system.h"             /* Device specific configuration file */

#ifndef __IO
#define __IO volatile 
#endif

#ifndef __I
#define __I volatile const
#endif

