podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#ifndef __O
#define __O volatile
#endif


/* ================================================================================ */
/* ================       Device Specific Peripheral Section       ================ */
/* ================================================================================ */



/* -------------------  Start of section using anonymous unions  ------------------ */
#if defined(__CC_ARM)
  #pragma push
  #pragma anon_unions
#elif defined(__ICCARM__)
  #pragma language=extended
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
/* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning 586
#else
  #warning Not supported compiler type
#endif
/**
* @addtogroup Peripheral_access_layer_GROUP Device Peripheral Access Layer
* @brief C structs allowing access to peripheral registers
* @{
*/
/**
* @addtogroup ADC_Peripheral_access_layer_GROUP ADC Peripheral Access Layer
* @brief C Struct for ADC
* @{
*/

/* ================================================================================ */
/* ================           ADC (file:ADC_LPC11Cxx)              ================ */
/* ================================================================================ */

/**
 * @brief 10-bit ADC
 */
/**
* @addtogroup ADC_structs_GROUP ADC struct
* @brief Struct for ADC
* @{
*/
typedef struct {                                /*       ADC Structure                                                */
   __IO uint32_t  CR;                           /**< 0000: A/D Control Register. The ADCR register must be written to select the operating mode before A/D conversion can occur */
   __IO uint32_t  GDR;                          /**< 0004: A/D Global Data Register. Contains the result of the most recent A/D conversion */
        uint8_t   RESERVED_0[4];               
   __IO uint32_t  INTEN;                        /**< 000C: A/D Interrupt Enable Register. This register contains enable bits that allow the DONE flag of each A/D channel to be included or excluded from contributing to the generation of an A/D interrupt */
   __IO uint32_t  DR[8];                        /**< 0010: A/D Channel n Data Register. This register contains the result of the most recent conversion completed on channel n */
   __I  uint32_t  STAT;                         /**< 0030: A/D Status Register. This register contains DONE and OVERRUN flags for all of the A/D channels, as well as the A/D interrupt flag */
} ADC_Type;

/**
 * @} */ /* End group ADC_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'ADC' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup ADC_Register_Masks_GROUP ADC Register Masks
* @brief Register Masks for ADC
* @{
*/
/* ------- CR Bit Fields                            ------ */
#define ADC_CR_SEL_MASK                          (0xFFU)                                             /*!< ADC_CR: SEL Mask                        */
#define ADC_CR_SEL_SHIFT                         (0U)                                                /*!< ADC_CR: SEL Position                    */
#define ADC_CR_SEL(x)                            (((uint32_t)(((uint32_t)(x))<<ADC_CR_SEL_SHIFT))&ADC_CR_SEL_MASK) /*!< ADC_CR                                  */
#define ADC_CR_CLKDIV_MASK                       (0xFF00U)                                           /*!< ADC_CR: CLKDIV Mask                     */
#define ADC_CR_CLKDIV_SHIFT                      (8U)                                                /*!< ADC_CR: CLKDIV Position                 */
#define ADC_CR_CLKDIV(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_CR_CLKDIV_SHIFT))&ADC_CR_CLKDIV_MASK) /*!< ADC_CR                                  */
#define ADC_CR_BURST_MASK                        (0x10000U)                                          /*!< ADC_CR: BURST Mask                      */
#define ADC_CR_BURST_SHIFT                       (16U)                                               /*!< ADC_CR: BURST Position                  */
#define ADC_CR_BURST(x)                          (((uint32_t)(((uint32_t)(x))<<ADC_CR_BURST_SHIFT))&ADC_CR_BURST_MASK) /*!< ADC_CR                                  */
#define ADC_CR_CLKS_MASK                         (0xE0000U)                                          /*!< ADC_CR: CLKS Mask                       */
#define ADC_CR_CLKS_SHIFT                        (17U)                                               /*!< ADC_CR: CLKS Position                   */
#define ADC_CR_CLKS(x)                           (((uint32_t)(((uint32_t)(x))<<ADC_CR_CLKS_SHIFT))&ADC_CR_CLKS_MASK) /*!< ADC_CR                                  */
#define ADC_CR_START_MASK                        (0x7000000U)                                        /*!< ADC_CR: START Mask                      */
#define ADC_CR_START_SHIFT                       (24U)                                               /*!< ADC_CR: START Position                  */
#define ADC_CR_START(x)                          (((uint32_t)(((uint32_t)(x))<<ADC_CR_START_SHIFT))&ADC_CR_START_MASK) /*!< ADC_CR                                  */
#define ADC_CR_EDGE_MASK                         (0x8000000U)                                        /*!< ADC_CR: EDGE Mask                       */
#define ADC_CR_EDGE_SHIFT                        (27U)                                               /*!< ADC_CR: EDGE Position                   */
#define ADC_CR_EDGE(x)                           (((uint32_t)(((uint32_t)(x))<<ADC_CR_EDGE_SHIFT))&ADC_CR_EDGE_MASK) /*!< ADC_CR                                  */
/* ------- GDR Bit Fields                           ------ */
#define ADC_GDR_V_VREF_MASK                      (0xFFC0U)                                           /*!< ADC_GDR: V_VREF Mask                    */
#define ADC_GDR_V_VREF_SHIFT                     (6U)                                                /*!< ADC_GDR: V_VREF Position                */
#define ADC_GDR_V_VREF(x)                        (((uint32_t)(((uint32_t)(x))<<ADC_GDR_V_VREF_SHIFT))&ADC_GDR_V_VREF_MASK) /*!< ADC_GDR                                 */
#define ADC_GDR_CHN_MASK                         (0x7000000U)                                        /*!< ADC_GDR: CHN Mask                       */
#define ADC_GDR_CHN_SHIFT                        (24U)                                               /*!< ADC_GDR: CHN Position                   */
#define ADC_GDR_CHN(x)                           (((uint32_t)(((uint32_t)(x))<<ADC_GDR_CHN_SHIFT))&ADC_GDR_CHN_MASK) /*!< ADC_GDR                                 */
#define ADC_GDR_OVERRUN_MASK                     (0x40000000U)                                       /*!< ADC_GDR: OVERRUN Mask                   */
#define ADC_GDR_OVERRUN_SHIFT                    (30U)                                               /*!< ADC_GDR: OVERRUN Position               */
#define ADC_GDR_OVERRUN(x)                       (((uint32_t)(((uint32_t)(x))<<ADC_GDR_OVERRUN_SHIFT))&ADC_GDR_OVERRUN_MASK) /*!< ADC_GDR                                 */
#define ADC_GDR_DONE_MASK                        (0x80000000U)                                       /*!< ADC_GDR: DONE Mask                      */
#define ADC_GDR_DONE_SHIFT                       (31U)                                               /*!< ADC_GDR: DONE Position                  */
#define ADC_GDR_DONE(x)                          (((uint32_t)(((uint32_t)(x))<<ADC_GDR_DONE_SHIFT))&ADC_GDR_DONE_MASK) /*!< ADC_GDR                                 */
/* ------- INTEN Bit Fields                         ------ */
#define ADC_INTEN_ADINTENn_MASK                  (0xFFU)                                             /*!< ADC_INTEN: ADINTENn Mask                */
#define ADC_INTEN_ADINTENn_SHIFT                 (0U)                                                /*!< ADC_INTEN: ADINTENn Position            */
#define ADC_INTEN_ADINTENn(x)                    (((uint32_t)(((uint32_t)(x))<<ADC_INTEN_ADINTENn_SHIFT))&ADC_INTEN_ADINTENn_MASK) /*!< ADC_INTEN                               */
#define ADC_INTEN_ADGINTEN_MASK                  (0x100U)                                            /*!< ADC_INTEN: ADGINTEN Mask                */
#define ADC_INTEN_ADGINTEN_SHIFT                 (8U)                                                /*!< ADC_INTEN: ADGINTEN Position            */
#define ADC_INTEN_ADGINTEN(x)                    (((uint32_t)(((uint32_t)(x))<<ADC_INTEN_ADGINTEN_SHIFT))&ADC_INTEN_ADGINTEN_MASK) /*!< ADC_INTEN                               */
/* ------- DR Bit Fields                            ------ */
#define ADC_DR_V_VREF_MASK                       (0xFFC0U)                                           /*!< ADC_DR: V_VREF Mask                     */
#define ADC_DR_V_VREF_SHIFT                      (6U)                                                /*!< ADC_DR: V_VREF Position                 */
#define ADC_DR_V_VREF(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_DR_V_VREF_SHIFT))&ADC_DR_V_VREF_MASK) /*!< ADC_DR                                  */
#define ADC_DR_OVERRUN_MASK                      (0x40000000U)                                       /*!< ADC_DR: OVERRUN Mask                    */
#define ADC_DR_OVERRUN_SHIFT                     (30U)                                               /*!< ADC_DR: OVERRUN Position                */
#define ADC_DR_OVERRUN(x)                        (((uint32_t)(((uint32_t)(x))<<ADC_DR_OVERRUN_SHIFT))&ADC_DR_OVERRUN_MASK) /*!< ADC_DR                                  */
#define ADC_DR_DONE_MASK                         (0x80000000U)                                       /*!< ADC_DR: DONE Mask                       */
#define ADC_DR_DONE_SHIFT                        (31U)                                               /*!< ADC_DR: DONE Position                   */
#define ADC_DR_DONE(x)                           (((uint32_t)(((uint32_t)(x))<<ADC_DR_DONE_SHIFT))&ADC_DR_DONE_MASK) /*!< ADC_DR                                  */
/* ------- STAT Bit Fields                          ------ */
#define ADC_STAT_DONE_MASK                       (0xFFU)                                             /*!< ADC_STAT: DONE Mask                     */
#define ADC_STAT_DONE_SHIFT                      (0U)                                                /*!< ADC_STAT: DONE Position                 */
#define ADC_STAT_DONE(x)                         (((uint32_t)(((uint32_t)(x))<<ADC_STAT_DONE_SHIFT))&ADC_STAT_DONE_MASK) /*!< ADC_STAT                                */
#define ADC_STAT_OVERRUN_MASK                    (0xFF00U)                                           /*!< ADC_STAT: OVERRUN Mask                  */
#define ADC_STAT_OVERRUN_SHIFT                   (8U)                                                /*!< ADC_STAT: OVERRUN Position              */
#define ADC_STAT_OVERRUN(x)                      (((uint32_t)(((uint32_t)(x))<<ADC_STAT_OVERRUN_SHIFT))&ADC_STAT_OVERRUN_MASK) /*!< ADC_STAT                                */
#define ADC_STAT_ADINT_MASK                      (0x10000U)                                          /*!< ADC_STAT: ADINT Mask                    */
#define ADC_STAT_ADINT_SHIFT                     (16U)                                               /*!< ADC_STAT: ADINT Position                */
#define ADC_STAT_ADINT(x)                        (((uint32_t)(((uint32_t)(x))<<ADC_STAT_ADINT_SHIFT))&ADC_STAT_ADINT_MASK) /*!< ADC_STAT                                */
/**
 * @} */ /* End group ADC_Register_Masks_GROUP 
 */

/* ADC - Peripheral instance base addresses */
#define ADC_BasePtr                    0x4001C000UL //!< Peripheral base address
#define ADC                            ((ADC_Type *) ADC_BasePtr) //!< Freescale base pointer
#define ADC_BASE_PTR                   (ADC) //!< Freescale style base pointer
/**
 * @} */ /* End group ADC_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CT16B_Peripheral_access_layer_GROUP CT16B Peripheral Access Layer
* @brief C Struct for CT16B
* @{
*/

/* ================================================================================ */
/* ================           CT16B0 (file:CT16B0_LPC11Cxx)        ================ */
/* ================================================================================ */

/**
 * @brief 16-bit counter/timer
 */
/**
* @addtogroup CT16B_structs_GROUP CT16B struct
* @brief Struct for CT16B
* @{
*/
typedef struct {                                /*       CT16B0 Structure                                             */
   __IO uint32_t  IR;                           /**< 0000: Interrupt Register (IR). The IR can be written to clear interrupts. The IR can be read to identify which of five possible interrupt sources are pending */
   __IO uint32_t  TCR;                          /**< 0004: Timer Control Register (TCR). The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR */
   __IO uint32_t  TC;                           /**< 0008: Timer Counter (TC). The 16-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR */
   __IO uint32_t  PR;                           /**< 000C: Prescale Register (PR). When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC */
   __IO uint32_t  PC;                           /**< 0010: Prescale Counter (PC). The 16-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface */
   __IO uint32_t  MCR;                          /**< 0014: Match Control Register (MCR). The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs */
   __IO uint32_t  MR[4];                        /**< 0018: Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR matches the TC */
   __IO uint32_t  CCR;                          /**< 0028: Capture Control Register (CCR). The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place */
   __I  uint32_t  CR0;                          /**< 002C: Capture Register 0 (CR0). CR0 is loaded with the value of TC when there is an event on the CT16B0_CAP0 input */
        uint8_t   RESERVED_0[12];              
   __IO uint32_t  EMR;                          /**< 003C: External Match Register (EMR). The EMR controls the match function and the external match pins CT16B0_MAT[2:0] */
        uint8_t   RESERVED_1[48];              
   __IO uint32_t  CTCR;                         /**< 0070: Count Control Register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting */
   __IO uint32_t  PWMC;                         /**< 0074: PWM Control Register (PWMCON). The PWMCON enables PWM mode for the external match pins CT16B0_MAT[2:0] */
} CT16B0_Type;

/**
 * @} */ /* End group CT16B_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CT16B0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

