podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup CT16B_Register_Masks_GROUP CT16B Register Masks
* @brief Register Masks for CT16B
* @{
*/
/* ------- IR Bit Fields                            ------ */
#define CT16B0_IR_MR0INT_MASK                    (0x1U)                                              /*!< CT16B0_IR: MR0INT Mask                  */
#define CT16B0_IR_MR0INT_SHIFT                   (0U)                                                /*!< CT16B0_IR: MR0INT Position              */
#define CT16B0_IR_MR0INT(x)                      (((uint32_t)(((uint32_t)(x))<<CT16B0_IR_MR0INT_SHIFT))&CT16B0_IR_MR0INT_MASK) /*!< CT16B0_IR                               */
#define CT16B0_IR_MR1INT_MASK                    (0x2U)                                              /*!< CT16B0_IR: MR1INT Mask                  */
#define CT16B0_IR_MR1INT_SHIFT                   (1U)                                                /*!< CT16B0_IR: MR1INT Position              */
#define CT16B0_IR_MR1INT(x)                      (((uint32_t)(((uint32_t)(x))<<CT16B0_IR_MR1INT_SHIFT))&CT16B0_IR_MR1INT_MASK) /*!< CT16B0_IR                               */
#define CT16B0_IR_MR2INT_MASK                    (0x4U)                                              /*!< CT16B0_IR: MR2INT Mask                  */
#define CT16B0_IR_MR2INT_SHIFT                   (2U)                                                /*!< CT16B0_IR: MR2INT Position              */
#define CT16B0_IR_MR2INT(x)                      (((uint32_t)(((uint32_t)(x))<<CT16B0_IR_MR2INT_SHIFT))&CT16B0_IR_MR2INT_MASK) /*!< CT16B0_IR                               */
#define CT16B0_IR_MR3INT_MASK                    (0x8U)                                              /*!< CT16B0_IR: MR3INT Mask                  */
#define CT16B0_IR_MR3INT_SHIFT                   (3U)                                                /*!< CT16B0_IR: MR3INT Position              */
#define CT16B0_IR_MR3INT(x)                      (((uint32_t)(((uint32_t)(x))<<CT16B0_IR_MR3INT_SHIFT))&CT16B0_IR_MR3INT_MASK) /*!< CT16B0_IR                               */
#define CT16B0_IR_CR0INT_MASK                    (0x10U)                                             /*!< CT16B0_IR: CR0INT Mask                  */
#define CT16B0_IR_CR0INT_SHIFT                   (4U)                                                /*!< CT16B0_IR: CR0INT Position              */
#define CT16B0_IR_CR0INT(x)                      (((uint32_t)(((uint32_t)(x))<<CT16B0_IR_CR0INT_SHIFT))&CT16B0_IR_CR0INT_MASK) /*!< CT16B0_IR                               */
/* ------- TCR Bit Fields                           ------ */
#define CT16B0_TCR_CEN_MASK                      (0x1U)                                              /*!< CT16B0_TCR: CEN Mask                    */
#define CT16B0_TCR_CEN_SHIFT                     (0U)                                                /*!< CT16B0_TCR: CEN Position                */
#define CT16B0_TCR_CEN(x)                        (((uint32_t)(((uint32_t)(x))<<CT16B0_TCR_CEN_SHIFT))&CT16B0_TCR_CEN_MASK) /*!< CT16B0_TCR                              */
#define CT16B0_TCR_CRST_MASK                     (0x2U)                                              /*!< CT16B0_TCR: CRST Mask                   */
#define CT16B0_TCR_CRST_SHIFT                    (1U)                                                /*!< CT16B0_TCR: CRST Position               */
#define CT16B0_TCR_CRST(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_TCR_CRST_SHIFT))&CT16B0_TCR_CRST_MASK) /*!< CT16B0_TCR                              */
/* ------- TC Bit Fields                            ------ */
#define CT16B0_TC_TC_MASK                        (0xFFFFU)                                           /*!< CT16B0_TC: TC Mask                      */
#define CT16B0_TC_TC_SHIFT                       (0U)                                                /*!< CT16B0_TC: TC Position                  */
#define CT16B0_TC_TC(x)                          (((uint32_t)(((uint32_t)(x))<<CT16B0_TC_TC_SHIFT))&CT16B0_TC_TC_MASK) /*!< CT16B0_TC                               */
/* ------- PR Bit Fields                            ------ */
#define CT16B0_PR_PCVAL_MASK                     (0xFFFFU)                                           /*!< CT16B0_PR: PCVAL Mask                   */
#define CT16B0_PR_PCVAL_SHIFT                    (0U)                                                /*!< CT16B0_PR: PCVAL Position               */
#define CT16B0_PR_PCVAL(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_PR_PCVAL_SHIFT))&CT16B0_PR_PCVAL_MASK) /*!< CT16B0_PR                               */
/* ------- PC Bit Fields                            ------ */
#define CT16B0_PC_PC_MASK                        (0xFFFFU)                                           /*!< CT16B0_PC: PC Mask                      */
#define CT16B0_PC_PC_SHIFT                       (0U)                                                /*!< CT16B0_PC: PC Position                  */
#define CT16B0_PC_PC(x)                          (((uint32_t)(((uint32_t)(x))<<CT16B0_PC_PC_SHIFT))&CT16B0_PC_PC_MASK) /*!< CT16B0_PC                               */
/* ------- MCR Bit Fields                           ------ */
#define CT16B0_MCR_MR0I_MASK                     (0x1U)                                              /*!< CT16B0_MCR: MR0I Mask                   */
#define CT16B0_MCR_MR0I_SHIFT                    (0U)                                                /*!< CT16B0_MCR: MR0I Position               */
#define CT16B0_MCR_MR0I(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR0I_SHIFT))&CT16B0_MCR_MR0I_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR0R_MASK                     (0x2U)                                              /*!< CT16B0_MCR: MR0R Mask                   */
#define CT16B0_MCR_MR0R_SHIFT                    (1U)                                                /*!< CT16B0_MCR: MR0R Position               */
#define CT16B0_MCR_MR0R(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR0R_SHIFT))&CT16B0_MCR_MR0R_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR0S_MASK                     (0x4U)                                              /*!< CT16B0_MCR: MR0S Mask                   */
#define CT16B0_MCR_MR0S_SHIFT                    (2U)                                                /*!< CT16B0_MCR: MR0S Position               */
#define CT16B0_MCR_MR0S(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR0S_SHIFT))&CT16B0_MCR_MR0S_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR1I_MASK                     (0x8U)                                              /*!< CT16B0_MCR: MR1I Mask                   */
#define CT16B0_MCR_MR1I_SHIFT                    (3U)                                                /*!< CT16B0_MCR: MR1I Position               */
#define CT16B0_MCR_MR1I(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR1I_SHIFT))&CT16B0_MCR_MR1I_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR1R_MASK                     (0x10U)                                             /*!< CT16B0_MCR: MR1R Mask                   */
#define CT16B0_MCR_MR1R_SHIFT                    (4U)                                                /*!< CT16B0_MCR: MR1R Position               */
#define CT16B0_MCR_MR1R(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR1R_SHIFT))&CT16B0_MCR_MR1R_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR1S_MASK                     (0x20U)                                             /*!< CT16B0_MCR: MR1S Mask                   */
#define CT16B0_MCR_MR1S_SHIFT                    (5U)                                                /*!< CT16B0_MCR: MR1S Position               */
#define CT16B0_MCR_MR1S(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR1S_SHIFT))&CT16B0_MCR_MR1S_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR2I_MASK                     (0x40U)                                             /*!< CT16B0_MCR: MR2I Mask                   */
#define CT16B0_MCR_MR2I_SHIFT                    (6U)                                                /*!< CT16B0_MCR: MR2I Position               */
#define CT16B0_MCR_MR2I(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR2I_SHIFT))&CT16B0_MCR_MR2I_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR2R_MASK                     (0x80U)                                             /*!< CT16B0_MCR: MR2R Mask                   */
#define CT16B0_MCR_MR2R_SHIFT                    (7U)                                                /*!< CT16B0_MCR: MR2R Position               */
#define CT16B0_MCR_MR2R(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR2R_SHIFT))&CT16B0_MCR_MR2R_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR2S_MASK                     (0x100U)                                            /*!< CT16B0_MCR: MR2S Mask                   */
#define CT16B0_MCR_MR2S_SHIFT                    (8U)                                                /*!< CT16B0_MCR: MR2S Position               */
#define CT16B0_MCR_MR2S(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR2S_SHIFT))&CT16B0_MCR_MR2S_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR3I_MASK                     (0x200U)                                            /*!< CT16B0_MCR: MR3I Mask                   */
#define CT16B0_MCR_MR3I_SHIFT                    (9U)                                                /*!< CT16B0_MCR: MR3I Position               */
#define CT16B0_MCR_MR3I(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR3I_SHIFT))&CT16B0_MCR_MR3I_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR3R_MASK                     (0x400U)                                            /*!< CT16B0_MCR: MR3R Mask                   */
#define CT16B0_MCR_MR3R_SHIFT                    (10U)                                               /*!< CT16B0_MCR: MR3R Position               */
#define CT16B0_MCR_MR3R(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR3R_SHIFT))&CT16B0_MCR_MR3R_MASK) /*!< CT16B0_MCR                              */
#define CT16B0_MCR_MR3S_MASK                     (0x800U)                                            /*!< CT16B0_MCR: MR3S Mask                   */
#define CT16B0_MCR_MR3S_SHIFT                    (11U)                                               /*!< CT16B0_MCR: MR3S Position               */
#define CT16B0_MCR_MR3S(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MCR_MR3S_SHIFT))&CT16B0_MCR_MR3S_MASK) /*!< CT16B0_MCR                              */
/* ------- MR Bit Fields                            ------ */
#define CT16B0_MR_MATCH_MASK                     (0xFFFFU)                                           /*!< CT16B0_MR: MATCH Mask                   */
#define CT16B0_MR_MATCH_SHIFT                    (0U)                                                /*!< CT16B0_MR: MATCH Position               */
#define CT16B0_MR_MATCH(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_MR_MATCH_SHIFT))&CT16B0_MR_MATCH_MASK) /*!< CT16B0_MR                               */
/* ------- CCR Bit Fields                           ------ */
#define CT16B0_CCR_CAP0RE_MASK                   (0x1U)                                              /*!< CT16B0_CCR: CAP0RE Mask                 */
#define CT16B0_CCR_CAP0RE_SHIFT                  (0U)                                                /*!< CT16B0_CCR: CAP0RE Position             */
#define CT16B0_CCR_CAP0RE(x)                     (((uint32_t)(((uint32_t)(x))<<CT16B0_CCR_CAP0RE_SHIFT))&CT16B0_CCR_CAP0RE_MASK) /*!< CT16B0_CCR                              */
#define CT16B0_CCR_CAP0FE_MASK                   (0x2U)                                              /*!< CT16B0_CCR: CAP0FE Mask                 */
#define CT16B0_CCR_CAP0FE_SHIFT                  (1U)                                                /*!< CT16B0_CCR: CAP0FE Position             */
#define CT16B0_CCR_CAP0FE(x)                     (((uint32_t)(((uint32_t)(x))<<CT16B0_CCR_CAP0FE_SHIFT))&CT16B0_CCR_CAP0FE_MASK) /*!< CT16B0_CCR                              */
#define CT16B0_CCR_CAP0I_MASK                    (0x4U)                                              /*!< CT16B0_CCR: CAP0I Mask                  */
#define CT16B0_CCR_CAP0I_SHIFT                   (2U)                                                /*!< CT16B0_CCR: CAP0I Position              */
#define CT16B0_CCR_CAP0I(x)                      (((uint32_t)(((uint32_t)(x))<<CT16B0_CCR_CAP0I_SHIFT))&CT16B0_CCR_CAP0I_MASK) /*!< CT16B0_CCR                              */
/* ------- CR0 Bit Fields                           ------ */
#define CT16B0_CR0_CAP_MASK                      (0xFFFFU)                                           /*!< CT16B0_CR0: CAP Mask                    */
#define CT16B0_CR0_CAP_SHIFT                     (0U)                                                /*!< CT16B0_CR0: CAP Position                */
#define CT16B0_CR0_CAP(x)                        (((uint32_t)(((uint32_t)(x))<<CT16B0_CR0_CAP_SHIFT))&CT16B0_CR0_CAP_MASK) /*!< CT16B0_CR0                              */
/* ------- EMR Bit Fields                           ------ */
#define CT16B0_EMR_EM0_MASK                      (0x1U)                                              /*!< CT16B0_EMR: EM0 Mask                    */
#define CT16B0_EMR_EM0_SHIFT                     (0U)                                                /*!< CT16B0_EMR: EM0 Position                */
#define CT16B0_EMR_EM0(x)                        (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EM0_SHIFT))&CT16B0_EMR_EM0_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EM1_MASK                      (0x2U)                                              /*!< CT16B0_EMR: EM1 Mask                    */
#define CT16B0_EMR_EM1_SHIFT                     (1U)                                                /*!< CT16B0_EMR: EM1 Position                */
#define CT16B0_EMR_EM1(x)                        (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EM1_SHIFT))&CT16B0_EMR_EM1_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EM2_MASK                      (0x4U)                                              /*!< CT16B0_EMR: EM2 Mask                    */
#define CT16B0_EMR_EM2_SHIFT                     (2U)                                                /*!< CT16B0_EMR: EM2 Position                */
#define CT16B0_EMR_EM2(x)                        (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EM2_SHIFT))&CT16B0_EMR_EM2_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EM3_MASK                      (0x8U)                                              /*!< CT16B0_EMR: EM3 Mask                    */
#define CT16B0_EMR_EM3_SHIFT                     (3U)                                                /*!< CT16B0_EMR: EM3 Position                */
#define CT16B0_EMR_EM3(x)                        (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EM3_SHIFT))&CT16B0_EMR_EM3_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EMC0_MASK                     (0x30U)                                             /*!< CT16B0_EMR: EMC0 Mask                   */
#define CT16B0_EMR_EMC0_SHIFT                    (4U)                                                /*!< CT16B0_EMR: EMC0 Position               */
#define CT16B0_EMR_EMC0(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EMC0_SHIFT))&CT16B0_EMR_EMC0_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EMC1_MASK                     (0xC0U)                                             /*!< CT16B0_EMR: EMC1 Mask                   */
#define CT16B0_EMR_EMC1_SHIFT                    (6U)                                                /*!< CT16B0_EMR: EMC1 Position               */
#define CT16B0_EMR_EMC1(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EMC1_SHIFT))&CT16B0_EMR_EMC1_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EMC2_MASK                     (0x300U)                                            /*!< CT16B0_EMR: EMC2 Mask                   */
#define CT16B0_EMR_EMC2_SHIFT                    (8U)                                                /*!< CT16B0_EMR: EMC2 Position               */
#define CT16B0_EMR_EMC2(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EMC2_SHIFT))&CT16B0_EMR_EMC2_MASK) /*!< CT16B0_EMR                              */
#define CT16B0_EMR_EMC3_MASK                     (0xC00U)                                            /*!< CT16B0_EMR: EMC3 Mask                   */
#define CT16B0_EMR_EMC3_SHIFT                    (10U)                                               /*!< CT16B0_EMR: EMC3 Position               */
#define CT16B0_EMR_EMC3(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_EMR_EMC3_SHIFT))&CT16B0_EMR_EMC3_MASK) /*!< CT16B0_EMR                              */
/* ------- CTCR Bit Fields                          ------ */
#define CT16B0_CTCR_CTM_MASK                     (0x3U)                                              /*!< CT16B0_CTCR: CTM Mask                   */
#define CT16B0_CTCR_CTM_SHIFT                    (0U)                                                /*!< CT16B0_CTCR: CTM Position               */
#define CT16B0_CTCR_CTM(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_CTCR_CTM_SHIFT))&CT16B0_CTCR_CTM_MASK) /*!< CT16B0_CTCR                             */
#define CT16B0_CTCR_CIS_MASK                     (0xCU)                                              /*!< CT16B0_CTCR: CIS Mask                   */
#define CT16B0_CTCR_CIS_SHIFT                    (2U)                                                /*!< CT16B0_CTCR: CIS Position               */
#define CT16B0_CTCR_CIS(x)                       (((uint32_t)(((uint32_t)(x))<<CT16B0_CTCR_CIS_SHIFT))&CT16B0_CTCR_CIS_MASK) /*!< CT16B0_CTCR                             */
/* ------- PWMC Bit Fields                          ------ */
#define CT16B0_PWMC_PWMEN0_MASK                  (0x1U)                                              /*!< CT16B0_PWMC: PWMEN0 Mask                */
#define CT16B0_PWMC_PWMEN0_SHIFT                 (0U)                                                /*!< CT16B0_PWMC: PWMEN0 Position            */
#define CT16B0_PWMC_PWMEN0(x)                    (((uint32_t)(((uint32_t)(x))<<CT16B0_PWMC_PWMEN0_SHIFT))&CT16B0_PWMC_PWMEN0_MASK) /*!< CT16B0_PWMC                             */
#define CT16B0_PWMC_PWMEN1_MASK                  (0x2U)                                              /*!< CT16B0_PWMC: PWMEN1 Mask                */
#define CT16B0_PWMC_PWMEN1_SHIFT                 (1U)                                                /*!< CT16B0_PWMC: PWMEN1 Position            */
#define CT16B0_PWMC_PWMEN1(x)                    (((uint32_t)(((uint32_t)(x))<<CT16B0_PWMC_PWMEN1_SHIFT))&CT16B0_PWMC_PWMEN1_MASK) /*!< CT16B0_PWMC                             */
#define CT16B0_PWMC_PWMEN2_MASK                  (0x4U)                                              /*!< CT16B0_PWMC: PWMEN2 Mask                */
#define CT16B0_PWMC_PWMEN2_SHIFT                 (2U)                                                /*!< CT16B0_PWMC: PWMEN2 Position            */
#define CT16B0_PWMC_PWMEN2(x)                    (((uint32_t)(((uint32_t)(x))<<CT16B0_PWMC_PWMEN2_SHIFT))&CT16B0_PWMC_PWMEN2_MASK) /*!< CT16B0_PWMC                             */
#define CT16B0_PWMC_PWMEN3_MASK                  (0x8U)                                              /*!< CT16B0_PWMC: PWMEN3 Mask                */
#define CT16B0_PWMC_PWMEN3_SHIFT                 (3U)                                                /*!< CT16B0_PWMC: PWMEN3 Position            */
#define CT16B0_PWMC_PWMEN3(x)                    (((uint32_t)(((uint32_t)(x))<<CT16B0_PWMC_PWMEN3_SHIFT))&CT16B0_PWMC_PWMEN3_MASK) /*!< CT16B0_PWMC                             */
/**
 * @} */ /* End group CT16B_Register_Masks_GROUP 
 */

/* CT16B0 - Peripheral instance base addresses */
#define CT16B0_BasePtr                 0x4000C000UL //!< Peripheral base address
#define CT16B0                         ((CT16B0_Type *) CT16B0_BasePtr) //!< Freescale base pointer
#define CT16B0_BASE_PTR                (CT16B0) //!< Freescale style base pointer
/**
 * @} */ /* End group CT16B_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CT16B_Peripheral_access_layer_GROUP CT16B Peripheral Access Layer
* @brief C Struct for CT16B
* @{
*/

/* ================================================================================ */
/* ================           CT16B1 (derived from CT16B0)         ================ */
/* ================================================================================ */

/**
 * @brief 16-bit counter/timer
 */

/* CT16B1 - Peripheral instance base addresses */
#define CT16B1_BasePtr                 0x40010000UL //!< Peripheral base address
#define CT16B1                         ((CT16B0_Type *) CT16B1_BasePtr) //!< Freescale base pointer
#define CT16B1_BASE_PTR                (CT16B1) //!< Freescale style base pointer
/**
 * @} */ /* End group CT16B_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CT32B_Peripheral_access_layer_GROUP CT32B Peripheral Access Layer
* @brief C Struct for CT32B
* @{
*/

/* ================================================================================ */
/* ================           CT32B0 (file:CT32B0_LPC11Cxx)        ================ */
/* ================================================================================ */

