podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
 * @brief 32-bit counter/timer
 */
/**
* @addtogroup CT32B_structs_GROUP CT32B struct
* @brief Struct for CT32B
* @{
*/
typedef struct {                                /*       CT32B0 Structure                                             */
   __IO uint32_t  IR;                           /**< 0000: Interrupt Register (IR). The IR can be written to clear interrupts. The IR can be read to identify which of five possible interrupt sources are pending */
   __IO uint32_t  TCR;                          /**< 0004: Timer Control Register (TCR). The TCR is used to control the Timer Counter functions. The Timer Counter can be disabled or reset through the TCR */
   __IO uint32_t  TC;                           /**< 0008: Timer Counter (TC). The 32-bit TC is incremented every PR+1 cycles of PCLK. The TC is controlled through the TCR */
   __IO uint32_t  PR;                           /**< 000C: Prescale Register (PR). When the Prescale Counter (below) is equal to this value, the next clock increments the TC and clears the PC */
   __IO uint32_t  PC;                           /**< 0010: Prescale Counter (PC). The 32-bit PC is a counter which is incremented to the value stored in PR. When the value in PR is reached, the TC is incremented and the PC is cleared. The PC is observable and controllable through the bus interface */
   __IO uint32_t  MCR;                          /**< 0014: Match Control Register (MCR). The MCR is used to control if an interrupt is generated and if the TC is reset when a Match occurs */
   __IO uint32_t  MR[4];                        /**< 0018: Match Register. MR can be enabled through the MCR to reset the TC, stop both the TC and PC, and/or generate an interrupt every time MR matches the TC */
   __IO uint32_t  CCR;                          /**< 0028: Capture Control Register (CCR). The CCR controls which edges of the capture inputs are used to load the Capture Registers and whether or not an interrupt is generated when a capture takes place */
   __I  uint32_t  CR0;                          /**< 002C: Capture Register 0 (CR0). CR0 is loaded with the value of TC when there is an event on the CT32B0_CAP0 input */
        uint8_t   RESERVED_0[12];              
   __IO uint32_t  EMR;                          /**< 003C: External Match Register (EMR). The EMR controls the match function and the external match pins CT32B0_MAT[3:0] */
        uint8_t   RESERVED_1[48];              
   __IO uint32_t  CTCR;                         /**< 0070: Count Control Register (CTCR). The CTCR selects between Timer and Counter mode, and in Counter mode selects the signal and edge(s) for counting */
   __IO uint32_t  PWMC;                         /**< 0074: PWM Control Register (PWMCON). The PWMCON enables PWM mode for the external match pins CT32B0_MAT[3:0] */
} CT32B0_Type;

/**
 * @} */ /* End group CT32B_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'CT32B0' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup CT32B_Register_Masks_GROUP CT32B Register Masks
* @brief Register Masks for CT32B
* @{
*/
/* ------- IR Bit Fields                            ------ */
#define CT32B0_IR_MR0Int_MASK                    (0x1U)                                              /*!< CT32B0_IR: MR0Int Mask                  */
#define CT32B0_IR_MR0Int_SHIFT                   (0U)                                                /*!< CT32B0_IR: MR0Int Position              */
#define CT32B0_IR_MR0Int(x)                      (((uint32_t)(((uint32_t)(x))<<CT32B0_IR_MR0Int_SHIFT))&CT32B0_IR_MR0Int_MASK) /*!< CT32B0_IR                               */
#define CT32B0_IR_MR1Int_MASK                    (0x2U)                                              /*!< CT32B0_IR: MR1Int Mask                  */
#define CT32B0_IR_MR1Int_SHIFT                   (1U)                                                /*!< CT32B0_IR: MR1Int Position              */
#define CT32B0_IR_MR1Int(x)                      (((uint32_t)(((uint32_t)(x))<<CT32B0_IR_MR1Int_SHIFT))&CT32B0_IR_MR1Int_MASK) /*!< CT32B0_IR                               */
#define CT32B0_IR_MR2Int_MASK                    (0x4U)                                              /*!< CT32B0_IR: MR2Int Mask                  */
#define CT32B0_IR_MR2Int_SHIFT                   (2U)                                                /*!< CT32B0_IR: MR2Int Position              */
#define CT32B0_IR_MR2Int(x)                      (((uint32_t)(((uint32_t)(x))<<CT32B0_IR_MR2Int_SHIFT))&CT32B0_IR_MR2Int_MASK) /*!< CT32B0_IR                               */
#define CT32B0_IR_MR3Int_MASK                    (0x8U)                                              /*!< CT32B0_IR: MR3Int Mask                  */
#define CT32B0_IR_MR3Int_SHIFT                   (3U)                                                /*!< CT32B0_IR: MR3Int Position              */
#define CT32B0_IR_MR3Int(x)                      (((uint32_t)(((uint32_t)(x))<<CT32B0_IR_MR3Int_SHIFT))&CT32B0_IR_MR3Int_MASK) /*!< CT32B0_IR                               */
#define CT32B0_IR_CR0Int_MASK                    (0x10U)                                             /*!< CT32B0_IR: CR0Int Mask                  */
#define CT32B0_IR_CR0Int_SHIFT                   (4U)                                                /*!< CT32B0_IR: CR0Int Position              */
#define CT32B0_IR_CR0Int(x)                      (((uint32_t)(((uint32_t)(x))<<CT32B0_IR_CR0Int_SHIFT))&CT32B0_IR_CR0Int_MASK) /*!< CT32B0_IR                               */
/* ------- TCR Bit Fields                           ------ */
#define CT32B0_TCR_CEn_MASK                      (0x1U)                                              /*!< CT32B0_TCR: CEn Mask                    */
#define CT32B0_TCR_CEn_SHIFT                     (0U)                                                /*!< CT32B0_TCR: CEn Position                */
#define CT32B0_TCR_CEn(x)                        (((uint32_t)(((uint32_t)(x))<<CT32B0_TCR_CEn_SHIFT))&CT32B0_TCR_CEn_MASK) /*!< CT32B0_TCR                              */
#define CT32B0_TCR_CRst_MASK                     (0x2U)                                              /*!< CT32B0_TCR: CRst Mask                   */
#define CT32B0_TCR_CRst_SHIFT                    (1U)                                                /*!< CT32B0_TCR: CRst Position               */
#define CT32B0_TCR_CRst(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_TCR_CRst_SHIFT))&CT32B0_TCR_CRst_MASK) /*!< CT32B0_TCR                              */
/* ------- TC Bit Fields                            ------ */
#define CT32B0_TC_TC_MASK                        (0xFFFFFFFFU)                                       /*!< CT32B0_TC: TC Mask                      */
#define CT32B0_TC_TC_SHIFT                       (0U)                                                /*!< CT32B0_TC: TC Position                  */
#define CT32B0_TC_TC(x)                          (((uint32_t)(((uint32_t)(x))<<CT32B0_TC_TC_SHIFT))&CT32B0_TC_TC_MASK) /*!< CT32B0_TC                               */
/* ------- PR Bit Fields                            ------ */
#define CT32B0_PR_PCVAL_MASK                     (0xFFFFFFFFU)                                       /*!< CT32B0_PR: PCVAL Mask                   */
#define CT32B0_PR_PCVAL_SHIFT                    (0U)                                                /*!< CT32B0_PR: PCVAL Position               */
#define CT32B0_PR_PCVAL(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_PR_PCVAL_SHIFT))&CT32B0_PR_PCVAL_MASK) /*!< CT32B0_PR                               */
/* ------- PC Bit Fields                            ------ */
#define CT32B0_PC_PC_MASK                        (0xFFFFFFFFU)                                       /*!< CT32B0_PC: PC Mask                      */
#define CT32B0_PC_PC_SHIFT                       (0U)                                                /*!< CT32B0_PC: PC Position                  */
#define CT32B0_PC_PC(x)                          (((uint32_t)(((uint32_t)(x))<<CT32B0_PC_PC_SHIFT))&CT32B0_PC_PC_MASK) /*!< CT32B0_PC                               */
/* ------- MCR Bit Fields                           ------ */
#define CT32B0_MCR_MR0I_MASK                     (0x1U)                                              /*!< CT32B0_MCR: MR0I Mask                   */
#define CT32B0_MCR_MR0I_SHIFT                    (0U)                                                /*!< CT32B0_MCR: MR0I Position               */
#define CT32B0_MCR_MR0I(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR0I_SHIFT))&CT32B0_MCR_MR0I_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR0R_MASK                     (0x2U)                                              /*!< CT32B0_MCR: MR0R Mask                   */
#define CT32B0_MCR_MR0R_SHIFT                    (1U)                                                /*!< CT32B0_MCR: MR0R Position               */
#define CT32B0_MCR_MR0R(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR0R_SHIFT))&CT32B0_MCR_MR0R_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR0S_MASK                     (0x4U)                                              /*!< CT32B0_MCR: MR0S Mask                   */
#define CT32B0_MCR_MR0S_SHIFT                    (2U)                                                /*!< CT32B0_MCR: MR0S Position               */
#define CT32B0_MCR_MR0S(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR0S_SHIFT))&CT32B0_MCR_MR0S_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR1I_MASK                     (0x8U)                                              /*!< CT32B0_MCR: MR1I Mask                   */
#define CT32B0_MCR_MR1I_SHIFT                    (3U)                                                /*!< CT32B0_MCR: MR1I Position               */
#define CT32B0_MCR_MR1I(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR1I_SHIFT))&CT32B0_MCR_MR1I_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR1R_MASK                     (0x10U)                                             /*!< CT32B0_MCR: MR1R Mask                   */
#define CT32B0_MCR_MR1R_SHIFT                    (4U)                                                /*!< CT32B0_MCR: MR1R Position               */
#define CT32B0_MCR_MR1R(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR1R_SHIFT))&CT32B0_MCR_MR1R_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR1S_MASK                     (0x20U)                                             /*!< CT32B0_MCR: MR1S Mask                   */
#define CT32B0_MCR_MR1S_SHIFT                    (5U)                                                /*!< CT32B0_MCR: MR1S Position               */
#define CT32B0_MCR_MR1S(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR1S_SHIFT))&CT32B0_MCR_MR1S_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR2I_MASK                     (0x40U)                                             /*!< CT32B0_MCR: MR2I Mask                   */
#define CT32B0_MCR_MR2I_SHIFT                    (6U)                                                /*!< CT32B0_MCR: MR2I Position               */
#define CT32B0_MCR_MR2I(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR2I_SHIFT))&CT32B0_MCR_MR2I_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR2R_MASK                     (0x80U)                                             /*!< CT32B0_MCR: MR2R Mask                   */
#define CT32B0_MCR_MR2R_SHIFT                    (7U)                                                /*!< CT32B0_MCR: MR2R Position               */
#define CT32B0_MCR_MR2R(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR2R_SHIFT))&CT32B0_MCR_MR2R_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR2S_MASK                     (0x100U)                                            /*!< CT32B0_MCR: MR2S Mask                   */
#define CT32B0_MCR_MR2S_SHIFT                    (8U)                                                /*!< CT32B0_MCR: MR2S Position               */
#define CT32B0_MCR_MR2S(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR2S_SHIFT))&CT32B0_MCR_MR2S_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR3I_MASK                     (0x200U)                                            /*!< CT32B0_MCR: MR3I Mask                   */
#define CT32B0_MCR_MR3I_SHIFT                    (9U)                                                /*!< CT32B0_MCR: MR3I Position               */
#define CT32B0_MCR_MR3I(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR3I_SHIFT))&CT32B0_MCR_MR3I_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR3R_MASK                     (0x400U)                                            /*!< CT32B0_MCR: MR3R Mask                   */
#define CT32B0_MCR_MR3R_SHIFT                    (10U)                                               /*!< CT32B0_MCR: MR3R Position               */
#define CT32B0_MCR_MR3R(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR3R_SHIFT))&CT32B0_MCR_MR3R_MASK) /*!< CT32B0_MCR                              */
#define CT32B0_MCR_MR3S_MASK                     (0x800U)                                            /*!< CT32B0_MCR: MR3S Mask                   */
#define CT32B0_MCR_MR3S_SHIFT                    (11U)                                               /*!< CT32B0_MCR: MR3S Position               */
#define CT32B0_MCR_MR3S(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MCR_MR3S_SHIFT))&CT32B0_MCR_MR3S_MASK) /*!< CT32B0_MCR                              */
/* ------- MR Bit Fields                            ------ */
#define CT32B0_MR_MATCH_MASK                     (0xFFFFFFFFU)                                       /*!< CT32B0_MR: MATCH Mask                   */
#define CT32B0_MR_MATCH_SHIFT                    (0U)                                                /*!< CT32B0_MR: MATCH Position               */
#define CT32B0_MR_MATCH(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_MR_MATCH_SHIFT))&CT32B0_MR_MATCH_MASK) /*!< CT32B0_MR                               */
/* ------- CCR Bit Fields                           ------ */
#define CT32B0_CCR_CAP0RE_MASK                   (0x1U)                                              /*!< CT32B0_CCR: CAP0RE Mask                 */
#define CT32B0_CCR_CAP0RE_SHIFT                  (0U)                                                /*!< CT32B0_CCR: CAP0RE Position             */
#define CT32B0_CCR_CAP0RE(x)                     (((uint32_t)(((uint32_t)(x))<<CT32B0_CCR_CAP0RE_SHIFT))&CT32B0_CCR_CAP0RE_MASK) /*!< CT32B0_CCR                              */
#define CT32B0_CCR_CAP0FE_MASK                   (0x2U)                                              /*!< CT32B0_CCR: CAP0FE Mask                 */
#define CT32B0_CCR_CAP0FE_SHIFT                  (1U)                                                /*!< CT32B0_CCR: CAP0FE Position             */
#define CT32B0_CCR_CAP0FE(x)                     (((uint32_t)(((uint32_t)(x))<<CT32B0_CCR_CAP0FE_SHIFT))&CT32B0_CCR_CAP0FE_MASK) /*!< CT32B0_CCR                              */
#define CT32B0_CCR_CAP0I_MASK                    (0x4U)                                              /*!< CT32B0_CCR: CAP0I Mask                  */
#define CT32B0_CCR_CAP0I_SHIFT                   (2U)                                                /*!< CT32B0_CCR: CAP0I Position              */
#define CT32B0_CCR_CAP0I(x)                      (((uint32_t)(((uint32_t)(x))<<CT32B0_CCR_CAP0I_SHIFT))&CT32B0_CCR_CAP0I_MASK) /*!< CT32B0_CCR                              */
/* ------- CR0 Bit Fields                           ------ */
#define CT32B0_CR0_CAP_MASK                      (0xFFFFFFFFU)                                       /*!< CT32B0_CR0: CAP Mask                    */
#define CT32B0_CR0_CAP_SHIFT                     (0U)                                                /*!< CT32B0_CR0: CAP Position                */
#define CT32B0_CR0_CAP(x)                        (((uint32_t)(((uint32_t)(x))<<CT32B0_CR0_CAP_SHIFT))&CT32B0_CR0_CAP_MASK) /*!< CT32B0_CR0                              */
/* ------- EMR Bit Fields                           ------ */
#define CT32B0_EMR_EM0_MASK                      (0x1U)                                              /*!< CT32B0_EMR: EM0 Mask                    */
#define CT32B0_EMR_EM0_SHIFT                     (0U)                                                /*!< CT32B0_EMR: EM0 Position                */
#define CT32B0_EMR_EM0(x)                        (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EM0_SHIFT))&CT32B0_EMR_EM0_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EM1_MASK                      (0x2U)                                              /*!< CT32B0_EMR: EM1 Mask                    */
#define CT32B0_EMR_EM1_SHIFT                     (1U)                                                /*!< CT32B0_EMR: EM1 Position                */
#define CT32B0_EMR_EM1(x)                        (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EM1_SHIFT))&CT32B0_EMR_EM1_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EM2_MASK                      (0x4U)                                              /*!< CT32B0_EMR: EM2 Mask                    */
#define CT32B0_EMR_EM2_SHIFT                     (2U)                                                /*!< CT32B0_EMR: EM2 Position                */
#define CT32B0_EMR_EM2(x)                        (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EM2_SHIFT))&CT32B0_EMR_EM2_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EM3_MASK                      (0x8U)                                              /*!< CT32B0_EMR: EM3 Mask                    */
#define CT32B0_EMR_EM3_SHIFT                     (3U)                                                /*!< CT32B0_EMR: EM3 Position                */
#define CT32B0_EMR_EM3(x)                        (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EM3_SHIFT))&CT32B0_EMR_EM3_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EMC0_MASK                     (0x30U)                                             /*!< CT32B0_EMR: EMC0 Mask                   */
#define CT32B0_EMR_EMC0_SHIFT                    (4U)                                                /*!< CT32B0_EMR: EMC0 Position               */
#define CT32B0_EMR_EMC0(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EMC0_SHIFT))&CT32B0_EMR_EMC0_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EMC1_MASK                     (0xC0U)                                             /*!< CT32B0_EMR: EMC1 Mask                   */
#define CT32B0_EMR_EMC1_SHIFT                    (6U)                                                /*!< CT32B0_EMR: EMC1 Position               */
#define CT32B0_EMR_EMC1(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EMC1_SHIFT))&CT32B0_EMR_EMC1_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EMC2_MASK                     (0x300U)                                            /*!< CT32B0_EMR: EMC2 Mask                   */
#define CT32B0_EMR_EMC2_SHIFT                    (8U)                                                /*!< CT32B0_EMR: EMC2 Position               */
#define CT32B0_EMR_EMC2(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EMC2_SHIFT))&CT32B0_EMR_EMC2_MASK) /*!< CT32B0_EMR                              */
#define CT32B0_EMR_EMC3_MASK                     (0xC00U)                                            /*!< CT32B0_EMR: EMC3 Mask                   */
#define CT32B0_EMR_EMC3_SHIFT                    (10U)                                               /*!< CT32B0_EMR: EMC3 Position               */
#define CT32B0_EMR_EMC3(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_EMR_EMC3_SHIFT))&CT32B0_EMR_EMC3_MASK) /*!< CT32B0_EMR                              */
/* ------- CTCR Bit Fields                          ------ */
#define CT32B0_CTCR_CTM_MASK                     (0x3U)                                              /*!< CT32B0_CTCR: CTM Mask                   */
#define CT32B0_CTCR_CTM_SHIFT                    (0U)                                                /*!< CT32B0_CTCR: CTM Position               */
#define CT32B0_CTCR_CTM(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_CTCR_CTM_SHIFT))&CT32B0_CTCR_CTM_MASK) /*!< CT32B0_CTCR                             */
#define CT32B0_CTCR_CIS_MASK                     (0xCU)                                              /*!< CT32B0_CTCR: CIS Mask                   */
#define CT32B0_CTCR_CIS_SHIFT                    (2U)                                                /*!< CT32B0_CTCR: CIS Position               */
#define CT32B0_CTCR_CIS(x)                       (((uint32_t)(((uint32_t)(x))<<CT32B0_CTCR_CIS_SHIFT))&CT32B0_CTCR_CIS_MASK) /*!< CT32B0_CTCR                             */
/* ------- PWMC Bit Fields                          ------ */
#define CT32B0_PWMC_PWMEN0_MASK                  (0x1U)                                              /*!< CT32B0_PWMC: PWMEN0 Mask                */
#define CT32B0_PWMC_PWMEN0_SHIFT                 (0U)                                                /*!< CT32B0_PWMC: PWMEN0 Position            */
#define CT32B0_PWMC_PWMEN0(x)                    (((uint32_t)(((uint32_t)(x))<<CT32B0_PWMC_PWMEN0_SHIFT))&CT32B0_PWMC_PWMEN0_MASK) /*!< CT32B0_PWMC                             */
#define CT32B0_PWMC_PWMEN1_MASK                  (0x2U)                                              /*!< CT32B0_PWMC: PWMEN1 Mask                */
#define CT32B0_PWMC_PWMEN1_SHIFT                 (1U)                                                /*!< CT32B0_PWMC: PWMEN1 Position            */
#define CT32B0_PWMC_PWMEN1(x)                    (((uint32_t)(((uint32_t)(x))<<CT32B0_PWMC_PWMEN1_SHIFT))&CT32B0_PWMC_PWMEN1_MASK) /*!< CT32B0_PWMC                             */
#define CT32B0_PWMC_PWMEN2_MASK                  (0x4U)                                              /*!< CT32B0_PWMC: PWMEN2 Mask                */
#define CT32B0_PWMC_PWMEN2_SHIFT                 (2U)                                                /*!< CT32B0_PWMC: PWMEN2 Position            */
#define CT32B0_PWMC_PWMEN2(x)                    (((uint32_t)(((uint32_t)(x))<<CT32B0_PWMC_PWMEN2_SHIFT))&CT32B0_PWMC_PWMEN2_MASK) /*!< CT32B0_PWMC                             */
#define CT32B0_PWMC_PWMEN3_MASK                  (0x8U)                                              /*!< CT32B0_PWMC: PWMEN3 Mask                */
#define CT32B0_PWMC_PWMEN3_SHIFT                 (3U)                                                /*!< CT32B0_PWMC: PWMEN3 Position            */
#define CT32B0_PWMC_PWMEN3(x)                    (((uint32_t)(((uint32_t)(x))<<CT32B0_PWMC_PWMEN3_SHIFT))&CT32B0_PWMC_PWMEN3_MASK) /*!< CT32B0_PWMC                             */
/**
 * @} */ /* End group CT32B_Register_Masks_GROUP 
 */

/* CT32B0 - Peripheral instance base addresses */
#define CT32B0_BasePtr                 0x40014000UL //!< Peripheral base address
#define CT32B0                         ((CT32B0_Type *) CT32B0_BasePtr) //!< Freescale base pointer
#define CT32B0_BASE_PTR                (CT32B0) //!< Freescale style base pointer
/**
 * @} */ /* End group CT32B_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup CT32B_Peripheral_access_layer_GROUP CT32B Peripheral Access Layer
* @brief C Struct for CT32B
* @{
*/

