podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/* ================================================================================ */
/* ================           CT32B1 (derived from CT32B0)         ================ */
/* ================================================================================ */

/**
 * @brief 32-bit counter/timer
 */

/* CT32B1 - Peripheral instance base addresses */
#define CT32B1_BasePtr                 0x40018000UL //!< Peripheral base address
#define CT32B1                         ((CT32B0_Type *) CT32B1_BasePtr) //!< Freescale base pointer
#define CT32B1_BASE_PTR                (CT32B1) //!< Freescale style base pointer
/**
 * @} */ /* End group CT32B_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup C_CAN_Peripheral_access_layer_GROUP C_CAN Peripheral Access Layer
* @brief C Struct for C_CAN
* @{
*/

/* ================================================================================ */
/* ================           C_CAN (file:C_CAN_LPC11Cxx)          ================ */
/* ================================================================================ */

/**
 * @brief C_CAN controller
 */
/**
* @addtogroup C_CAN_structs_GROUP C_CAN struct
* @brief Struct for C_CAN
* @{
*/
typedef struct {                                /*       C_CAN Structure                                              */
   __IO uint32_t  CANCNTL;                      /**< 0000: CAN control                                                  */
   __IO uint32_t  CANSTAT;                      /**< 0004: Status register                                              */
   __I  uint32_t  CANEC;                        /**< 0008: Error counter                                                */
   __IO uint32_t  CANBT;                        /**< 000C: Bit timing register                                          */
   __I  uint32_t  CANINT;                       /**< 0010: Interrupt register                                           */
   __IO uint32_t  CANTEST;                      /**< 0014: Test register                                                */
   __IO uint32_t  CANBRPE;                      /**< 0018: Baud rate prescaler extension register                       */
        uint8_t   RESERVED_0[4];               
   __IO uint32_t  CANIF1_CMDREQ;                /**< 0020: Message interface 1 command request                          */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  CANIF1_CMDMSK_R;           /**< 0024: Message interface 1 command mask (read direction)            */
      __IO uint32_t  CANIF1_CMDMSK_W;           /**< 0024: Message interface 1 command mask (write direction)           */
   };
   __IO uint32_t  CANIF1_MSK1;                  /**< 0028: Message interface 1 mask 1                                   */
   __IO uint32_t  CANIF1_MSK2;                  /**< 002C: Message interface 1 mask 2                                   */
   __IO uint32_t  CANIF1_ARB1;                  /**< 0030: Message interface 1 arbitration 1                            */
   __IO uint32_t  CANIF1_ARB2;                  /**< 0034: Message interface 1 arbitration 2                            */
   __IO uint32_t  CANIF1_MCTRL;                 /**< 0038: Message interface 1 message control                          */
   __IO uint32_t  CANIF1_DA1;                   /**< 003C: Message interface 1 data A1                                  */
   __IO uint32_t  CANIF1_DA2;                   /**< 0040: Message interface 1 data A2                                  */
   __IO uint32_t  CANIF1_DB1;                   /**< 0044: Message interface 1 data B1                                  */
   __IO uint32_t  CANIF1_DB2;                   /**< 0048: Message interface 1 data B2                                  */
        uint8_t   RESERVED_1[52];              
   __IO uint32_t  CANIF2_CMDREQ;                /**< 0080: Message interface 1 command request                          */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  CANIF2_CMDMSK_R;           /**< 0084: Message interface 1 command mask (read direction)            */
      __IO uint32_t  CANIF2_CMDMSK_W;           /**< 0084: Message interface 1 command mask (write direction)           */
   };
   __IO uint32_t  CANIF2_MSK1;                  /**< 0088: Message interface 1 mask 1                                   */
   __IO uint32_t  CANIF2_MSK2;                  /**< 008C: Message interface 1 mask 2                                   */
   __IO uint32_t  CANIF2_ARB1;                  /**< 0090: Message interface 1 arbitration 1                            */
   __IO uint32_t  CANIF2_ARB2;                  /**< 0094: Message interface 1 arbitration 2                            */
   __IO uint32_t  CANIF2_MCTRL;                 /**< 0098: Message interface 1 message control                          */
   __IO uint32_t  CANIF2_DA1;                   /**< 009C: Message interface 1 data A1                                  */
   __IO uint32_t  CANIF2_DA2;                   /**< 00A0: Message interface 1 data A2                                  */
   __IO uint32_t  CANIF2_DB1;                   /**< 00A4: Message interface 1 data B1                                  */
   __IO uint32_t  CANIF2_DB2;                   /**< 00A8: Message interface 1 data B2                                  */
        uint8_t   RESERVED_2[84];              
   __I  uint32_t  CANTXREQ1;                    /**< 0100: Transmission request 1                                       */
   __I  uint32_t  CANTXREQ2;                    /**< 0104: Transmission request 2                                       */
        uint8_t   RESERVED_3[24];              
   __I  uint32_t  CANND1;                       /**< 0120: New data 1                                                   */
   __I  uint32_t  CANND2;                       /**< 0124: New data 2                                                   */
        uint8_t   RESERVED_4[24];              
   __I  uint32_t  CANIR1;                       /**< 0140: Interrupt pending 1                                          */
   __I  uint32_t  CANIR2;                       /**< 0144: Interrupt pending 2                                          */
        uint8_t   RESERVED_5[24];              
   __I  uint32_t  CANMSGV1;                     /**< 0160: Message valid 1                                              */
   __I  uint32_t  CANMSGV2;                     /**< 0164: Message valid 2                                              */
        uint8_t   RESERVED_6[24];              
   __IO uint32_t  CANCLKDIV;                    /**< 0180: Can clock divider register                                   */
} C_CAN_Type;

/**
 * @} */ /* End group C_CAN_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'C_CAN' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

