podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup C_CAN_Register_Masks_GROUP C_CAN Register Masks
* @brief Register Masks for C_CAN
* @{
*/
/* ------- CANCNTL Bit Fields                       ------ */
#define C_CAN_CANCNTL_INIT_MASK                  (0x1U)                                              /*!< C_CAN_CANCNTL: INIT Mask                */
#define C_CAN_CANCNTL_INIT_SHIFT                 (0U)                                                /*!< C_CAN_CANCNTL: INIT Position            */
#define C_CAN_CANCNTL_INIT(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_INIT_SHIFT))&C_CAN_CANCNTL_INIT_MASK) /*!< C_CAN_CANCNTL                           */
#define C_CAN_CANCNTL_IE_MASK                    (0x2U)                                              /*!< C_CAN_CANCNTL: IE Mask                  */
#define C_CAN_CANCNTL_IE_SHIFT                   (1U)                                                /*!< C_CAN_CANCNTL: IE Position              */
#define C_CAN_CANCNTL_IE(x)                      (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_IE_SHIFT))&C_CAN_CANCNTL_IE_MASK) /*!< C_CAN_CANCNTL                           */
#define C_CAN_CANCNTL_SIE_MASK                   (0x4U)                                              /*!< C_CAN_CANCNTL: SIE Mask                 */
#define C_CAN_CANCNTL_SIE_SHIFT                  (2U)                                                /*!< C_CAN_CANCNTL: SIE Position             */
#define C_CAN_CANCNTL_SIE(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_SIE_SHIFT))&C_CAN_CANCNTL_SIE_MASK) /*!< C_CAN_CANCNTL                           */
#define C_CAN_CANCNTL_EIE_MASK                   (0x8U)                                              /*!< C_CAN_CANCNTL: EIE Mask                 */
#define C_CAN_CANCNTL_EIE_SHIFT                  (3U)                                                /*!< C_CAN_CANCNTL: EIE Position             */
#define C_CAN_CANCNTL_EIE(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_EIE_SHIFT))&C_CAN_CANCNTL_EIE_MASK) /*!< C_CAN_CANCNTL                           */
#define C_CAN_CANCNTL_DAR_MASK                   (0x20U)                                             /*!< C_CAN_CANCNTL: DAR Mask                 */
#define C_CAN_CANCNTL_DAR_SHIFT                  (5U)                                                /*!< C_CAN_CANCNTL: DAR Position             */
#define C_CAN_CANCNTL_DAR(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_DAR_SHIFT))&C_CAN_CANCNTL_DAR_MASK) /*!< C_CAN_CANCNTL                           */
#define C_CAN_CANCNTL_CCE_MASK                   (0x40U)                                             /*!< C_CAN_CANCNTL: CCE Mask                 */
#define C_CAN_CANCNTL_CCE_SHIFT                  (6U)                                                /*!< C_CAN_CANCNTL: CCE Position             */
#define C_CAN_CANCNTL_CCE(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_CCE_SHIFT))&C_CAN_CANCNTL_CCE_MASK) /*!< C_CAN_CANCNTL                           */
#define C_CAN_CANCNTL_ENUM_MASK                  (0x80U)                                             /*!< C_CAN_CANCNTL: ENUM Mask                */
#define C_CAN_CANCNTL_ENUM_SHIFT                 (7U)                                                /*!< C_CAN_CANCNTL: ENUM Position            */
#define C_CAN_CANCNTL_ENUM(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCNTL_ENUM_SHIFT))&C_CAN_CANCNTL_ENUM_MASK) /*!< C_CAN_CANCNTL                           */
/* ------- CANSTAT Bit Fields                       ------ */
#define C_CAN_CANSTAT_LEC_MASK                   (0x7U)                                              /*!< C_CAN_CANSTAT: LEC Mask                 */
#define C_CAN_CANSTAT_LEC_SHIFT                  (0U)                                                /*!< C_CAN_CANSTAT: LEC Position             */
#define C_CAN_CANSTAT_LEC(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANSTAT_LEC_SHIFT))&C_CAN_CANSTAT_LEC_MASK) /*!< C_CAN_CANSTAT                           */
#define C_CAN_CANSTAT_TXOK_MASK                  (0x8U)                                              /*!< C_CAN_CANSTAT: TXOK Mask                */
#define C_CAN_CANSTAT_TXOK_SHIFT                 (3U)                                                /*!< C_CAN_CANSTAT: TXOK Position            */
#define C_CAN_CANSTAT_TXOK(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANSTAT_TXOK_SHIFT))&C_CAN_CANSTAT_TXOK_MASK) /*!< C_CAN_CANSTAT                           */
#define C_CAN_CANSTAT_RXOK_MASK                  (0x10U)                                             /*!< C_CAN_CANSTAT: RXOK Mask                */
#define C_CAN_CANSTAT_RXOK_SHIFT                 (4U)                                                /*!< C_CAN_CANSTAT: RXOK Position            */
#define C_CAN_CANSTAT_RXOK(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANSTAT_RXOK_SHIFT))&C_CAN_CANSTAT_RXOK_MASK) /*!< C_CAN_CANSTAT                           */
#define C_CAN_CANSTAT_EPASS_MASK                 (0x20U)                                             /*!< C_CAN_CANSTAT: EPASS Mask               */
#define C_CAN_CANSTAT_EPASS_SHIFT                (5U)                                                /*!< C_CAN_CANSTAT: EPASS Position           */
#define C_CAN_CANSTAT_EPASS(x)                   (((uint32_t)(((uint32_t)(x))<<C_CAN_CANSTAT_EPASS_SHIFT))&C_CAN_CANSTAT_EPASS_MASK) /*!< C_CAN_CANSTAT                           */
#define C_CAN_CANSTAT_EWARN_MASK                 (0x40U)                                             /*!< C_CAN_CANSTAT: EWARN Mask               */
#define C_CAN_CANSTAT_EWARN_SHIFT                (6U)                                                /*!< C_CAN_CANSTAT: EWARN Position           */
#define C_CAN_CANSTAT_EWARN(x)                   (((uint32_t)(((uint32_t)(x))<<C_CAN_CANSTAT_EWARN_SHIFT))&C_CAN_CANSTAT_EWARN_MASK) /*!< C_CAN_CANSTAT                           */
#define C_CAN_CANSTAT_BOFF_MASK                  (0x80U)                                             /*!< C_CAN_CANSTAT: BOFF Mask                */
#define C_CAN_CANSTAT_BOFF_SHIFT                 (7U)                                                /*!< C_CAN_CANSTAT: BOFF Position            */
#define C_CAN_CANSTAT_BOFF(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANSTAT_BOFF_SHIFT))&C_CAN_CANSTAT_BOFF_MASK) /*!< C_CAN_CANSTAT                           */
/* ------- CANEC Bit Fields                         ------ */
#define C_CAN_CANEC_TEC7_0_MASK                  (0xFFU)                                             /*!< C_CAN_CANEC: TEC7_0 Mask                */
#define C_CAN_CANEC_TEC7_0_SHIFT                 (0U)                                                /*!< C_CAN_CANEC: TEC7_0 Position            */
#define C_CAN_CANEC_TEC7_0(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANEC_TEC7_0_SHIFT))&C_CAN_CANEC_TEC7_0_MASK) /*!< C_CAN_CANEC                             */
#define C_CAN_CANEC_REC6_0_MASK                  (0x7F00U)                                           /*!< C_CAN_CANEC: REC6_0 Mask                */
#define C_CAN_CANEC_REC6_0_SHIFT                 (8U)                                                /*!< C_CAN_CANEC: REC6_0 Position            */
#define C_CAN_CANEC_REC6_0(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANEC_REC6_0_SHIFT))&C_CAN_CANEC_REC6_0_MASK) /*!< C_CAN_CANEC                             */
#define C_CAN_CANEC_RP_MASK                      (0x8000U)                                           /*!< C_CAN_CANEC: RP Mask                    */
#define C_CAN_CANEC_RP_SHIFT                     (15U)                                               /*!< C_CAN_CANEC: RP Position                */
#define C_CAN_CANEC_RP(x)                        (((uint32_t)(((uint32_t)(x))<<C_CAN_CANEC_RP_SHIFT))&C_CAN_CANEC_RP_MASK) /*!< C_CAN_CANEC                             */
/* ------- CANBT Bit Fields                         ------ */
#define C_CAN_CANBT_BRP_MASK                     (0x3FU)                                             /*!< C_CAN_CANBT: BRP Mask                   */
#define C_CAN_CANBT_BRP_SHIFT                    (0U)                                                /*!< C_CAN_CANBT: BRP Position               */
#define C_CAN_CANBT_BRP(x)                       (((uint32_t)(((uint32_t)(x))<<C_CAN_CANBT_BRP_SHIFT))&C_CAN_CANBT_BRP_MASK) /*!< C_CAN_CANBT                             */
#define C_CAN_CANBT_SJW_MASK                     (0xC0U)                                             /*!< C_CAN_CANBT: SJW Mask                   */
#define C_CAN_CANBT_SJW_SHIFT                    (6U)                                                /*!< C_CAN_CANBT: SJW Position               */
#define C_CAN_CANBT_SJW(x)                       (((uint32_t)(((uint32_t)(x))<<C_CAN_CANBT_SJW_SHIFT))&C_CAN_CANBT_SJW_MASK) /*!< C_CAN_CANBT                             */
#define C_CAN_CANBT_TSEG1_MASK                   (0xF00U)                                            /*!< C_CAN_CANBT: TSEG1 Mask                 */
#define C_CAN_CANBT_TSEG1_SHIFT                  (8U)                                                /*!< C_CAN_CANBT: TSEG1 Position             */
#define C_CAN_CANBT_TSEG1(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANBT_TSEG1_SHIFT))&C_CAN_CANBT_TSEG1_MASK) /*!< C_CAN_CANBT                             */
#define C_CAN_CANBT_TSEG2_MASK                   (0x7000U)                                           /*!< C_CAN_CANBT: TSEG2 Mask                 */
#define C_CAN_CANBT_TSEG2_SHIFT                  (12U)                                               /*!< C_CAN_CANBT: TSEG2 Position             */
#define C_CAN_CANBT_TSEG2(x)                     (((uint32_t)(((uint32_t)(x))<<C_CAN_CANBT_TSEG2_SHIFT))&C_CAN_CANBT_TSEG2_MASK) /*!< C_CAN_CANBT                             */
/* ------- CANINT Bit Fields                        ------ */
#define C_CAN_CANINT_INTID_MASK                  (0xFFFFU)                                           /*!< C_CAN_CANINT: INTID Mask                */
#define C_CAN_CANINT_INTID_SHIFT                 (0U)                                                /*!< C_CAN_CANINT: INTID Position            */
#define C_CAN_CANINT_INTID(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANINT_INTID_SHIFT))&C_CAN_CANINT_INTID_MASK) /*!< C_CAN_CANINT                            */
/* ------- CANTEST Bit Fields                       ------ */
#define C_CAN_CANTEST_BASIC_MASK                 (0x4U)                                              /*!< C_CAN_CANTEST: BASIC Mask               */
#define C_CAN_CANTEST_BASIC_SHIFT                (2U)                                                /*!< C_CAN_CANTEST: BASIC Position           */
#define C_CAN_CANTEST_BASIC(x)                   (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTEST_BASIC_SHIFT))&C_CAN_CANTEST_BASIC_MASK) /*!< C_CAN_CANTEST                           */
#define C_CAN_CANTEST_SILENT_MASK                (0x8U)                                              /*!< C_CAN_CANTEST: SILENT Mask              */
#define C_CAN_CANTEST_SILENT_SHIFT               (3U)                                                /*!< C_CAN_CANTEST: SILENT Position          */
#define C_CAN_CANTEST_SILENT(x)                  (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTEST_SILENT_SHIFT))&C_CAN_CANTEST_SILENT_MASK) /*!< C_CAN_CANTEST                           */
#define C_CAN_CANTEST_LBACK_MASK                 (0x10U)                                             /*!< C_CAN_CANTEST: LBACK Mask               */
#define C_CAN_CANTEST_LBACK_SHIFT                (4U)                                                /*!< C_CAN_CANTEST: LBACK Position           */
#define C_CAN_CANTEST_LBACK(x)                   (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTEST_LBACK_SHIFT))&C_CAN_CANTEST_LBACK_MASK) /*!< C_CAN_CANTEST                           */
#define C_CAN_CANTEST_TX_MASK                    (0x60U)                                             /*!< C_CAN_CANTEST: TX Mask                  */
#define C_CAN_CANTEST_TX_SHIFT                   (5U)                                                /*!< C_CAN_CANTEST: TX Position              */
#define C_CAN_CANTEST_TX(x)                      (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTEST_TX_SHIFT))&C_CAN_CANTEST_TX_MASK) /*!< C_CAN_CANTEST                           */
#define C_CAN_CANTEST_RX_MASK                    (0x80U)                                             /*!< C_CAN_CANTEST: RX Mask                  */
#define C_CAN_CANTEST_RX_SHIFT                   (7U)                                                /*!< C_CAN_CANTEST: RX Position              */
#define C_CAN_CANTEST_RX(x)                      (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTEST_RX_SHIFT))&C_CAN_CANTEST_RX_MASK) /*!< C_CAN_CANTEST                           */
/* ------- CANBRPE Bit Fields                       ------ */
#define C_CAN_CANBRPE_BRPE_MASK                  (0xFU)                                              /*!< C_CAN_CANBRPE: BRPE Mask                */
#define C_CAN_CANBRPE_BRPE_SHIFT                 (0U)                                                /*!< C_CAN_CANBRPE: BRPE Position            */
#define C_CAN_CANBRPE_BRPE(x)                    (((uint32_t)(((uint32_t)(x))<<C_CAN_CANBRPE_BRPE_SHIFT))&C_CAN_CANBRPE_BRPE_MASK) /*!< C_CAN_CANBRPE                           */
/* ------- CANIF1_CMDREQ Bit Fields                 ------ */
#define C_CAN_CANIF1_CMDREQ_MN_MASK              (0x3FU)                                             /*!< C_CAN_CANIF1_CMDREQ: MN Mask            */
#define C_CAN_CANIF1_CMDREQ_MN_SHIFT             (0U)                                                /*!< C_CAN_CANIF1_CMDREQ: MN Position        */
#define C_CAN_CANIF1_CMDREQ_MN(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDREQ_MN_SHIFT))&C_CAN_CANIF1_CMDREQ_MN_MASK) /*!< C_CAN_CANIF1_CMDREQ                     */
#define C_CAN_CANIF1_CMDREQ_BUSY_MASK            (0x8000U)                                           /*!< C_CAN_CANIF1_CMDREQ: BUSY Mask          */
#define C_CAN_CANIF1_CMDREQ_BUSY_SHIFT           (15U)                                               /*!< C_CAN_CANIF1_CMDREQ: BUSY Position      */
#define C_CAN_CANIF1_CMDREQ_BUSY(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDREQ_BUSY_SHIFT))&C_CAN_CANIF1_CMDREQ_BUSY_MASK) /*!< C_CAN_CANIF1_CMDREQ                     */
/* ------- CANIF1_CMDMSK_R Bit Fields               ------ */
#define C_CAN_CANIF1_CMDMSK_R_DATA_B_MASK        (0x1U)                                              /*!< C_CAN_CANIF1_CMDMSK_R: DATA_B Mask      */
#define C_CAN_CANIF1_CMDMSK_R_DATA_B_SHIFT       (0U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: DATA_B Position  */
#define C_CAN_CANIF1_CMDMSK_R_DATA_B(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_DATA_B_SHIFT))&C_CAN_CANIF1_CMDMSK_R_DATA_B_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_DATA_A_MASK        (0x2U)                                              /*!< C_CAN_CANIF1_CMDMSK_R: DATA_A Mask      */
#define C_CAN_CANIF1_CMDMSK_R_DATA_A_SHIFT       (1U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: DATA_A Position  */
#define C_CAN_CANIF1_CMDMSK_R_DATA_A(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_DATA_A_SHIFT))&C_CAN_CANIF1_CMDMSK_R_DATA_A_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_NEWDAT_MASK        (0x4U)                                              /*!< C_CAN_CANIF1_CMDMSK_R: NEWDAT Mask      */
#define C_CAN_CANIF1_CMDMSK_R_NEWDAT_SHIFT       (2U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: NEWDAT Position  */
#define C_CAN_CANIF1_CMDMSK_R_NEWDAT(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_NEWDAT_SHIFT))&C_CAN_CANIF1_CMDMSK_R_NEWDAT_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_CLRINTPND_MASK     (0x8U)                                              /*!< C_CAN_CANIF1_CMDMSK_R: CLRINTPND Mask   */
#define C_CAN_CANIF1_CMDMSK_R_CLRINTPND_SHIFT    (3U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: CLRINTPND Position*/
#define C_CAN_CANIF1_CMDMSK_R_CLRINTPND(x)       (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_CLRINTPND_SHIFT))&C_CAN_CANIF1_CMDMSK_R_CLRINTPND_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_CTRL_MASK          (0x10U)                                             /*!< C_CAN_CANIF1_CMDMSK_R: CTRL Mask        */
#define C_CAN_CANIF1_CMDMSK_R_CTRL_SHIFT         (4U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: CTRL Position    */
#define C_CAN_CANIF1_CMDMSK_R_CTRL(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_CTRL_SHIFT))&C_CAN_CANIF1_CMDMSK_R_CTRL_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_ARB_MASK           (0x20U)                                             /*!< C_CAN_CANIF1_CMDMSK_R: ARB Mask         */
#define C_CAN_CANIF1_CMDMSK_R_ARB_SHIFT          (5U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: ARB Position     */
#define C_CAN_CANIF1_CMDMSK_R_ARB(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_ARB_SHIFT))&C_CAN_CANIF1_CMDMSK_R_ARB_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_MASK_MASK          (0x40U)                                             /*!< C_CAN_CANIF1_CMDMSK_R: MASK Mask        */
#define C_CAN_CANIF1_CMDMSK_R_MASK_SHIFT         (6U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: MASK Position    */
#define C_CAN_CANIF1_CMDMSK_R_MASK(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_MASK_SHIFT))&C_CAN_CANIF1_CMDMSK_R_MASK_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
#define C_CAN_CANIF1_CMDMSK_R_WR_RD_MASK         (0x80U)                                             /*!< C_CAN_CANIF1_CMDMSK_R: WR_RD Mask       */
#define C_CAN_CANIF1_CMDMSK_R_WR_RD_SHIFT        (7U)                                                /*!< C_CAN_CANIF1_CMDMSK_R: WR_RD Position   */
#define C_CAN_CANIF1_CMDMSK_R_WR_RD(x)           (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_R_WR_RD_SHIFT))&C_CAN_CANIF1_CMDMSK_R_WR_RD_MASK) /*!< C_CAN_CANIF1_CMDMSK_R                   */
/* ------- CANIF1_CMDMSK_W Bit Fields               ------ */
#define C_CAN_CANIF1_CMDMSK_W_DATA_B_MASK        (0x1U)                                              /*!< C_CAN_CANIF1_CMDMSK_W: DATA_B Mask      */
#define C_CAN_CANIF1_CMDMSK_W_DATA_B_SHIFT       (0U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: DATA_B Position  */
#define C_CAN_CANIF1_CMDMSK_W_DATA_B(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_DATA_B_SHIFT))&C_CAN_CANIF1_CMDMSK_W_DATA_B_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_DATA_A_MASK        (0x2U)                                              /*!< C_CAN_CANIF1_CMDMSK_W: DATA_A Mask      */
#define C_CAN_CANIF1_CMDMSK_W_DATA_A_SHIFT       (1U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: DATA_A Position  */
#define C_CAN_CANIF1_CMDMSK_W_DATA_A(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_DATA_A_SHIFT))&C_CAN_CANIF1_CMDMSK_W_DATA_A_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_TXRQST_MASK        (0x4U)                                              /*!< C_CAN_CANIF1_CMDMSK_W: TXRQST Mask      */
#define C_CAN_CANIF1_CMDMSK_W_TXRQST_SHIFT       (2U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: TXRQST Position  */
#define C_CAN_CANIF1_CMDMSK_W_TXRQST(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_TXRQST_SHIFT))&C_CAN_CANIF1_CMDMSK_W_TXRQST_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_CLRINTPND_MASK     (0x8U)                                              /*!< C_CAN_CANIF1_CMDMSK_W: CLRINTPND Mask   */
#define C_CAN_CANIF1_CMDMSK_W_CLRINTPND_SHIFT    (3U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: CLRINTPND Position*/
#define C_CAN_CANIF1_CMDMSK_W_CLRINTPND(x)       (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_CLRINTPND_SHIFT))&C_CAN_CANIF1_CMDMSK_W_CLRINTPND_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_CTRL_MASK          (0x10U)                                             /*!< C_CAN_CANIF1_CMDMSK_W: CTRL Mask        */
#define C_CAN_CANIF1_CMDMSK_W_CTRL_SHIFT         (4U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: CTRL Position    */
#define C_CAN_CANIF1_CMDMSK_W_CTRL(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_CTRL_SHIFT))&C_CAN_CANIF1_CMDMSK_W_CTRL_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_ARB_MASK           (0x20U)                                             /*!< C_CAN_CANIF1_CMDMSK_W: ARB Mask         */
#define C_CAN_CANIF1_CMDMSK_W_ARB_SHIFT          (5U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: ARB Position     */
#define C_CAN_CANIF1_CMDMSK_W_ARB(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_ARB_SHIFT))&C_CAN_CANIF1_CMDMSK_W_ARB_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_MASK_MASK          (0x40U)                                             /*!< C_CAN_CANIF1_CMDMSK_W: MASK Mask        */
#define C_CAN_CANIF1_CMDMSK_W_MASK_SHIFT         (6U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: MASK Position    */
#define C_CAN_CANIF1_CMDMSK_W_MASK(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_MASK_SHIFT))&C_CAN_CANIF1_CMDMSK_W_MASK_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
#define C_CAN_CANIF1_CMDMSK_W_WR_RD_MASK         (0x80U)                                             /*!< C_CAN_CANIF1_CMDMSK_W: WR_RD Mask       */
#define C_CAN_CANIF1_CMDMSK_W_WR_RD_SHIFT        (7U)                                                /*!< C_CAN_CANIF1_CMDMSK_W: WR_RD Position   */
#define C_CAN_CANIF1_CMDMSK_W_WR_RD(x)           (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_CMDMSK_W_WR_RD_SHIFT))&C_CAN_CANIF1_CMDMSK_W_WR_RD_MASK) /*!< C_CAN_CANIF1_CMDMSK_W                   */
/* ------- CANIF1_MSK1 Bit Fields                   ------ */
#define C_CAN_CANIF1_MSK1_MSK15_0_MASK           (0xFFFFU)                                           /*!< C_CAN_CANIF1_MSK1: MSK15_0 Mask         */
#define C_CAN_CANIF1_MSK1_MSK15_0_SHIFT          (0U)                                                /*!< C_CAN_CANIF1_MSK1: MSK15_0 Position     */
#define C_CAN_CANIF1_MSK1_MSK15_0(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MSK1_MSK15_0_SHIFT))&C_CAN_CANIF1_MSK1_MSK15_0_MASK) /*!< C_CAN_CANIF1_MSK1                       */
/* ------- CANIF1_MSK2 Bit Fields                   ------ */
#define C_CAN_CANIF1_MSK2_MSK28_16_MASK          (0x1FFFU)                                           /*!< C_CAN_CANIF1_MSK2: MSK28_16 Mask        */
#define C_CAN_CANIF1_MSK2_MSK28_16_SHIFT         (0U)                                                /*!< C_CAN_CANIF1_MSK2: MSK28_16 Position    */
#define C_CAN_CANIF1_MSK2_MSK28_16(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MSK2_MSK28_16_SHIFT))&C_CAN_CANIF1_MSK2_MSK28_16_MASK) /*!< C_CAN_CANIF1_MSK2                       */
#define C_CAN_CANIF1_MSK2_MDIR_MASK              (0x4000U)                                           /*!< C_CAN_CANIF1_MSK2: MDIR Mask            */
#define C_CAN_CANIF1_MSK2_MDIR_SHIFT             (14U)                                               /*!< C_CAN_CANIF1_MSK2: MDIR Position        */
