podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define C_CAN_CANIF1_MSK2_MDIR(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MSK2_MDIR_SHIFT))&C_CAN_CANIF1_MSK2_MDIR_MASK) /*!< C_CAN_CANIF1_MSK2                       */
#define C_CAN_CANIF1_MSK2_MXTD_MASK              (0x8000U)                                           /*!< C_CAN_CANIF1_MSK2: MXTD Mask            */
#define C_CAN_CANIF1_MSK2_MXTD_SHIFT             (15U)                                               /*!< C_CAN_CANIF1_MSK2: MXTD Position        */
#define C_CAN_CANIF1_MSK2_MXTD(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MSK2_MXTD_SHIFT))&C_CAN_CANIF1_MSK2_MXTD_MASK) /*!< C_CAN_CANIF1_MSK2                       */
/* ------- CANIF1_ARB1 Bit Fields                   ------ */
#define C_CAN_CANIF1_ARB1_ID15_0_MASK            (0xFFFFU)                                           /*!< C_CAN_CANIF1_ARB1: ID15_0 Mask          */
#define C_CAN_CANIF1_ARB1_ID15_0_SHIFT           (0U)                                                /*!< C_CAN_CANIF1_ARB1: ID15_0 Position      */
#define C_CAN_CANIF1_ARB1_ID15_0(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_ARB1_ID15_0_SHIFT))&C_CAN_CANIF1_ARB1_ID15_0_MASK) /*!< C_CAN_CANIF1_ARB1                       */
/* ------- CANIF1_ARB2 Bit Fields                   ------ */
#define C_CAN_CANIF1_ARB2_ID28_16_MASK           (0x1FFFU)                                           /*!< C_CAN_CANIF1_ARB2: ID28_16 Mask         */
#define C_CAN_CANIF1_ARB2_ID28_16_SHIFT          (0U)                                                /*!< C_CAN_CANIF1_ARB2: ID28_16 Position     */
#define C_CAN_CANIF1_ARB2_ID28_16(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_ARB2_ID28_16_SHIFT))&C_CAN_CANIF1_ARB2_ID28_16_MASK) /*!< C_CAN_CANIF1_ARB2                       */
#define C_CAN_CANIF1_ARB2_DIR_MASK               (0x2000U)                                           /*!< C_CAN_CANIF1_ARB2: DIR Mask             */
#define C_CAN_CANIF1_ARB2_DIR_SHIFT              (13U)                                               /*!< C_CAN_CANIF1_ARB2: DIR Position         */
#define C_CAN_CANIF1_ARB2_DIR(x)                 (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_ARB2_DIR_SHIFT))&C_CAN_CANIF1_ARB2_DIR_MASK) /*!< C_CAN_CANIF1_ARB2                       */
#define C_CAN_CANIF1_ARB2_XTD_MASK               (0x4000U)                                           /*!< C_CAN_CANIF1_ARB2: XTD Mask             */
#define C_CAN_CANIF1_ARB2_XTD_SHIFT              (14U)                                               /*!< C_CAN_CANIF1_ARB2: XTD Position         */
#define C_CAN_CANIF1_ARB2_XTD(x)                 (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_ARB2_XTD_SHIFT))&C_CAN_CANIF1_ARB2_XTD_MASK) /*!< C_CAN_CANIF1_ARB2                       */
#define C_CAN_CANIF1_ARB2_MSGVAL_MASK            (0x8000U)                                           /*!< C_CAN_CANIF1_ARB2: MSGVAL Mask          */
#define C_CAN_CANIF1_ARB2_MSGVAL_SHIFT           (15U)                                               /*!< C_CAN_CANIF1_ARB2: MSGVAL Position      */
#define C_CAN_CANIF1_ARB2_MSGVAL(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_ARB2_MSGVAL_SHIFT))&C_CAN_CANIF1_ARB2_MSGVAL_MASK) /*!< C_CAN_CANIF1_ARB2                       */
/* ------- CANIF1_MCTRL Bit Fields                  ------ */
#define C_CAN_CANIF1_MCTRL_DLC3_0_MASK           (0xFU)                                              /*!< C_CAN_CANIF1_MCTRL: DLC3_0 Mask         */
#define C_CAN_CANIF1_MCTRL_DLC3_0_SHIFT          (0U)                                                /*!< C_CAN_CANIF1_MCTRL: DLC3_0 Position     */
#define C_CAN_CANIF1_MCTRL_DLC3_0(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_DLC3_0_SHIFT))&C_CAN_CANIF1_MCTRL_DLC3_0_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_EOB_MASK              (0x80U)                                             /*!< C_CAN_CANIF1_MCTRL: EOB Mask            */
#define C_CAN_CANIF1_MCTRL_EOB_SHIFT             (7U)                                                /*!< C_CAN_CANIF1_MCTRL: EOB Position        */
#define C_CAN_CANIF1_MCTRL_EOB(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_EOB_SHIFT))&C_CAN_CANIF1_MCTRL_EOB_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_TXRQST_MASK           (0x100U)                                            /*!< C_CAN_CANIF1_MCTRL: TXRQST Mask         */
#define C_CAN_CANIF1_MCTRL_TXRQST_SHIFT          (8U)                                                /*!< C_CAN_CANIF1_MCTRL: TXRQST Position     */
#define C_CAN_CANIF1_MCTRL_TXRQST(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_TXRQST_SHIFT))&C_CAN_CANIF1_MCTRL_TXRQST_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_RMTEN_MASK            (0x200U)                                            /*!< C_CAN_CANIF1_MCTRL: RMTEN Mask          */
#define C_CAN_CANIF1_MCTRL_RMTEN_SHIFT           (9U)                                                /*!< C_CAN_CANIF1_MCTRL: RMTEN Position      */
#define C_CAN_CANIF1_MCTRL_RMTEN(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_RMTEN_SHIFT))&C_CAN_CANIF1_MCTRL_RMTEN_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_RXIE_MASK             (0x400U)                                            /*!< C_CAN_CANIF1_MCTRL: RXIE Mask           */
#define C_CAN_CANIF1_MCTRL_RXIE_SHIFT            (10U)                                               /*!< C_CAN_CANIF1_MCTRL: RXIE Position       */
#define C_CAN_CANIF1_MCTRL_RXIE(x)               (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_RXIE_SHIFT))&C_CAN_CANIF1_MCTRL_RXIE_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_TXIE_MASK             (0x800U)                                            /*!< C_CAN_CANIF1_MCTRL: TXIE Mask           */
#define C_CAN_CANIF1_MCTRL_TXIE_SHIFT            (11U)                                               /*!< C_CAN_CANIF1_MCTRL: TXIE Position       */
#define C_CAN_CANIF1_MCTRL_TXIE(x)               (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_TXIE_SHIFT))&C_CAN_CANIF1_MCTRL_TXIE_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_UMASK_MASK            (0x1000U)                                           /*!< C_CAN_CANIF1_MCTRL: UMASK Mask          */
#define C_CAN_CANIF1_MCTRL_UMASK_SHIFT           (12U)                                               /*!< C_CAN_CANIF1_MCTRL: UMASK Position      */
#define C_CAN_CANIF1_MCTRL_UMASK(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_UMASK_SHIFT))&C_CAN_CANIF1_MCTRL_UMASK_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_INTPND_MASK           (0x2000U)                                           /*!< C_CAN_CANIF1_MCTRL: INTPND Mask         */
#define C_CAN_CANIF1_MCTRL_INTPND_SHIFT          (13U)                                               /*!< C_CAN_CANIF1_MCTRL: INTPND Position     */
#define C_CAN_CANIF1_MCTRL_INTPND(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_INTPND_SHIFT))&C_CAN_CANIF1_MCTRL_INTPND_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_MSGLST_MASK           (0x4000U)                                           /*!< C_CAN_CANIF1_MCTRL: MSGLST Mask         */
#define C_CAN_CANIF1_MCTRL_MSGLST_SHIFT          (14U)                                               /*!< C_CAN_CANIF1_MCTRL: MSGLST Position     */
#define C_CAN_CANIF1_MCTRL_MSGLST(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_MSGLST_SHIFT))&C_CAN_CANIF1_MCTRL_MSGLST_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
#define C_CAN_CANIF1_MCTRL_NEWDAT_MASK           (0x8000U)                                           /*!< C_CAN_CANIF1_MCTRL: NEWDAT Mask         */
#define C_CAN_CANIF1_MCTRL_NEWDAT_SHIFT          (15U)                                               /*!< C_CAN_CANIF1_MCTRL: NEWDAT Position     */
#define C_CAN_CANIF1_MCTRL_NEWDAT(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_MCTRL_NEWDAT_SHIFT))&C_CAN_CANIF1_MCTRL_NEWDAT_MASK) /*!< C_CAN_CANIF1_MCTRL                      */
/* ------- CANIF1_DA1 Bit Fields                    ------ */
#define C_CAN_CANIF1_DA1_DATA0_MASK              (0xFFU)                                             /*!< C_CAN_CANIF1_DA1: DATA0 Mask            */
#define C_CAN_CANIF1_DA1_DATA0_SHIFT             (0U)                                                /*!< C_CAN_CANIF1_DA1: DATA0 Position        */
#define C_CAN_CANIF1_DA1_DATA0(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DA1_DATA0_SHIFT))&C_CAN_CANIF1_DA1_DATA0_MASK) /*!< C_CAN_CANIF1_DA1                        */
#define C_CAN_CANIF1_DA1_DATA1_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF1_DA1: DATA1 Mask            */
#define C_CAN_CANIF1_DA1_DATA1_SHIFT             (8U)                                                /*!< C_CAN_CANIF1_DA1: DATA1 Position        */
#define C_CAN_CANIF1_DA1_DATA1(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DA1_DATA1_SHIFT))&C_CAN_CANIF1_DA1_DATA1_MASK) /*!< C_CAN_CANIF1_DA1                        */
/* ------- CANIF1_DA2 Bit Fields                    ------ */
#define C_CAN_CANIF1_DA2_DATA2_MASK              (0xFFU)                                             /*!< C_CAN_CANIF1_DA2: DATA2 Mask            */
#define C_CAN_CANIF1_DA2_DATA2_SHIFT             (0U)                                                /*!< C_CAN_CANIF1_DA2: DATA2 Position        */
#define C_CAN_CANIF1_DA2_DATA2(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DA2_DATA2_SHIFT))&C_CAN_CANIF1_DA2_DATA2_MASK) /*!< C_CAN_CANIF1_DA2                        */
#define C_CAN_CANIF1_DA2_DATA3_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF1_DA2: DATA3 Mask            */
#define C_CAN_CANIF1_DA2_DATA3_SHIFT             (8U)                                                /*!< C_CAN_CANIF1_DA2: DATA3 Position        */
#define C_CAN_CANIF1_DA2_DATA3(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DA2_DATA3_SHIFT))&C_CAN_CANIF1_DA2_DATA3_MASK) /*!< C_CAN_CANIF1_DA2                        */
/* ------- CANIF1_DB1 Bit Fields                    ------ */
#define C_CAN_CANIF1_DB1_DATA4_MASK              (0xFFU)                                             /*!< C_CAN_CANIF1_DB1: DATA4 Mask            */
#define C_CAN_CANIF1_DB1_DATA4_SHIFT             (0U)                                                /*!< C_CAN_CANIF1_DB1: DATA4 Position        */
#define C_CAN_CANIF1_DB1_DATA4(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DB1_DATA4_SHIFT))&C_CAN_CANIF1_DB1_DATA4_MASK) /*!< C_CAN_CANIF1_DB1                        */
#define C_CAN_CANIF1_DB1_DATA5_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF1_DB1: DATA5 Mask            */
#define C_CAN_CANIF1_DB1_DATA5_SHIFT             (8U)                                                /*!< C_CAN_CANIF1_DB1: DATA5 Position        */
#define C_CAN_CANIF1_DB1_DATA5(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DB1_DATA5_SHIFT))&C_CAN_CANIF1_DB1_DATA5_MASK) /*!< C_CAN_CANIF1_DB1                        */
/* ------- CANIF1_DB2 Bit Fields                    ------ */
#define C_CAN_CANIF1_DB2_DATA6_MASK              (0xFFU)                                             /*!< C_CAN_CANIF1_DB2: DATA6 Mask            */
#define C_CAN_CANIF1_DB2_DATA6_SHIFT             (0U)                                                /*!< C_CAN_CANIF1_DB2: DATA6 Position        */
#define C_CAN_CANIF1_DB2_DATA6(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DB2_DATA6_SHIFT))&C_CAN_CANIF1_DB2_DATA6_MASK) /*!< C_CAN_CANIF1_DB2                        */
#define C_CAN_CANIF1_DB2_DATA7_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF1_DB2: DATA7 Mask            */
#define C_CAN_CANIF1_DB2_DATA7_SHIFT             (8U)                                                /*!< C_CAN_CANIF1_DB2: DATA7 Position        */
#define C_CAN_CANIF1_DB2_DATA7(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF1_DB2_DATA7_SHIFT))&C_CAN_CANIF1_DB2_DATA7_MASK) /*!< C_CAN_CANIF1_DB2                        */
/* ------- CANIF2_CMDREQ Bit Fields                 ------ */
#define C_CAN_CANIF2_CMDREQ_MN_MASK              (0x3FU)                                             /*!< C_CAN_CANIF2_CMDREQ: MN Mask            */
#define C_CAN_CANIF2_CMDREQ_MN_SHIFT             (0U)                                                /*!< C_CAN_CANIF2_CMDREQ: MN Position        */
#define C_CAN_CANIF2_CMDREQ_MN(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDREQ_MN_SHIFT))&C_CAN_CANIF2_CMDREQ_MN_MASK) /*!< C_CAN_CANIF2_CMDREQ                     */
#define C_CAN_CANIF2_CMDREQ_BUSY_MASK            (0x8000U)                                           /*!< C_CAN_CANIF2_CMDREQ: BUSY Mask          */
#define C_CAN_CANIF2_CMDREQ_BUSY_SHIFT           (15U)                                               /*!< C_CAN_CANIF2_CMDREQ: BUSY Position      */
#define C_CAN_CANIF2_CMDREQ_BUSY(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDREQ_BUSY_SHIFT))&C_CAN_CANIF2_CMDREQ_BUSY_MASK) /*!< C_CAN_CANIF2_CMDREQ                     */
/* ------- CANIF2_CMDMSK_R Bit Fields               ------ */
#define C_CAN_CANIF2_CMDMSK_R_DATA_B_MASK        (0x1U)                                              /*!< C_CAN_CANIF2_CMDMSK_R: DATA_B Mask      */
#define C_CAN_CANIF2_CMDMSK_R_DATA_B_SHIFT       (0U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: DATA_B Position  */
#define C_CAN_CANIF2_CMDMSK_R_DATA_B(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_DATA_B_SHIFT))&C_CAN_CANIF2_CMDMSK_R_DATA_B_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_DATA_A_MASK        (0x2U)                                              /*!< C_CAN_CANIF2_CMDMSK_R: DATA_A Mask      */
#define C_CAN_CANIF2_CMDMSK_R_DATA_A_SHIFT       (1U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: DATA_A Position  */
#define C_CAN_CANIF2_CMDMSK_R_DATA_A(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_DATA_A_SHIFT))&C_CAN_CANIF2_CMDMSK_R_DATA_A_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_NEWDAT_MASK        (0x4U)                                              /*!< C_CAN_CANIF2_CMDMSK_R: NEWDAT Mask      */
#define C_CAN_CANIF2_CMDMSK_R_NEWDAT_SHIFT       (2U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: NEWDAT Position  */
#define C_CAN_CANIF2_CMDMSK_R_NEWDAT(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_NEWDAT_SHIFT))&C_CAN_CANIF2_CMDMSK_R_NEWDAT_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_CLRINTPND_MASK     (0x8U)                                              /*!< C_CAN_CANIF2_CMDMSK_R: CLRINTPND Mask   */
#define C_CAN_CANIF2_CMDMSK_R_CLRINTPND_SHIFT    (3U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: CLRINTPND Position*/
#define C_CAN_CANIF2_CMDMSK_R_CLRINTPND(x)       (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_CLRINTPND_SHIFT))&C_CAN_CANIF2_CMDMSK_R_CLRINTPND_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_CTRL_MASK          (0x10U)                                             /*!< C_CAN_CANIF2_CMDMSK_R: CTRL Mask        */
#define C_CAN_CANIF2_CMDMSK_R_CTRL_SHIFT         (4U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: CTRL Position    */
#define C_CAN_CANIF2_CMDMSK_R_CTRL(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_CTRL_SHIFT))&C_CAN_CANIF2_CMDMSK_R_CTRL_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_ARB_MASK           (0x20U)                                             /*!< C_CAN_CANIF2_CMDMSK_R: ARB Mask         */
#define C_CAN_CANIF2_CMDMSK_R_ARB_SHIFT          (5U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: ARB Position     */
#define C_CAN_CANIF2_CMDMSK_R_ARB(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_ARB_SHIFT))&C_CAN_CANIF2_CMDMSK_R_ARB_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_MASK_MASK          (0x40U)                                             /*!< C_CAN_CANIF2_CMDMSK_R: MASK Mask        */
#define C_CAN_CANIF2_CMDMSK_R_MASK_SHIFT         (6U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: MASK Position    */
#define C_CAN_CANIF2_CMDMSK_R_MASK(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_MASK_SHIFT))&C_CAN_CANIF2_CMDMSK_R_MASK_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
#define C_CAN_CANIF2_CMDMSK_R_WR_RD_MASK         (0x80U)                                             /*!< C_CAN_CANIF2_CMDMSK_R: WR_RD Mask       */
#define C_CAN_CANIF2_CMDMSK_R_WR_RD_SHIFT        (7U)                                                /*!< C_CAN_CANIF2_CMDMSK_R: WR_RD Position   */
#define C_CAN_CANIF2_CMDMSK_R_WR_RD(x)           (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_R_WR_RD_SHIFT))&C_CAN_CANIF2_CMDMSK_R_WR_RD_MASK) /*!< C_CAN_CANIF2_CMDMSK_R                   */
/* ------- CANIF2_CMDMSK_W Bit Fields               ------ */
#define C_CAN_CANIF2_CMDMSK_W_DATA_B_MASK        (0x1U)                                              /*!< C_CAN_CANIF2_CMDMSK_W: DATA_B Mask      */
#define C_CAN_CANIF2_CMDMSK_W_DATA_B_SHIFT       (0U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: DATA_B Position  */
#define C_CAN_CANIF2_CMDMSK_W_DATA_B(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_DATA_B_SHIFT))&C_CAN_CANIF2_CMDMSK_W_DATA_B_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_DATA_A_MASK        (0x2U)                                              /*!< C_CAN_CANIF2_CMDMSK_W: DATA_A Mask      */
#define C_CAN_CANIF2_CMDMSK_W_DATA_A_SHIFT       (1U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: DATA_A Position  */
#define C_CAN_CANIF2_CMDMSK_W_DATA_A(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_DATA_A_SHIFT))&C_CAN_CANIF2_CMDMSK_W_DATA_A_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_TXRQST_MASK        (0x4U)                                              /*!< C_CAN_CANIF2_CMDMSK_W: TXRQST Mask      */
#define C_CAN_CANIF2_CMDMSK_W_TXRQST_SHIFT       (2U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: TXRQST Position  */
#define C_CAN_CANIF2_CMDMSK_W_TXRQST(x)          (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_TXRQST_SHIFT))&C_CAN_CANIF2_CMDMSK_W_TXRQST_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_CLRINTPND_MASK     (0x8U)                                              /*!< C_CAN_CANIF2_CMDMSK_W: CLRINTPND Mask   */
#define C_CAN_CANIF2_CMDMSK_W_CLRINTPND_SHIFT    (3U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: CLRINTPND Position*/
#define C_CAN_CANIF2_CMDMSK_W_CLRINTPND(x)       (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_CLRINTPND_SHIFT))&C_CAN_CANIF2_CMDMSK_W_CLRINTPND_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_CTRL_MASK          (0x10U)                                             /*!< C_CAN_CANIF2_CMDMSK_W: CTRL Mask        */
#define C_CAN_CANIF2_CMDMSK_W_CTRL_SHIFT         (4U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: CTRL Position    */
#define C_CAN_CANIF2_CMDMSK_W_CTRL(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_CTRL_SHIFT))&C_CAN_CANIF2_CMDMSK_W_CTRL_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_ARB_MASK           (0x20U)                                             /*!< C_CAN_CANIF2_CMDMSK_W: ARB Mask         */
#define C_CAN_CANIF2_CMDMSK_W_ARB_SHIFT          (5U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: ARB Position     */
#define C_CAN_CANIF2_CMDMSK_W_ARB(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_ARB_SHIFT))&C_CAN_CANIF2_CMDMSK_W_ARB_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_MASK_MASK          (0x40U)                                             /*!< C_CAN_CANIF2_CMDMSK_W: MASK Mask        */
#define C_CAN_CANIF2_CMDMSK_W_MASK_SHIFT         (6U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: MASK Position    */
#define C_CAN_CANIF2_CMDMSK_W_MASK(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_MASK_SHIFT))&C_CAN_CANIF2_CMDMSK_W_MASK_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
#define C_CAN_CANIF2_CMDMSK_W_WR_RD_MASK         (0x80U)                                             /*!< C_CAN_CANIF2_CMDMSK_W: WR_RD Mask       */
#define C_CAN_CANIF2_CMDMSK_W_WR_RD_SHIFT        (7U)                                                /*!< C_CAN_CANIF2_CMDMSK_W: WR_RD Position   */
#define C_CAN_CANIF2_CMDMSK_W_WR_RD(x)           (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_CMDMSK_W_WR_RD_SHIFT))&C_CAN_CANIF2_CMDMSK_W_WR_RD_MASK) /*!< C_CAN_CANIF2_CMDMSK_W                   */
/* ------- CANIF2_MSK1 Bit Fields                   ------ */
#define C_CAN_CANIF2_MSK1_MSK15_0_MASK           (0xFFFFU)                                           /*!< C_CAN_CANIF2_MSK1: MSK15_0 Mask         */
#define C_CAN_CANIF2_MSK1_MSK15_0_SHIFT          (0U)                                                /*!< C_CAN_CANIF2_MSK1: MSK15_0 Position     */
#define C_CAN_CANIF2_MSK1_MSK15_0(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MSK1_MSK15_0_SHIFT))&C_CAN_CANIF2_MSK1_MSK15_0_MASK) /*!< C_CAN_CANIF2_MSK1                       */
/* ------- CANIF2_MSK2 Bit Fields                   ------ */
#define C_CAN_CANIF2_MSK2_MSK28_16_MASK          (0x1FFFU)                                           /*!< C_CAN_CANIF2_MSK2: MSK28_16 Mask        */
#define C_CAN_CANIF2_MSK2_MSK28_16_SHIFT         (0U)                                                /*!< C_CAN_CANIF2_MSK2: MSK28_16 Position    */
#define C_CAN_CANIF2_MSK2_MSK28_16(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MSK2_MSK28_16_SHIFT))&C_CAN_CANIF2_MSK2_MSK28_16_MASK) /*!< C_CAN_CANIF2_MSK2                       */
#define C_CAN_CANIF2_MSK2_MDIR_MASK              (0x4000U)                                           /*!< C_CAN_CANIF2_MSK2: MDIR Mask            */
#define C_CAN_CANIF2_MSK2_MDIR_SHIFT             (14U)                                               /*!< C_CAN_CANIF2_MSK2: MDIR Position        */
#define C_CAN_CANIF2_MSK2_MDIR(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MSK2_MDIR_SHIFT))&C_CAN_CANIF2_MSK2_MDIR_MASK) /*!< C_CAN_CANIF2_MSK2                       */
#define C_CAN_CANIF2_MSK2_MXTD_MASK              (0x8000U)                                           /*!< C_CAN_CANIF2_MSK2: MXTD Mask            */
#define C_CAN_CANIF2_MSK2_MXTD_SHIFT             (15U)                                               /*!< C_CAN_CANIF2_MSK2: MXTD Position        */
#define C_CAN_CANIF2_MSK2_MXTD(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MSK2_MXTD_SHIFT))&C_CAN_CANIF2_MSK2_MXTD_MASK) /*!< C_CAN_CANIF2_MSK2                       */
/* ------- CANIF2_ARB1 Bit Fields                   ------ */
#define C_CAN_CANIF2_ARB1_ID15_0_MASK            (0xFFFFU)                                           /*!< C_CAN_CANIF2_ARB1: ID15_0 Mask          */
#define C_CAN_CANIF2_ARB1_ID15_0_SHIFT           (0U)                                                /*!< C_CAN_CANIF2_ARB1: ID15_0 Position      */
