podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define C_CAN_CANIF2_ARB1_ID15_0(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_ARB1_ID15_0_SHIFT))&C_CAN_CANIF2_ARB1_ID15_0_MASK) /*!< C_CAN_CANIF2_ARB1                       */
/* ------- CANIF2_ARB2 Bit Fields                   ------ */
#define C_CAN_CANIF2_ARB2_ID28_16_MASK           (0x1FFFU)                                           /*!< C_CAN_CANIF2_ARB2: ID28_16 Mask         */
#define C_CAN_CANIF2_ARB2_ID28_16_SHIFT          (0U)                                                /*!< C_CAN_CANIF2_ARB2: ID28_16 Position     */
#define C_CAN_CANIF2_ARB2_ID28_16(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_ARB2_ID28_16_SHIFT))&C_CAN_CANIF2_ARB2_ID28_16_MASK) /*!< C_CAN_CANIF2_ARB2                       */
#define C_CAN_CANIF2_ARB2_DIR_MASK               (0x2000U)                                           /*!< C_CAN_CANIF2_ARB2: DIR Mask             */
#define C_CAN_CANIF2_ARB2_DIR_SHIFT              (13U)                                               /*!< C_CAN_CANIF2_ARB2: DIR Position         */
#define C_CAN_CANIF2_ARB2_DIR(x)                 (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_ARB2_DIR_SHIFT))&C_CAN_CANIF2_ARB2_DIR_MASK) /*!< C_CAN_CANIF2_ARB2                       */
#define C_CAN_CANIF2_ARB2_XTD_MASK               (0x4000U)                                           /*!< C_CAN_CANIF2_ARB2: XTD Mask             */
#define C_CAN_CANIF2_ARB2_XTD_SHIFT              (14U)                                               /*!< C_CAN_CANIF2_ARB2: XTD Position         */
#define C_CAN_CANIF2_ARB2_XTD(x)                 (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_ARB2_XTD_SHIFT))&C_CAN_CANIF2_ARB2_XTD_MASK) /*!< C_CAN_CANIF2_ARB2                       */
#define C_CAN_CANIF2_ARB2_MSGVAL_MASK            (0x8000U)                                           /*!< C_CAN_CANIF2_ARB2: MSGVAL Mask          */
#define C_CAN_CANIF2_ARB2_MSGVAL_SHIFT           (15U)                                               /*!< C_CAN_CANIF2_ARB2: MSGVAL Position      */
#define C_CAN_CANIF2_ARB2_MSGVAL(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_ARB2_MSGVAL_SHIFT))&C_CAN_CANIF2_ARB2_MSGVAL_MASK) /*!< C_CAN_CANIF2_ARB2                       */
/* ------- CANIF2_MCTRL Bit Fields                  ------ */
#define C_CAN_CANIF2_MCTRL_DLC3_0_MASK           (0xFU)                                              /*!< C_CAN_CANIF2_MCTRL: DLC3_0 Mask         */
#define C_CAN_CANIF2_MCTRL_DLC3_0_SHIFT          (0U)                                                /*!< C_CAN_CANIF2_MCTRL: DLC3_0 Position     */
#define C_CAN_CANIF2_MCTRL_DLC3_0(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_DLC3_0_SHIFT))&C_CAN_CANIF2_MCTRL_DLC3_0_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_EOB_MASK              (0x80U)                                             /*!< C_CAN_CANIF2_MCTRL: EOB Mask            */
#define C_CAN_CANIF2_MCTRL_EOB_SHIFT             (7U)                                                /*!< C_CAN_CANIF2_MCTRL: EOB Position        */
#define C_CAN_CANIF2_MCTRL_EOB(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_EOB_SHIFT))&C_CAN_CANIF2_MCTRL_EOB_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_TXRQST_MASK           (0x100U)                                            /*!< C_CAN_CANIF2_MCTRL: TXRQST Mask         */
#define C_CAN_CANIF2_MCTRL_TXRQST_SHIFT          (8U)                                                /*!< C_CAN_CANIF2_MCTRL: TXRQST Position     */
#define C_CAN_CANIF2_MCTRL_TXRQST(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_TXRQST_SHIFT))&C_CAN_CANIF2_MCTRL_TXRQST_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_RMTEN_MASK            (0x200U)                                            /*!< C_CAN_CANIF2_MCTRL: RMTEN Mask          */
#define C_CAN_CANIF2_MCTRL_RMTEN_SHIFT           (9U)                                                /*!< C_CAN_CANIF2_MCTRL: RMTEN Position      */
#define C_CAN_CANIF2_MCTRL_RMTEN(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_RMTEN_SHIFT))&C_CAN_CANIF2_MCTRL_RMTEN_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_RXIE_MASK             (0x400U)                                            /*!< C_CAN_CANIF2_MCTRL: RXIE Mask           */
#define C_CAN_CANIF2_MCTRL_RXIE_SHIFT            (10U)                                               /*!< C_CAN_CANIF2_MCTRL: RXIE Position       */
#define C_CAN_CANIF2_MCTRL_RXIE(x)               (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_RXIE_SHIFT))&C_CAN_CANIF2_MCTRL_RXIE_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_TXIE_MASK             (0x800U)                                            /*!< C_CAN_CANIF2_MCTRL: TXIE Mask           */
#define C_CAN_CANIF2_MCTRL_TXIE_SHIFT            (11U)                                               /*!< C_CAN_CANIF2_MCTRL: TXIE Position       */
#define C_CAN_CANIF2_MCTRL_TXIE(x)               (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_TXIE_SHIFT))&C_CAN_CANIF2_MCTRL_TXIE_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_UMASK_MASK            (0x1000U)                                           /*!< C_CAN_CANIF2_MCTRL: UMASK Mask          */
#define C_CAN_CANIF2_MCTRL_UMASK_SHIFT           (12U)                                               /*!< C_CAN_CANIF2_MCTRL: UMASK Position      */
#define C_CAN_CANIF2_MCTRL_UMASK(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_UMASK_SHIFT))&C_CAN_CANIF2_MCTRL_UMASK_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_INTPND_MASK           (0x2000U)                                           /*!< C_CAN_CANIF2_MCTRL: INTPND Mask         */
#define C_CAN_CANIF2_MCTRL_INTPND_SHIFT          (13U)                                               /*!< C_CAN_CANIF2_MCTRL: INTPND Position     */
#define C_CAN_CANIF2_MCTRL_INTPND(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_INTPND_SHIFT))&C_CAN_CANIF2_MCTRL_INTPND_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_MSGLST_MASK           (0x4000U)                                           /*!< C_CAN_CANIF2_MCTRL: MSGLST Mask         */
#define C_CAN_CANIF2_MCTRL_MSGLST_SHIFT          (14U)                                               /*!< C_CAN_CANIF2_MCTRL: MSGLST Position     */
#define C_CAN_CANIF2_MCTRL_MSGLST(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_MSGLST_SHIFT))&C_CAN_CANIF2_MCTRL_MSGLST_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
#define C_CAN_CANIF2_MCTRL_NEWDAT_MASK           (0x8000U)                                           /*!< C_CAN_CANIF2_MCTRL: NEWDAT Mask         */
#define C_CAN_CANIF2_MCTRL_NEWDAT_SHIFT          (15U)                                               /*!< C_CAN_CANIF2_MCTRL: NEWDAT Position     */
#define C_CAN_CANIF2_MCTRL_NEWDAT(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_MCTRL_NEWDAT_SHIFT))&C_CAN_CANIF2_MCTRL_NEWDAT_MASK) /*!< C_CAN_CANIF2_MCTRL                      */
/* ------- CANIF2_DA1 Bit Fields                    ------ */
#define C_CAN_CANIF2_DA1_DATA0_MASK              (0xFFU)                                             /*!< C_CAN_CANIF2_DA1: DATA0 Mask            */
#define C_CAN_CANIF2_DA1_DATA0_SHIFT             (0U)                                                /*!< C_CAN_CANIF2_DA1: DATA0 Position        */
#define C_CAN_CANIF2_DA1_DATA0(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DA1_DATA0_SHIFT))&C_CAN_CANIF2_DA1_DATA0_MASK) /*!< C_CAN_CANIF2_DA1                        */
#define C_CAN_CANIF2_DA1_DATA1_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF2_DA1: DATA1 Mask            */
#define C_CAN_CANIF2_DA1_DATA1_SHIFT             (8U)                                                /*!< C_CAN_CANIF2_DA1: DATA1 Position        */
#define C_CAN_CANIF2_DA1_DATA1(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DA1_DATA1_SHIFT))&C_CAN_CANIF2_DA1_DATA1_MASK) /*!< C_CAN_CANIF2_DA1                        */
/* ------- CANIF2_DA2 Bit Fields                    ------ */
#define C_CAN_CANIF2_DA2_DATA2_MASK              (0xFFU)                                             /*!< C_CAN_CANIF2_DA2: DATA2 Mask            */
#define C_CAN_CANIF2_DA2_DATA2_SHIFT             (0U)                                                /*!< C_CAN_CANIF2_DA2: DATA2 Position        */
#define C_CAN_CANIF2_DA2_DATA2(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DA2_DATA2_SHIFT))&C_CAN_CANIF2_DA2_DATA2_MASK) /*!< C_CAN_CANIF2_DA2                        */
#define C_CAN_CANIF2_DA2_DATA3_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF2_DA2: DATA3 Mask            */
#define C_CAN_CANIF2_DA2_DATA3_SHIFT             (8U)                                                /*!< C_CAN_CANIF2_DA2: DATA3 Position        */
#define C_CAN_CANIF2_DA2_DATA3(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DA2_DATA3_SHIFT))&C_CAN_CANIF2_DA2_DATA3_MASK) /*!< C_CAN_CANIF2_DA2                        */
/* ------- CANIF2_DB1 Bit Fields                    ------ */
#define C_CAN_CANIF2_DB1_DATA4_MASK              (0xFFU)                                             /*!< C_CAN_CANIF2_DB1: DATA4 Mask            */
#define C_CAN_CANIF2_DB1_DATA4_SHIFT             (0U)                                                /*!< C_CAN_CANIF2_DB1: DATA4 Position        */
#define C_CAN_CANIF2_DB1_DATA4(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DB1_DATA4_SHIFT))&C_CAN_CANIF2_DB1_DATA4_MASK) /*!< C_CAN_CANIF2_DB1                        */
#define C_CAN_CANIF2_DB1_DATA5_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF2_DB1: DATA5 Mask            */
#define C_CAN_CANIF2_DB1_DATA5_SHIFT             (8U)                                                /*!< C_CAN_CANIF2_DB1: DATA5 Position        */
#define C_CAN_CANIF2_DB1_DATA5(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DB1_DATA5_SHIFT))&C_CAN_CANIF2_DB1_DATA5_MASK) /*!< C_CAN_CANIF2_DB1                        */
/* ------- CANIF2_DB2 Bit Fields                    ------ */
#define C_CAN_CANIF2_DB2_DATA6_MASK              (0xFFU)                                             /*!< C_CAN_CANIF2_DB2: DATA6 Mask            */
#define C_CAN_CANIF2_DB2_DATA6_SHIFT             (0U)                                                /*!< C_CAN_CANIF2_DB2: DATA6 Position        */
#define C_CAN_CANIF2_DB2_DATA6(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DB2_DATA6_SHIFT))&C_CAN_CANIF2_DB2_DATA6_MASK) /*!< C_CAN_CANIF2_DB2                        */
#define C_CAN_CANIF2_DB2_DATA7_MASK              (0xFF00U)                                           /*!< C_CAN_CANIF2_DB2: DATA7 Mask            */
#define C_CAN_CANIF2_DB2_DATA7_SHIFT             (8U)                                                /*!< C_CAN_CANIF2_DB2: DATA7 Position        */
#define C_CAN_CANIF2_DB2_DATA7(x)                (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIF2_DB2_DATA7_SHIFT))&C_CAN_CANIF2_DB2_DATA7_MASK) /*!< C_CAN_CANIF2_DB2                        */
/* ------- CANTXREQ1 Bit Fields                     ------ */
#define C_CAN_CANTXREQ1_TXRQST16_1_MASK          (0xFFFFU)                                           /*!< C_CAN_CANTXREQ1: TXRQST16_1 Mask        */
#define C_CAN_CANTXREQ1_TXRQST16_1_SHIFT         (0U)                                                /*!< C_CAN_CANTXREQ1: TXRQST16_1 Position    */
#define C_CAN_CANTXREQ1_TXRQST16_1(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTXREQ1_TXRQST16_1_SHIFT))&C_CAN_CANTXREQ1_TXRQST16_1_MASK) /*!< C_CAN_CANTXREQ1                         */
/* ------- CANTXREQ2 Bit Fields                     ------ */
#define C_CAN_CANTXREQ2_TXRQST32_17_MASK         (0xFFFFU)                                           /*!< C_CAN_CANTXREQ2: TXRQST32_17 Mask       */
#define C_CAN_CANTXREQ2_TXRQST32_17_SHIFT        (0U)                                                /*!< C_CAN_CANTXREQ2: TXRQST32_17 Position   */
#define C_CAN_CANTXREQ2_TXRQST32_17(x)           (((uint32_t)(((uint32_t)(x))<<C_CAN_CANTXREQ2_TXRQST32_17_SHIFT))&C_CAN_CANTXREQ2_TXRQST32_17_MASK) /*!< C_CAN_CANTXREQ2                         */
/* ------- CANND1 Bit Fields                        ------ */
#define C_CAN_CANND1_NEWDAT16_1_MASK             (0xFFFFU)                                           /*!< C_CAN_CANND1: NEWDAT16_1 Mask           */
#define C_CAN_CANND1_NEWDAT16_1_SHIFT            (0U)                                                /*!< C_CAN_CANND1: NEWDAT16_1 Position       */
#define C_CAN_CANND1_NEWDAT16_1(x)               (((uint32_t)(((uint32_t)(x))<<C_CAN_CANND1_NEWDAT16_1_SHIFT))&C_CAN_CANND1_NEWDAT16_1_MASK) /*!< C_CAN_CANND1                            */
/* ------- CANND2 Bit Fields                        ------ */
#define C_CAN_CANND2_NEWDAT32_17_MASK            (0xFFFFU)                                           /*!< C_CAN_CANND2: NEWDAT32_17 Mask          */
#define C_CAN_CANND2_NEWDAT32_17_SHIFT           (0U)                                                /*!< C_CAN_CANND2: NEWDAT32_17 Position      */
#define C_CAN_CANND2_NEWDAT32_17(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANND2_NEWDAT32_17_SHIFT))&C_CAN_CANND2_NEWDAT32_17_MASK) /*!< C_CAN_CANND2                            */
/* ------- CANIR1 Bit Fields                        ------ */
#define C_CAN_CANIR1_INTPND16_1_MASK             (0xFFFFU)                                           /*!< C_CAN_CANIR1: INTPND16_1 Mask           */
#define C_CAN_CANIR1_INTPND16_1_SHIFT            (0U)                                                /*!< C_CAN_CANIR1: INTPND16_1 Position       */
#define C_CAN_CANIR1_INTPND16_1(x)               (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIR1_INTPND16_1_SHIFT))&C_CAN_CANIR1_INTPND16_1_MASK) /*!< C_CAN_CANIR1                            */
/* ------- CANIR2 Bit Fields                        ------ */
#define C_CAN_CANIR2_INTPND32_17_MASK            (0xFFFFU)                                           /*!< C_CAN_CANIR2: INTPND32_17 Mask          */
#define C_CAN_CANIR2_INTPND32_17_SHIFT           (0U)                                                /*!< C_CAN_CANIR2: INTPND32_17 Position      */
#define C_CAN_CANIR2_INTPND32_17(x)              (((uint32_t)(((uint32_t)(x))<<C_CAN_CANIR2_INTPND32_17_SHIFT))&C_CAN_CANIR2_INTPND32_17_MASK) /*!< C_CAN_CANIR2                            */
/* ------- CANMSGV1 Bit Fields                      ------ */
#define C_CAN_CANMSGV1_MSGVAL16_1_MASK           (0xFFFFU)                                           /*!< C_CAN_CANMSGV1: MSGVAL16_1 Mask         */
#define C_CAN_CANMSGV1_MSGVAL16_1_SHIFT          (0U)                                                /*!< C_CAN_CANMSGV1: MSGVAL16_1 Position     */
#define C_CAN_CANMSGV1_MSGVAL16_1(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANMSGV1_MSGVAL16_1_SHIFT))&C_CAN_CANMSGV1_MSGVAL16_1_MASK) /*!< C_CAN_CANMSGV1                          */
/* ------- CANMSGV2 Bit Fields                      ------ */
#define C_CAN_CANMSGV2_MSGVAL32_17_MASK          (0xFFFFU)                                           /*!< C_CAN_CANMSGV2: MSGVAL32_17 Mask        */
#define C_CAN_CANMSGV2_MSGVAL32_17_SHIFT         (0U)                                                /*!< C_CAN_CANMSGV2: MSGVAL32_17 Position    */
#define C_CAN_CANMSGV2_MSGVAL32_17(x)            (((uint32_t)(((uint32_t)(x))<<C_CAN_CANMSGV2_MSGVAL32_17_SHIFT))&C_CAN_CANMSGV2_MSGVAL32_17_MASK) /*!< C_CAN_CANMSGV2                          */
/* ------- CANCLKDIV Bit Fields                     ------ */
#define C_CAN_CANCLKDIV_CLKDIVVAL_MASK           (0xFU)                                              /*!< C_CAN_CANCLKDIV: CLKDIVVAL Mask         */
#define C_CAN_CANCLKDIV_CLKDIVVAL_SHIFT          (0U)                                                /*!< C_CAN_CANCLKDIV: CLKDIVVAL Position     */
#define C_CAN_CANCLKDIV_CLKDIVVAL(x)             (((uint32_t)(((uint32_t)(x))<<C_CAN_CANCLKDIV_CLKDIVVAL_SHIFT))&C_CAN_CANCLKDIV_CLKDIVVAL_MASK) /*!< C_CAN_CANCLKDIV                         */
/**
 * @} */ /* End group C_CAN_Register_Masks_GROUP 
 */

/* C_CAN - Peripheral instance base addresses */
#define C_CAN_BasePtr                  0x40050000UL //!< Peripheral base address
#define C_CAN                          ((C_CAN_Type *) C_CAN_BasePtr) //!< Freescale base pointer
#define C_CAN_BASE_PTR                 (C_CAN) //!< Freescale style base pointer
/**
 * @} */ /* End group C_CAN_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup FLASHCTRL_Peripheral_access_layer_GROUP FLASHCTRL Peripheral Access Layer
* @brief C Struct for FLASHCTRL
* @{
*/

/* ================================================================================ */
/* ================           FLASHCTRL (file:FLASHCTRL_LPC11Cxx)       ================ */
/* ================================================================================ */

/**
 * @brief Flash programming firmware
 */
/**
* @addtogroup FLASHCTRL_structs_GROUP FLASHCTRL struct
* @brief Struct for FLASHCTRL
* @{
*/
typedef struct {                                /*       FLASHCTRL Structure                                          */
        uint8_t   RESERVED_0[16];              
   __IO uint32_t  FLASHCFG;                     /**< 0010: Flash memory access time configuration register              */
        uint8_t   RESERVED_1[12];              
   __IO uint32_t  FMSSTART;                     /**< 0020: Signature start address register                             */
   __IO uint32_t  FMSSTOP;                      /**< 0024: Signature stop-address register                              */
        uint8_t   RESERVED_2[4];               
   __I  uint32_t  FMSW0;                        /**< 002C: Word 0 [31:0]                                                */
   __I  uint32_t  FMSW1;                        /**< 0030: Word 1 [63:32]                                               */
   __I  uint32_t  FMSW2;                        /**< 0034: Word 2 [95:64]                                               */
   __I  uint32_t  FMSW3;                        /**< 0038: Word 3 [127:96]                                              */
        uint8_t   RESERVED_3[4004];            
   __I  uint32_t  FMSTAT;                       /**< 0FE0: Signature generation status register                         */
        uint8_t   RESERVED_4[4];               
   __O  uint32_t  FMSTATCLR;                    /**< 0FE8: Signature generation status clear register                   */
} FLASHCTRL_Type;

/**
 * @} */ /* End group FLASHCTRL_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'FLASHCTRL' Position & Mask macros                   ----------- */
/* -------------------------------------------------------------------------------- */

