podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup FLASHCTRL_Register_Masks_GROUP FLASHCTRL Register Masks
* @brief Register Masks for FLASHCTRL
* @{
*/
/* ------- FLASHCFG Bit Fields                      ------ */
#define FLASHCTRL_FLASHCFG_FLASHTIM_MASK         (0x3U)                                              /*!< FLASHCTRL_FLASHCFG: FLASHTIM Mask       */
#define FLASHCTRL_FLASHCFG_FLASHTIM_SHIFT        (0U)                                                /*!< FLASHCTRL_FLASHCFG: FLASHTIM Position   */
#define FLASHCTRL_FLASHCFG_FLASHTIM(x)           (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FLASHCFG_FLASHTIM_SHIFT))&FLASHCTRL_FLASHCFG_FLASHTIM_MASK) /*!< FLASHCTRL_FLASHCFG                      */
/* ------- FMSSTART Bit Fields                      ------ */
#define FLASHCTRL_FMSSTART_START_MASK            (0x1FFFFU)                                          /*!< FLASHCTRL_FMSSTART: START Mask          */
#define FLASHCTRL_FMSSTART_START_SHIFT           (0U)                                                /*!< FLASHCTRL_FMSSTART: START Position      */
#define FLASHCTRL_FMSSTART_START(x)              (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSSTART_START_SHIFT))&FLASHCTRL_FMSSTART_START_MASK) /*!< FLASHCTRL_FMSSTART                      */
/* ------- FMSSTOP Bit Fields                       ------ */
#define FLASHCTRL_FMSSTOP_STOP_MASK              (0x1FFFFU)                                          /*!< FLASHCTRL_FMSSTOP: STOP Mask            */
#define FLASHCTRL_FMSSTOP_STOP_SHIFT             (0U)                                                /*!< FLASHCTRL_FMSSTOP: STOP Position        */
#define FLASHCTRL_FMSSTOP_STOP(x)                (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSSTOP_STOP_SHIFT))&FLASHCTRL_FMSSTOP_STOP_MASK) /*!< FLASHCTRL_FMSSTOP                       */
#define FLASHCTRL_FMSSTOP_SIG_START_MASK         (0x20000U)                                          /*!< FLASHCTRL_FMSSTOP: SIG_START Mask       */
#define FLASHCTRL_FMSSTOP_SIG_START_SHIFT        (17U)                                               /*!< FLASHCTRL_FMSSTOP: SIG_START Position   */
#define FLASHCTRL_FMSSTOP_SIG_START(x)           (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSSTOP_SIG_START_SHIFT))&FLASHCTRL_FMSSTOP_SIG_START_MASK) /*!< FLASHCTRL_FMSSTOP                       */
/* ------- FMSW0 Bit Fields                         ------ */
#define FLASHCTRL_FMSW0_SW0_31_0_MASK            (0xFFFFFFFFU)                                       /*!< FLASHCTRL_FMSW0: SW0_31_0 Mask          */
#define FLASHCTRL_FMSW0_SW0_31_0_SHIFT           (0U)                                                /*!< FLASHCTRL_FMSW0: SW0_31_0 Position      */
#define FLASHCTRL_FMSW0_SW0_31_0(x)              (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSW0_SW0_31_0_SHIFT))&FLASHCTRL_FMSW0_SW0_31_0_MASK) /*!< FLASHCTRL_FMSW0                         */
/* ------- FMSW1 Bit Fields                         ------ */
#define FLASHCTRL_FMSW1_SW1_63_32_MASK           (0xFFFFFFFFU)                                       /*!< FLASHCTRL_FMSW1: SW1_63_32 Mask         */
#define FLASHCTRL_FMSW1_SW1_63_32_SHIFT          (0U)                                                /*!< FLASHCTRL_FMSW1: SW1_63_32 Position     */
#define FLASHCTRL_FMSW1_SW1_63_32(x)             (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSW1_SW1_63_32_SHIFT))&FLASHCTRL_FMSW1_SW1_63_32_MASK) /*!< FLASHCTRL_FMSW1                         */
/* ------- FMSW2 Bit Fields                         ------ */
#define FLASHCTRL_FMSW2_SW2_95_64_MASK           (0xFFFFFFFFU)                                       /*!< FLASHCTRL_FMSW2: SW2_95_64 Mask         */
#define FLASHCTRL_FMSW2_SW2_95_64_SHIFT          (0U)                                                /*!< FLASHCTRL_FMSW2: SW2_95_64 Position     */
#define FLASHCTRL_FMSW2_SW2_95_64(x)             (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSW2_SW2_95_64_SHIFT))&FLASHCTRL_FMSW2_SW2_95_64_MASK) /*!< FLASHCTRL_FMSW2                         */
/* ------- FMSW3 Bit Fields                         ------ */
#define FLASHCTRL_FMSW3_SW3_127_96_MASK          (0xFFFFFFFFU)                                       /*!< FLASHCTRL_FMSW3: SW3_127_96 Mask        */
#define FLASHCTRL_FMSW3_SW3_127_96_SHIFT         (0U)                                                /*!< FLASHCTRL_FMSW3: SW3_127_96 Position    */
#define FLASHCTRL_FMSW3_SW3_127_96(x)            (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSW3_SW3_127_96_SHIFT))&FLASHCTRL_FMSW3_SW3_127_96_MASK) /*!< FLASHCTRL_FMSW3                         */
/* ------- FMSTAT Bit Fields                        ------ */
#define FLASHCTRL_FMSTAT_SIG_DONE_MASK           (0x4U)                                              /*!< FLASHCTRL_FMSTAT: SIG_DONE Mask         */
#define FLASHCTRL_FMSTAT_SIG_DONE_SHIFT          (2U)                                                /*!< FLASHCTRL_FMSTAT: SIG_DONE Position     */
#define FLASHCTRL_FMSTAT_SIG_DONE(x)             (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSTAT_SIG_DONE_SHIFT))&FLASHCTRL_FMSTAT_SIG_DONE_MASK) /*!< FLASHCTRL_FMSTAT                        */
/* ------- FMSTATCLR Bit Fields                     ------ */
#define FLASHCTRL_FMSTATCLR_SIG_DONE_CLR_MASK    (0x4U)                                              /*!< FLASHCTRL_FMSTATCLR: SIG_DONE_CLR Mask  */
#define FLASHCTRL_FMSTATCLR_SIG_DONE_CLR_SHIFT   (2U)                                                /*!< FLASHCTRL_FMSTATCLR: SIG_DONE_CLR Position*/
#define FLASHCTRL_FMSTATCLR_SIG_DONE_CLR(x)      (((uint32_t)(((uint32_t)(x))<<FLASHCTRL_FMSTATCLR_SIG_DONE_CLR_SHIFT))&FLASHCTRL_FMSTATCLR_SIG_DONE_CLR_MASK) /*!< FLASHCTRL_FMSTATCLR                     */
/**
 * @} */ /* End group FLASHCTRL_Register_Masks_GROUP 
 */

/* FLASHCTRL - Peripheral instance base addresses */
#define FLASHCTRL_BasePtr              0x4003C000UL //!< Peripheral base address
#define FLASHCTRL                      ((FLASHCTRL_Type *) FLASHCTRL_BasePtr) //!< Freescale base pointer
#define FLASHCTRL_BASE_PTR             (FLASHCTRL) //!< Freescale style base pointer
/**
 * @} */ /* End group FLASHCTRL_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIO_Peripheral_access_layer_GROUP GPIO Peripheral Access Layer
* @brief C Struct for GPIO
* @{
*/

/* ================================================================================ */
/* ================           GPIO0 (file:GPIO0_LPC11Cxx)          ================ */
/* ================================================================================ */

/**
 * @brief GPIO0
 */
/**
* @addtogroup GPIO_structs_GROUP GPIO struct
* @brief Struct for GPIO
* @{
*/
typedef struct {                                /*       GPIO0 Structure                                              */
        uint8_t   RESERVED_0[16380];           
   __IO uint32_t  DATA;                         /**< 3FFC: Port n data register for pins PIOn_0 to PIOn_11              */
        uint8_t   RESERVED_1[16384];           
   __IO uint32_t  DIR;                          /**< 8000: Data direction register for port n                           */
   __IO uint32_t  IS;                           /**< 8004: Interrupt sense register for port n                          */
   __IO uint32_t  IBE;                          /**< 8008: Interrupt both edges register for port n                     */
   __IO uint32_t  IEV;                          /**< 800C: Interrupt event register for port n                          */
   __IO uint32_t  IE;                           /**< 8010: Interrupt mask register for port n                           */
   __I  uint32_t  RIS;                          /**< 8014: Raw interrupt status register for port n                     */
   __I  uint32_t  MIS;                          /**< 8018: Masked interrupt status register for port n                  */
   __O  uint32_t  IC;                           /**< 801C: Interrupt clear register for port n                          */
} GPIO0_Type;

/**
 * @} */ /* End group GPIO_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'GPIO0' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

