podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup GPIO_Register_Masks_GROUP GPIO Register Masks
* @brief Register Masks for GPIO
* @{
*/
/* ------- DATA Bit Fields                          ------ */
#define GPIO0_DATA_DATA0_MASK                    (0x1U)                                              /*!< GPIO0_DATA: DATA0 Mask                  */
#define GPIO0_DATA_DATA0_SHIFT                   (0U)                                                /*!< GPIO0_DATA: DATA0 Position              */
#define GPIO0_DATA_DATA0(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA0_SHIFT))&GPIO0_DATA_DATA0_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA1_MASK                    (0x2U)                                              /*!< GPIO0_DATA: DATA1 Mask                  */
#define GPIO0_DATA_DATA1_SHIFT                   (1U)                                                /*!< GPIO0_DATA: DATA1 Position              */
#define GPIO0_DATA_DATA1(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA1_SHIFT))&GPIO0_DATA_DATA1_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA2_MASK                    (0x4U)                                              /*!< GPIO0_DATA: DATA2 Mask                  */
#define GPIO0_DATA_DATA2_SHIFT                   (2U)                                                /*!< GPIO0_DATA: DATA2 Position              */
#define GPIO0_DATA_DATA2(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA2_SHIFT))&GPIO0_DATA_DATA2_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA3_MASK                    (0x8U)                                              /*!< GPIO0_DATA: DATA3 Mask                  */
#define GPIO0_DATA_DATA3_SHIFT                   (3U)                                                /*!< GPIO0_DATA: DATA3 Position              */
#define GPIO0_DATA_DATA3(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA3_SHIFT))&GPIO0_DATA_DATA3_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA4_MASK                    (0x10U)                                             /*!< GPIO0_DATA: DATA4 Mask                  */
#define GPIO0_DATA_DATA4_SHIFT                   (4U)                                                /*!< GPIO0_DATA: DATA4 Position              */
#define GPIO0_DATA_DATA4(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA4_SHIFT))&GPIO0_DATA_DATA4_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA5_MASK                    (0x20U)                                             /*!< GPIO0_DATA: DATA5 Mask                  */
#define GPIO0_DATA_DATA5_SHIFT                   (5U)                                                /*!< GPIO0_DATA: DATA5 Position              */
#define GPIO0_DATA_DATA5(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA5_SHIFT))&GPIO0_DATA_DATA5_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA6_MASK                    (0x40U)                                             /*!< GPIO0_DATA: DATA6 Mask                  */
#define GPIO0_DATA_DATA6_SHIFT                   (6U)                                                /*!< GPIO0_DATA: DATA6 Position              */
#define GPIO0_DATA_DATA6(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA6_SHIFT))&GPIO0_DATA_DATA6_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA7_MASK                    (0x80U)                                             /*!< GPIO0_DATA: DATA7 Mask                  */
#define GPIO0_DATA_DATA7_SHIFT                   (7U)                                                /*!< GPIO0_DATA: DATA7 Position              */
#define GPIO0_DATA_DATA7(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA7_SHIFT))&GPIO0_DATA_DATA7_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA8_MASK                    (0x100U)                                            /*!< GPIO0_DATA: DATA8 Mask                  */
#define GPIO0_DATA_DATA8_SHIFT                   (8U)                                                /*!< GPIO0_DATA: DATA8 Position              */
#define GPIO0_DATA_DATA8(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA8_SHIFT))&GPIO0_DATA_DATA8_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA9_MASK                    (0x200U)                                            /*!< GPIO0_DATA: DATA9 Mask                  */
#define GPIO0_DATA_DATA9_SHIFT                   (9U)                                                /*!< GPIO0_DATA: DATA9 Position              */
#define GPIO0_DATA_DATA9(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA9_SHIFT))&GPIO0_DATA_DATA9_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA10_MASK                   (0x400U)                                            /*!< GPIO0_DATA: DATA10 Mask                 */
#define GPIO0_DATA_DATA10_SHIFT                  (10U)                                               /*!< GPIO0_DATA: DATA10 Position             */
#define GPIO0_DATA_DATA10(x)                     (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA10_SHIFT))&GPIO0_DATA_DATA10_MASK) /*!< GPIO0_DATA                              */
#define GPIO0_DATA_DATA11_MASK                   (0x800U)                                            /*!< GPIO0_DATA: DATA11 Mask                 */
#define GPIO0_DATA_DATA11_SHIFT                  (11U)                                               /*!< GPIO0_DATA: DATA11 Position             */
#define GPIO0_DATA_DATA11(x)                     (((uint32_t)(((uint32_t)(x))<<GPIO0_DATA_DATA11_SHIFT))&GPIO0_DATA_DATA11_MASK) /*!< GPIO0_DATA                              */
/* ------- DIR Bit Fields                           ------ */
#define GPIO0_DIR_IO0_MASK                       (0x1U)                                              /*!< GPIO0_DIR: IO0 Mask                     */
#define GPIO0_DIR_IO0_SHIFT                      (0U)                                                /*!< GPIO0_DIR: IO0 Position                 */
#define GPIO0_DIR_IO0(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO0_SHIFT))&GPIO0_DIR_IO0_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO1_MASK                       (0x2U)                                              /*!< GPIO0_DIR: IO1 Mask                     */
#define GPIO0_DIR_IO1_SHIFT                      (1U)                                                /*!< GPIO0_DIR: IO1 Position                 */
#define GPIO0_DIR_IO1(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO1_SHIFT))&GPIO0_DIR_IO1_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO2_MASK                       (0x4U)                                              /*!< GPIO0_DIR: IO2 Mask                     */
#define GPIO0_DIR_IO2_SHIFT                      (2U)                                                /*!< GPIO0_DIR: IO2 Position                 */
#define GPIO0_DIR_IO2(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO2_SHIFT))&GPIO0_DIR_IO2_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO3_MASK                       (0x8U)                                              /*!< GPIO0_DIR: IO3 Mask                     */
#define GPIO0_DIR_IO3_SHIFT                      (3U)                                                /*!< GPIO0_DIR: IO3 Position                 */
#define GPIO0_DIR_IO3(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO3_SHIFT))&GPIO0_DIR_IO3_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO4_MASK                       (0x10U)                                             /*!< GPIO0_DIR: IO4 Mask                     */
#define GPIO0_DIR_IO4_SHIFT                      (4U)                                                /*!< GPIO0_DIR: IO4 Position                 */
#define GPIO0_DIR_IO4(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO4_SHIFT))&GPIO0_DIR_IO4_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO5_MASK                       (0x20U)                                             /*!< GPIO0_DIR: IO5 Mask                     */
#define GPIO0_DIR_IO5_SHIFT                      (5U)                                                /*!< GPIO0_DIR: IO5 Position                 */
#define GPIO0_DIR_IO5(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO5_SHIFT))&GPIO0_DIR_IO5_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO6_MASK                       (0x40U)                                             /*!< GPIO0_DIR: IO6 Mask                     */
#define GPIO0_DIR_IO6_SHIFT                      (6U)                                                /*!< GPIO0_DIR: IO6 Position                 */
#define GPIO0_DIR_IO6(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO6_SHIFT))&GPIO0_DIR_IO6_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO7_MASK                       (0x80U)                                             /*!< GPIO0_DIR: IO7 Mask                     */
#define GPIO0_DIR_IO7_SHIFT                      (7U)                                                /*!< GPIO0_DIR: IO7 Position                 */
#define GPIO0_DIR_IO7(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO7_SHIFT))&GPIO0_DIR_IO7_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO8_MASK                       (0x100U)                                            /*!< GPIO0_DIR: IO8 Mask                     */
#define GPIO0_DIR_IO8_SHIFT                      (8U)                                                /*!< GPIO0_DIR: IO8 Position                 */
#define GPIO0_DIR_IO8(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO8_SHIFT))&GPIO0_DIR_IO8_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO9_MASK                       (0x200U)                                            /*!< GPIO0_DIR: IO9 Mask                     */
#define GPIO0_DIR_IO9_SHIFT                      (9U)                                                /*!< GPIO0_DIR: IO9 Position                 */
#define GPIO0_DIR_IO9(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO9_SHIFT))&GPIO0_DIR_IO9_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO10_MASK                      (0x400U)                                            /*!< GPIO0_DIR: IO10 Mask                    */
#define GPIO0_DIR_IO10_SHIFT                     (10U)                                               /*!< GPIO0_DIR: IO10 Position                */
#define GPIO0_DIR_IO10(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO10_SHIFT))&GPIO0_DIR_IO10_MASK) /*!< GPIO0_DIR                               */
#define GPIO0_DIR_IO11_MASK                      (0x800U)                                            /*!< GPIO0_DIR: IO11 Mask                    */
#define GPIO0_DIR_IO11_SHIFT                     (11U)                                               /*!< GPIO0_DIR: IO11 Position                */
#define GPIO0_DIR_IO11(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_DIR_IO11_SHIFT))&GPIO0_DIR_IO11_MASK) /*!< GPIO0_DIR                               */
/* ------- IS Bit Fields                            ------ */
#define GPIO0_IS_ISENSE0_MASK                    (0x1U)                                              /*!< GPIO0_IS: ISENSE0 Mask                  */
#define GPIO0_IS_ISENSE0_SHIFT                   (0U)                                                /*!< GPIO0_IS: ISENSE0 Position              */
#define GPIO0_IS_ISENSE0(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE0_SHIFT))&GPIO0_IS_ISENSE0_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE1_MASK                    (0x2U)                                              /*!< GPIO0_IS: ISENSE1 Mask                  */
#define GPIO0_IS_ISENSE1_SHIFT                   (1U)                                                /*!< GPIO0_IS: ISENSE1 Position              */
#define GPIO0_IS_ISENSE1(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE1_SHIFT))&GPIO0_IS_ISENSE1_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE2_MASK                    (0x4U)                                              /*!< GPIO0_IS: ISENSE2 Mask                  */
#define GPIO0_IS_ISENSE2_SHIFT                   (2U)                                                /*!< GPIO0_IS: ISENSE2 Position              */
#define GPIO0_IS_ISENSE2(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE2_SHIFT))&GPIO0_IS_ISENSE2_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE3_MASK                    (0x8U)                                              /*!< GPIO0_IS: ISENSE3 Mask                  */
#define GPIO0_IS_ISENSE3_SHIFT                   (3U)                                                /*!< GPIO0_IS: ISENSE3 Position              */
#define GPIO0_IS_ISENSE3(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE3_SHIFT))&GPIO0_IS_ISENSE3_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE4_MASK                    (0x10U)                                             /*!< GPIO0_IS: ISENSE4 Mask                  */
#define GPIO0_IS_ISENSE4_SHIFT                   (4U)                                                /*!< GPIO0_IS: ISENSE4 Position              */
#define GPIO0_IS_ISENSE4(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE4_SHIFT))&GPIO0_IS_ISENSE4_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE5_MASK                    (0x20U)                                             /*!< GPIO0_IS: ISENSE5 Mask                  */
#define GPIO0_IS_ISENSE5_SHIFT                   (5U)                                                /*!< GPIO0_IS: ISENSE5 Position              */
#define GPIO0_IS_ISENSE5(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE5_SHIFT))&GPIO0_IS_ISENSE5_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE6_MASK                    (0x40U)                                             /*!< GPIO0_IS: ISENSE6 Mask                  */
#define GPIO0_IS_ISENSE6_SHIFT                   (6U)                                                /*!< GPIO0_IS: ISENSE6 Position              */
#define GPIO0_IS_ISENSE6(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE6_SHIFT))&GPIO0_IS_ISENSE6_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE7_MASK                    (0x80U)                                             /*!< GPIO0_IS: ISENSE7 Mask                  */
#define GPIO0_IS_ISENSE7_SHIFT                   (7U)                                                /*!< GPIO0_IS: ISENSE7 Position              */
#define GPIO0_IS_ISENSE7(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE7_SHIFT))&GPIO0_IS_ISENSE7_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE8_MASK                    (0x100U)                                            /*!< GPIO0_IS: ISENSE8 Mask                  */
#define GPIO0_IS_ISENSE8_SHIFT                   (8U)                                                /*!< GPIO0_IS: ISENSE8 Position              */
#define GPIO0_IS_ISENSE8(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE8_SHIFT))&GPIO0_IS_ISENSE8_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE9_MASK                    (0x200U)                                            /*!< GPIO0_IS: ISENSE9 Mask                  */
#define GPIO0_IS_ISENSE9_SHIFT                   (9U)                                                /*!< GPIO0_IS: ISENSE9 Position              */
#define GPIO0_IS_ISENSE9(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE9_SHIFT))&GPIO0_IS_ISENSE9_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE10_MASK                   (0x400U)                                            /*!< GPIO0_IS: ISENSE10 Mask                 */
#define GPIO0_IS_ISENSE10_SHIFT                  (10U)                                               /*!< GPIO0_IS: ISENSE10 Position             */
#define GPIO0_IS_ISENSE10(x)                     (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE10_SHIFT))&GPIO0_IS_ISENSE10_MASK) /*!< GPIO0_IS                                */
#define GPIO0_IS_ISENSE11_MASK                   (0x800U)                                            /*!< GPIO0_IS: ISENSE11 Mask                 */
#define GPIO0_IS_ISENSE11_SHIFT                  (11U)                                               /*!< GPIO0_IS: ISENSE11 Position             */
#define GPIO0_IS_ISENSE11(x)                     (((uint32_t)(((uint32_t)(x))<<GPIO0_IS_ISENSE11_SHIFT))&GPIO0_IS_ISENSE11_MASK) /*!< GPIO0_IS                                */
/* ------- IBE Bit Fields                           ------ */
#define GPIO0_IBE_IBE0_MASK                      (0x1U)                                              /*!< GPIO0_IBE: IBE0 Mask                    */
#define GPIO0_IBE_IBE0_SHIFT                     (0U)                                                /*!< GPIO0_IBE: IBE0 Position                */
#define GPIO0_IBE_IBE0(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE0_SHIFT))&GPIO0_IBE_IBE0_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE1_MASK                      (0x2U)                                              /*!< GPIO0_IBE: IBE1 Mask                    */
#define GPIO0_IBE_IBE1_SHIFT                     (1U)                                                /*!< GPIO0_IBE: IBE1 Position                */
#define GPIO0_IBE_IBE1(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE1_SHIFT))&GPIO0_IBE_IBE1_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE2_MASK                      (0x4U)                                              /*!< GPIO0_IBE: IBE2 Mask                    */
#define GPIO0_IBE_IBE2_SHIFT                     (2U)                                                /*!< GPIO0_IBE: IBE2 Position                */
#define GPIO0_IBE_IBE2(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE2_SHIFT))&GPIO0_IBE_IBE2_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE3_MASK                      (0x8U)                                              /*!< GPIO0_IBE: IBE3 Mask                    */
#define GPIO0_IBE_IBE3_SHIFT                     (3U)                                                /*!< GPIO0_IBE: IBE3 Position                */
#define GPIO0_IBE_IBE3(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE3_SHIFT))&GPIO0_IBE_IBE3_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE4_MASK                      (0x10U)                                             /*!< GPIO0_IBE: IBE4 Mask                    */
#define GPIO0_IBE_IBE4_SHIFT                     (4U)                                                /*!< GPIO0_IBE: IBE4 Position                */
#define GPIO0_IBE_IBE4(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE4_SHIFT))&GPIO0_IBE_IBE4_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE5_MASK                      (0x20U)                                             /*!< GPIO0_IBE: IBE5 Mask                    */
#define GPIO0_IBE_IBE5_SHIFT                     (5U)                                                /*!< GPIO0_IBE: IBE5 Position                */
#define GPIO0_IBE_IBE5(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE5_SHIFT))&GPIO0_IBE_IBE5_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE6_MASK                      (0x40U)                                             /*!< GPIO0_IBE: IBE6 Mask                    */
#define GPIO0_IBE_IBE6_SHIFT                     (6U)                                                /*!< GPIO0_IBE: IBE6 Position                */
#define GPIO0_IBE_IBE6(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE6_SHIFT))&GPIO0_IBE_IBE6_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE7_MASK                      (0x80U)                                             /*!< GPIO0_IBE: IBE7 Mask                    */
#define GPIO0_IBE_IBE7_SHIFT                     (7U)                                                /*!< GPIO0_IBE: IBE7 Position                */
#define GPIO0_IBE_IBE7(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE7_SHIFT))&GPIO0_IBE_IBE7_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE8_MASK                      (0x100U)                                            /*!< GPIO0_IBE: IBE8 Mask                    */
#define GPIO0_IBE_IBE8_SHIFT                     (8U)                                                /*!< GPIO0_IBE: IBE8 Position                */
#define GPIO0_IBE_IBE8(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE8_SHIFT))&GPIO0_IBE_IBE8_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE9_MASK                      (0x200U)                                            /*!< GPIO0_IBE: IBE9 Mask                    */
#define GPIO0_IBE_IBE9_SHIFT                     (9U)                                                /*!< GPIO0_IBE: IBE9 Position                */
#define GPIO0_IBE_IBE9(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE9_SHIFT))&GPIO0_IBE_IBE9_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE10_MASK                     (0x400U)                                            /*!< GPIO0_IBE: IBE10 Mask                   */
#define GPIO0_IBE_IBE10_SHIFT                    (10U)                                               /*!< GPIO0_IBE: IBE10 Position               */
#define GPIO0_IBE_IBE10(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE10_SHIFT))&GPIO0_IBE_IBE10_MASK) /*!< GPIO0_IBE                               */
#define GPIO0_IBE_IBE11_MASK                     (0x800U)                                            /*!< GPIO0_IBE: IBE11 Mask                   */
#define GPIO0_IBE_IBE11_SHIFT                    (11U)                                               /*!< GPIO0_IBE: IBE11 Position               */
#define GPIO0_IBE_IBE11(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_IBE_IBE11_SHIFT))&GPIO0_IBE_IBE11_MASK) /*!< GPIO0_IBE                               */
/* ------- IEV Bit Fields                           ------ */
#define GPIO0_IEV_IEV0_MASK                      (0x1U)                                              /*!< GPIO0_IEV: IEV0 Mask                    */
#define GPIO0_IEV_IEV0_SHIFT                     (0U)                                                /*!< GPIO0_IEV: IEV0 Position                */
#define GPIO0_IEV_IEV0(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV0_SHIFT))&GPIO0_IEV_IEV0_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV1_MASK                      (0x2U)                                              /*!< GPIO0_IEV: IEV1 Mask                    */
#define GPIO0_IEV_IEV1_SHIFT                     (1U)                                                /*!< GPIO0_IEV: IEV1 Position                */
#define GPIO0_IEV_IEV1(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV1_SHIFT))&GPIO0_IEV_IEV1_MASK) /*!< GPIO0_IEV                               */
