podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define GPIO0_IEV_IEV2_MASK                      (0x4U)                                              /*!< GPIO0_IEV: IEV2 Mask                    */
#define GPIO0_IEV_IEV2_SHIFT                     (2U)                                                /*!< GPIO0_IEV: IEV2 Position                */
#define GPIO0_IEV_IEV2(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV2_SHIFT))&GPIO0_IEV_IEV2_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV3_MASK                      (0x8U)                                              /*!< GPIO0_IEV: IEV3 Mask                    */
#define GPIO0_IEV_IEV3_SHIFT                     (3U)                                                /*!< GPIO0_IEV: IEV3 Position                */
#define GPIO0_IEV_IEV3(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV3_SHIFT))&GPIO0_IEV_IEV3_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV4_MASK                      (0x10U)                                             /*!< GPIO0_IEV: IEV4 Mask                    */
#define GPIO0_IEV_IEV4_SHIFT                     (4U)                                                /*!< GPIO0_IEV: IEV4 Position                */
#define GPIO0_IEV_IEV4(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV4_SHIFT))&GPIO0_IEV_IEV4_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV5_MASK                      (0x20U)                                             /*!< GPIO0_IEV: IEV5 Mask                    */
#define GPIO0_IEV_IEV5_SHIFT                     (5U)                                                /*!< GPIO0_IEV: IEV5 Position                */
#define GPIO0_IEV_IEV5(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV5_SHIFT))&GPIO0_IEV_IEV5_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV6_MASK                      (0x40U)                                             /*!< GPIO0_IEV: IEV6 Mask                    */
#define GPIO0_IEV_IEV6_SHIFT                     (6U)                                                /*!< GPIO0_IEV: IEV6 Position                */
#define GPIO0_IEV_IEV6(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV6_SHIFT))&GPIO0_IEV_IEV6_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV7_MASK                      (0x80U)                                             /*!< GPIO0_IEV: IEV7 Mask                    */
#define GPIO0_IEV_IEV7_SHIFT                     (7U)                                                /*!< GPIO0_IEV: IEV7 Position                */
#define GPIO0_IEV_IEV7(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV7_SHIFT))&GPIO0_IEV_IEV7_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV8_MASK                      (0x100U)                                            /*!< GPIO0_IEV: IEV8 Mask                    */
#define GPIO0_IEV_IEV8_SHIFT                     (8U)                                                /*!< GPIO0_IEV: IEV8 Position                */
#define GPIO0_IEV_IEV8(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV8_SHIFT))&GPIO0_IEV_IEV8_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV9_MASK                      (0x200U)                                            /*!< GPIO0_IEV: IEV9 Mask                    */
#define GPIO0_IEV_IEV9_SHIFT                     (9U)                                                /*!< GPIO0_IEV: IEV9 Position                */
#define GPIO0_IEV_IEV9(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV9_SHIFT))&GPIO0_IEV_IEV9_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV10_MASK                     (0x400U)                                            /*!< GPIO0_IEV: IEV10 Mask                   */
#define GPIO0_IEV_IEV10_SHIFT                    (10U)                                               /*!< GPIO0_IEV: IEV10 Position               */
#define GPIO0_IEV_IEV10(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV10_SHIFT))&GPIO0_IEV_IEV10_MASK) /*!< GPIO0_IEV                               */
#define GPIO0_IEV_IEV11_MASK                     (0x800U)                                            /*!< GPIO0_IEV: IEV11 Mask                   */
#define GPIO0_IEV_IEV11_SHIFT                    (11U)                                               /*!< GPIO0_IEV: IEV11 Position               */
#define GPIO0_IEV_IEV11(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_IEV_IEV11_SHIFT))&GPIO0_IEV_IEV11_MASK) /*!< GPIO0_IEV                               */
/* ------- IE Bit Fields                            ------ */
#define GPIO0_IE_MASK0_MASK                      (0x1U)                                              /*!< GPIO0_IE: MASK0 Mask                    */
#define GPIO0_IE_MASK0_SHIFT                     (0U)                                                /*!< GPIO0_IE: MASK0 Position                */
#define GPIO0_IE_MASK0(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK0_SHIFT))&GPIO0_IE_MASK0_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK1_MASK                      (0x2U)                                              /*!< GPIO0_IE: MASK1 Mask                    */
#define GPIO0_IE_MASK1_SHIFT                     (1U)                                                /*!< GPIO0_IE: MASK1 Position                */
#define GPIO0_IE_MASK1(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK1_SHIFT))&GPIO0_IE_MASK1_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK2_MASK                      (0x4U)                                              /*!< GPIO0_IE: MASK2 Mask                    */
#define GPIO0_IE_MASK2_SHIFT                     (2U)                                                /*!< GPIO0_IE: MASK2 Position                */
#define GPIO0_IE_MASK2(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK2_SHIFT))&GPIO0_IE_MASK2_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK3_MASK                      (0x8U)                                              /*!< GPIO0_IE: MASK3 Mask                    */
#define GPIO0_IE_MASK3_SHIFT                     (3U)                                                /*!< GPIO0_IE: MASK3 Position                */
#define GPIO0_IE_MASK3(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK3_SHIFT))&GPIO0_IE_MASK3_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK4_MASK                      (0x10U)                                             /*!< GPIO0_IE: MASK4 Mask                    */
#define GPIO0_IE_MASK4_SHIFT                     (4U)                                                /*!< GPIO0_IE: MASK4 Position                */
#define GPIO0_IE_MASK4(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK4_SHIFT))&GPIO0_IE_MASK4_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK5_MASK                      (0x20U)                                             /*!< GPIO0_IE: MASK5 Mask                    */
#define GPIO0_IE_MASK5_SHIFT                     (5U)                                                /*!< GPIO0_IE: MASK5 Position                */
#define GPIO0_IE_MASK5(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK5_SHIFT))&GPIO0_IE_MASK5_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK6_MASK                      (0x40U)                                             /*!< GPIO0_IE: MASK6 Mask                    */
#define GPIO0_IE_MASK6_SHIFT                     (6U)                                                /*!< GPIO0_IE: MASK6 Position                */
#define GPIO0_IE_MASK6(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK6_SHIFT))&GPIO0_IE_MASK6_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK7_MASK                      (0x80U)                                             /*!< GPIO0_IE: MASK7 Mask                    */
#define GPIO0_IE_MASK7_SHIFT                     (7U)                                                /*!< GPIO0_IE: MASK7 Position                */
#define GPIO0_IE_MASK7(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK7_SHIFT))&GPIO0_IE_MASK7_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK8_MASK                      (0x100U)                                            /*!< GPIO0_IE: MASK8 Mask                    */
#define GPIO0_IE_MASK8_SHIFT                     (8U)                                                /*!< GPIO0_IE: MASK8 Position                */
#define GPIO0_IE_MASK8(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK8_SHIFT))&GPIO0_IE_MASK8_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK9_MASK                      (0x200U)                                            /*!< GPIO0_IE: MASK9 Mask                    */
#define GPIO0_IE_MASK9_SHIFT                     (9U)                                                /*!< GPIO0_IE: MASK9 Position                */
#define GPIO0_IE_MASK9(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK9_SHIFT))&GPIO0_IE_MASK9_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK10_MASK                     (0x400U)                                            /*!< GPIO0_IE: MASK10 Mask                   */
#define GPIO0_IE_MASK10_SHIFT                    (10U)                                               /*!< GPIO0_IE: MASK10 Position               */
#define GPIO0_IE_MASK10(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK10_SHIFT))&GPIO0_IE_MASK10_MASK) /*!< GPIO0_IE                                */
#define GPIO0_IE_MASK11_MASK                     (0x800U)                                            /*!< GPIO0_IE: MASK11 Mask                   */
#define GPIO0_IE_MASK11_SHIFT                    (11U)                                               /*!< GPIO0_IE: MASK11 Position               */
#define GPIO0_IE_MASK11(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_IE_MASK11_SHIFT))&GPIO0_IE_MASK11_MASK) /*!< GPIO0_IE                                */
/* ------- RIS Bit Fields                           ------ */
#define GPIO0_RIS_RAWST0_MASK                    (0x1U)                                              /*!< GPIO0_RIS: RAWST0 Mask                  */
#define GPIO0_RIS_RAWST0_SHIFT                   (0U)                                                /*!< GPIO0_RIS: RAWST0 Position              */
#define GPIO0_RIS_RAWST0(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST0_SHIFT))&GPIO0_RIS_RAWST0_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST1_MASK                    (0x2U)                                              /*!< GPIO0_RIS: RAWST1 Mask                  */
#define GPIO0_RIS_RAWST1_SHIFT                   (1U)                                                /*!< GPIO0_RIS: RAWST1 Position              */
#define GPIO0_RIS_RAWST1(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST1_SHIFT))&GPIO0_RIS_RAWST1_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST2_MASK                    (0x4U)                                              /*!< GPIO0_RIS: RAWST2 Mask                  */
#define GPIO0_RIS_RAWST2_SHIFT                   (2U)                                                /*!< GPIO0_RIS: RAWST2 Position              */
#define GPIO0_RIS_RAWST2(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST2_SHIFT))&GPIO0_RIS_RAWST2_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST3_MASK                    (0x8U)                                              /*!< GPIO0_RIS: RAWST3 Mask                  */
#define GPIO0_RIS_RAWST3_SHIFT                   (3U)                                                /*!< GPIO0_RIS: RAWST3 Position              */
#define GPIO0_RIS_RAWST3(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST3_SHIFT))&GPIO0_RIS_RAWST3_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST4_MASK                    (0x10U)                                             /*!< GPIO0_RIS: RAWST4 Mask                  */
#define GPIO0_RIS_RAWST4_SHIFT                   (4U)                                                /*!< GPIO0_RIS: RAWST4 Position              */
#define GPIO0_RIS_RAWST4(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST4_SHIFT))&GPIO0_RIS_RAWST4_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST5_MASK                    (0x20U)                                             /*!< GPIO0_RIS: RAWST5 Mask                  */
#define GPIO0_RIS_RAWST5_SHIFT                   (5U)                                                /*!< GPIO0_RIS: RAWST5 Position              */
#define GPIO0_RIS_RAWST5(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST5_SHIFT))&GPIO0_RIS_RAWST5_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST6_MASK                    (0x40U)                                             /*!< GPIO0_RIS: RAWST6 Mask                  */
#define GPIO0_RIS_RAWST6_SHIFT                   (6U)                                                /*!< GPIO0_RIS: RAWST6 Position              */
#define GPIO0_RIS_RAWST6(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST6_SHIFT))&GPIO0_RIS_RAWST6_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST7_MASK                    (0x80U)                                             /*!< GPIO0_RIS: RAWST7 Mask                  */
#define GPIO0_RIS_RAWST7_SHIFT                   (7U)                                                /*!< GPIO0_RIS: RAWST7 Position              */
#define GPIO0_RIS_RAWST7(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST7_SHIFT))&GPIO0_RIS_RAWST7_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST8_MASK                    (0x100U)                                            /*!< GPIO0_RIS: RAWST8 Mask                  */
#define GPIO0_RIS_RAWST8_SHIFT                   (8U)                                                /*!< GPIO0_RIS: RAWST8 Position              */
#define GPIO0_RIS_RAWST8(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST8_SHIFT))&GPIO0_RIS_RAWST8_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST9_MASK                    (0x200U)                                            /*!< GPIO0_RIS: RAWST9 Mask                  */
#define GPIO0_RIS_RAWST9_SHIFT                   (9U)                                                /*!< GPIO0_RIS: RAWST9 Position              */
#define GPIO0_RIS_RAWST9(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST9_SHIFT))&GPIO0_RIS_RAWST9_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST10_MASK                   (0x400U)                                            /*!< GPIO0_RIS: RAWST10 Mask                 */
#define GPIO0_RIS_RAWST10_SHIFT                  (10U)                                               /*!< GPIO0_RIS: RAWST10 Position             */
#define GPIO0_RIS_RAWST10(x)                     (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST10_SHIFT))&GPIO0_RIS_RAWST10_MASK) /*!< GPIO0_RIS                               */
#define GPIO0_RIS_RAWST11_MASK                   (0x800U)                                            /*!< GPIO0_RIS: RAWST11 Mask                 */
#define GPIO0_RIS_RAWST11_SHIFT                  (11U)                                               /*!< GPIO0_RIS: RAWST11 Position             */
#define GPIO0_RIS_RAWST11(x)                     (((uint32_t)(((uint32_t)(x))<<GPIO0_RIS_RAWST11_SHIFT))&GPIO0_RIS_RAWST11_MASK) /*!< GPIO0_RIS                               */
/* ------- MIS Bit Fields                           ------ */
#define GPIO0_MIS_MASK0_MASK                     (0x1U)                                              /*!< GPIO0_MIS: MASK0 Mask                   */
#define GPIO0_MIS_MASK0_SHIFT                    (0U)                                                /*!< GPIO0_MIS: MASK0 Position               */
#define GPIO0_MIS_MASK0(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK0_SHIFT))&GPIO0_MIS_MASK0_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK1_MASK                     (0x2U)                                              /*!< GPIO0_MIS: MASK1 Mask                   */
#define GPIO0_MIS_MASK1_SHIFT                    (1U)                                                /*!< GPIO0_MIS: MASK1 Position               */
#define GPIO0_MIS_MASK1(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK1_SHIFT))&GPIO0_MIS_MASK1_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK2_MASK                     (0x4U)                                              /*!< GPIO0_MIS: MASK2 Mask                   */
#define GPIO0_MIS_MASK2_SHIFT                    (2U)                                                /*!< GPIO0_MIS: MASK2 Position               */
#define GPIO0_MIS_MASK2(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK2_SHIFT))&GPIO0_MIS_MASK2_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK3_MASK                     (0x8U)                                              /*!< GPIO0_MIS: MASK3 Mask                   */
#define GPIO0_MIS_MASK3_SHIFT                    (3U)                                                /*!< GPIO0_MIS: MASK3 Position               */
#define GPIO0_MIS_MASK3(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK3_SHIFT))&GPIO0_MIS_MASK3_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK4_MASK                     (0x10U)                                             /*!< GPIO0_MIS: MASK4 Mask                   */
#define GPIO0_MIS_MASK4_SHIFT                    (4U)                                                /*!< GPIO0_MIS: MASK4 Position               */
#define GPIO0_MIS_MASK4(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK4_SHIFT))&GPIO0_MIS_MASK4_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK5_MASK                     (0x20U)                                             /*!< GPIO0_MIS: MASK5 Mask                   */
#define GPIO0_MIS_MASK5_SHIFT                    (5U)                                                /*!< GPIO0_MIS: MASK5 Position               */
#define GPIO0_MIS_MASK5(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK5_SHIFT))&GPIO0_MIS_MASK5_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK6_MASK                     (0x40U)                                             /*!< GPIO0_MIS: MASK6 Mask                   */
#define GPIO0_MIS_MASK6_SHIFT                    (6U)                                                /*!< GPIO0_MIS: MASK6 Position               */
#define GPIO0_MIS_MASK6(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK6_SHIFT))&GPIO0_MIS_MASK6_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK7_MASK                     (0x80U)                                             /*!< GPIO0_MIS: MASK7 Mask                   */
#define GPIO0_MIS_MASK7_SHIFT                    (7U)                                                /*!< GPIO0_MIS: MASK7 Position               */
#define GPIO0_MIS_MASK7(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK7_SHIFT))&GPIO0_MIS_MASK7_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK8_MASK                     (0x100U)                                            /*!< GPIO0_MIS: MASK8 Mask                   */
#define GPIO0_MIS_MASK8_SHIFT                    (8U)                                                /*!< GPIO0_MIS: MASK8 Position               */
#define GPIO0_MIS_MASK8(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK8_SHIFT))&GPIO0_MIS_MASK8_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK9_MASK                     (0x200U)                                            /*!< GPIO0_MIS: MASK9 Mask                   */
#define GPIO0_MIS_MASK9_SHIFT                    (9U)                                                /*!< GPIO0_MIS: MASK9 Position               */
#define GPIO0_MIS_MASK9(x)                       (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK9_SHIFT))&GPIO0_MIS_MASK9_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK10_MASK                    (0x400U)                                            /*!< GPIO0_MIS: MASK10 Mask                  */
#define GPIO0_MIS_MASK10_SHIFT                   (10U)                                               /*!< GPIO0_MIS: MASK10 Position              */
#define GPIO0_MIS_MASK10(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK10_SHIFT))&GPIO0_MIS_MASK10_MASK) /*!< GPIO0_MIS                               */
#define GPIO0_MIS_MASK11_MASK                    (0x800U)                                            /*!< GPIO0_MIS: MASK11 Mask                  */
#define GPIO0_MIS_MASK11_SHIFT                   (11U)                                               /*!< GPIO0_MIS: MASK11 Position              */
#define GPIO0_MIS_MASK11(x)                      (((uint32_t)(((uint32_t)(x))<<GPIO0_MIS_MASK11_SHIFT))&GPIO0_MIS_MASK11_MASK) /*!< GPIO0_MIS                               */
/* ------- IC Bit Fields                            ------ */
#define GPIO0_IC_CLR0_MASK                       (0x1U)                                              /*!< GPIO0_IC: CLR0 Mask                     */
#define GPIO0_IC_CLR0_SHIFT                      (0U)                                                /*!< GPIO0_IC: CLR0 Position                 */
#define GPIO0_IC_CLR0(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR0_SHIFT))&GPIO0_IC_CLR0_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR1_MASK                       (0x2U)                                              /*!< GPIO0_IC: CLR1 Mask                     */
#define GPIO0_IC_CLR1_SHIFT                      (1U)                                                /*!< GPIO0_IC: CLR1 Position                 */
#define GPIO0_IC_CLR1(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR1_SHIFT))&GPIO0_IC_CLR1_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR2_MASK                       (0x4U)                                              /*!< GPIO0_IC: CLR2 Mask                     */
#define GPIO0_IC_CLR2_SHIFT                      (2U)                                                /*!< GPIO0_IC: CLR2 Position                 */
#define GPIO0_IC_CLR2(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR2_SHIFT))&GPIO0_IC_CLR2_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR3_MASK                       (0x8U)                                              /*!< GPIO0_IC: CLR3 Mask                     */
#define GPIO0_IC_CLR3_SHIFT                      (3U)                                                /*!< GPIO0_IC: CLR3 Position                 */
#define GPIO0_IC_CLR3(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR3_SHIFT))&GPIO0_IC_CLR3_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR4_MASK                       (0x10U)                                             /*!< GPIO0_IC: CLR4 Mask                     */
