podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define GPIO0_IC_CLR4_SHIFT                      (4U)                                                /*!< GPIO0_IC: CLR4 Position                 */
#define GPIO0_IC_CLR4(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR4_SHIFT))&GPIO0_IC_CLR4_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR5_MASK                       (0x20U)                                             /*!< GPIO0_IC: CLR5 Mask                     */
#define GPIO0_IC_CLR5_SHIFT                      (5U)                                                /*!< GPIO0_IC: CLR5 Position                 */
#define GPIO0_IC_CLR5(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR5_SHIFT))&GPIO0_IC_CLR5_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR6_MASK                       (0x40U)                                             /*!< GPIO0_IC: CLR6 Mask                     */
#define GPIO0_IC_CLR6_SHIFT                      (6U)                                                /*!< GPIO0_IC: CLR6 Position                 */
#define GPIO0_IC_CLR6(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR6_SHIFT))&GPIO0_IC_CLR6_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR7_MASK                       (0x80U)                                             /*!< GPIO0_IC: CLR7 Mask                     */
#define GPIO0_IC_CLR7_SHIFT                      (7U)                                                /*!< GPIO0_IC: CLR7 Position                 */
#define GPIO0_IC_CLR7(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR7_SHIFT))&GPIO0_IC_CLR7_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR8_MASK                       (0x100U)                                            /*!< GPIO0_IC: CLR8 Mask                     */
#define GPIO0_IC_CLR8_SHIFT                      (8U)                                                /*!< GPIO0_IC: CLR8 Position                 */
#define GPIO0_IC_CLR8(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR8_SHIFT))&GPIO0_IC_CLR8_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR9_MASK                       (0x200U)                                            /*!< GPIO0_IC: CLR9 Mask                     */
#define GPIO0_IC_CLR9_SHIFT                      (9U)                                                /*!< GPIO0_IC: CLR9 Position                 */
#define GPIO0_IC_CLR9(x)                         (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR9_SHIFT))&GPIO0_IC_CLR9_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR10_MASK                      (0x400U)                                            /*!< GPIO0_IC: CLR10 Mask                    */
#define GPIO0_IC_CLR10_SHIFT                     (10U)                                               /*!< GPIO0_IC: CLR10 Position                */
#define GPIO0_IC_CLR10(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR10_SHIFT))&GPIO0_IC_CLR10_MASK) /*!< GPIO0_IC                                */
#define GPIO0_IC_CLR11_MASK                      (0x800U)                                            /*!< GPIO0_IC: CLR11 Mask                    */
#define GPIO0_IC_CLR11_SHIFT                     (11U)                                               /*!< GPIO0_IC: CLR11 Position                */
#define GPIO0_IC_CLR11(x)                        (((uint32_t)(((uint32_t)(x))<<GPIO0_IC_CLR11_SHIFT))&GPIO0_IC_CLR11_MASK) /*!< GPIO0_IC                                */
/**
 * @} */ /* End group GPIO_Register_Masks_GROUP 
 */

/* GPIO0 - Peripheral instance base addresses */
#define GPIO0_BasePtr                  0x50000000UL //!< Peripheral base address
#define GPIO0                          ((GPIO0_Type *) GPIO0_BasePtr) //!< Freescale base pointer
#define GPIO0_BASE_PTR                 (GPIO0) //!< Freescale style base pointer
/**
 * @} */ /* End group GPIO_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIO_Peripheral_access_layer_GROUP GPIO Peripheral Access Layer
* @brief C Struct for GPIO
* @{
*/

/* ================================================================================ */
/* ================           GPIO1 (derived from GPIO0)           ================ */
/* ================================================================================ */

/**
 * @brief GPIO0
 */

/* GPIO1 - Peripheral instance base addresses */
#define GPIO1_BasePtr                  0x50010000UL //!< Peripheral base address
#define GPIO1                          ((GPIO0_Type *) GPIO1_BasePtr) //!< Freescale base pointer
#define GPIO1_BASE_PTR                 (GPIO1) //!< Freescale style base pointer
/**
 * @} */ /* End group GPIO_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIO_Peripheral_access_layer_GROUP GPIO Peripheral Access Layer
* @brief C Struct for GPIO
* @{
*/

/* ================================================================================ */
/* ================           GPIO2 (derived from GPIO0)           ================ */
/* ================================================================================ */

/**
 * @brief GPIO0
 */

/* GPIO2 - Peripheral instance base addresses */
#define GPIO2_BasePtr                  0x50020000UL //!< Peripheral base address
#define GPIO2                          ((GPIO0_Type *) GPIO2_BasePtr) //!< Freescale base pointer
#define GPIO2_BASE_PTR                 (GPIO2) //!< Freescale style base pointer
/**
 * @} */ /* End group GPIO_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup GPIO_Peripheral_access_layer_GROUP GPIO Peripheral Access Layer
* @brief C Struct for GPIO
* @{
*/

/* ================================================================================ */
/* ================           GPIO3 (derived from GPIO0)           ================ */
/* ================================================================================ */

/**
 * @brief GPIO0
 */

/* GPIO3 - Peripheral instance base addresses */
#define GPIO3_BasePtr                  0x50030000UL //!< Peripheral base address
#define GPIO3                          ((GPIO0_Type *) GPIO3_BasePtr) //!< Freescale base pointer
#define GPIO3_BASE_PTR                 (GPIO3) //!< Freescale style base pointer
/**
 * @} */ /* End group GPIO_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup I2C_Peripheral_access_layer_GROUP I2C Peripheral Access Layer
* @brief C Struct for I2C
* @{
*/

/* ================================================================================ */
/* ================           I2C (file:I2C_LPC11Cxx)              ================ */
/* ================================================================================ */

/**
 * @brief I2C-bus interface
 */
/**
* @addtogroup I2C_structs_GROUP I2C struct
* @brief Struct for I2C
* @{
*/
typedef struct {                                /*       I2C Structure                                                */
   __IO uint32_t  CONSET;                       /**< 0000: I2C Control Set Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is set. Writing a zero has no effect on the corresponding bit in the I2C control register */
   __I  uint32_t  STAT;                         /**< 0004: I2C Status Register. During I2C operation, this register provides detailed status codes that allow software to determine the next action needed */
   __IO uint32_t  DAT;                          /**< 0008: I2C Data Register. During master or slave transmit mode, data to be transmitted is written to this register. During master or slave receive mode, data that has been received may be read from this register */
   __IO uint32_t  ADR0;                         /**< 000C: I2C Slave Address Register 0. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address */
   __IO uint32_t  SCLH;                         /**< 0010: SCH Duty Cycle Register High Half Word. Determines the high time of the I2C clock */
   __IO uint32_t  SCLL;                         /**< 0014: SCL Duty Cycle Register Low Half Word. Determines the low time of the I2C clock. I2nSCLL and I2nSCLH together determine the clock frequency generated by an I2C master and certain times used in slave mode */
   __O  uint32_t  CONCLR;                       /**< 0018: I2C Control Clear Register. When a one is written to a bit of this register, the corresponding bit in the I2C control register is cleared. Writing a zero has no effect on the corresponding bit in the I2C control register */
   __IO uint32_t  MMCTRL;                       /**< 001C: Monitor mode control register                                */
   __IO uint32_t  ADR1;                         /**< 0020: I2C Slave Address Register 1. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address */
   __IO uint32_t  ADR2;                         /**< 0024: I2C Slave Address Register 1. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address */
   __IO uint32_t  ADR3;                         /**< 0028: I2C Slave Address Register 1. Contains the 7-bit slave address for operation of the I2C interface in slave mode, and is not used in master mode. The least significant bit determines whether a slave responds to the General Call address */
   __I  uint32_t  DATA_BUFFER;                  /**< 002C: Data buffer register. The contents of the 8 MSBs of the I2DAT shift register will be transferred to the DATA_BUFFER automatically after every nine bits (8 bits of data plus ACK or NACK) has been received on the bus */
   __IO uint32_t  MASK0;                        /**< 0030: I2C Slave address mask register 0. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000) */
   __IO uint32_t  MASK1;                        /**< 0034: I2C Slave address mask register 0. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000) */
   __IO uint32_t  MASK2;                        /**< 0038: I2C Slave address mask register 0. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000) */
   __IO uint32_t  MASK3;                        /**< 003C: I2C Slave address mask register 0. This mask register is associated with I2ADR0 to determine an address match. The mask register has no effect when comparing to the General Call address (0000000) */
} I2C_Type;

/**
 * @} */ /* End group I2C_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'I2C' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

