podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup I2C_Register_Masks_GROUP I2C Register Masks
* @brief Register Masks for I2C
* @{
*/
/* ------- CONSET Bit Fields                        ------ */
#define I2C_CONSET_AA_MASK                       (0x4U)                                              /*!< I2C_CONSET: AA Mask                     */
#define I2C_CONSET_AA_SHIFT                      (2U)                                                /*!< I2C_CONSET: AA Position                 */
#define I2C_CONSET_AA(x)                         (((uint32_t)(((uint32_t)(x))<<I2C_CONSET_AA_SHIFT))&I2C_CONSET_AA_MASK) /*!< I2C_CONSET                              */
#define I2C_CONSET_SI_MASK                       (0x8U)                                              /*!< I2C_CONSET: SI Mask                     */
#define I2C_CONSET_SI_SHIFT                      (3U)                                                /*!< I2C_CONSET: SI Position                 */
#define I2C_CONSET_SI(x)                         (((uint32_t)(((uint32_t)(x))<<I2C_CONSET_SI_SHIFT))&I2C_CONSET_SI_MASK) /*!< I2C_CONSET                              */
#define I2C_CONSET_STO_MASK                      (0x10U)                                             /*!< I2C_CONSET: STO Mask                    */
#define I2C_CONSET_STO_SHIFT                     (4U)                                                /*!< I2C_CONSET: STO Position                */
#define I2C_CONSET_STO(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_CONSET_STO_SHIFT))&I2C_CONSET_STO_MASK) /*!< I2C_CONSET                              */
#define I2C_CONSET_STA_MASK                      (0x20U)                                             /*!< I2C_CONSET: STA Mask                    */
#define I2C_CONSET_STA_SHIFT                     (5U)                                                /*!< I2C_CONSET: STA Position                */
#define I2C_CONSET_STA(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_CONSET_STA_SHIFT))&I2C_CONSET_STA_MASK) /*!< I2C_CONSET                              */
#define I2C_CONSET_I2EN_MASK                     (0x40U)                                             /*!< I2C_CONSET: I2EN Mask                   */
#define I2C_CONSET_I2EN_SHIFT                    (6U)                                                /*!< I2C_CONSET: I2EN Position               */
#define I2C_CONSET_I2EN(x)                       (((uint32_t)(((uint32_t)(x))<<I2C_CONSET_I2EN_SHIFT))&I2C_CONSET_I2EN_MASK) /*!< I2C_CONSET                              */
/* ------- STAT Bit Fields                          ------ */
#define I2C_STAT_Status_MASK                     (0xF8U)                                             /*!< I2C_STAT: Status Mask                   */
#define I2C_STAT_Status_SHIFT                    (3U)                                                /*!< I2C_STAT: Status Position               */
#define I2C_STAT_Status(x)                       (((uint32_t)(((uint32_t)(x))<<I2C_STAT_Status_SHIFT))&I2C_STAT_Status_MASK) /*!< I2C_STAT                                */
/* ------- DAT Bit Fields                           ------ */
#define I2C_DAT_Data_MASK                        (0xFFU)                                             /*!< I2C_DAT: Data Mask                      */
#define I2C_DAT_Data_SHIFT                       (0U)                                                /*!< I2C_DAT: Data Position                  */
#define I2C_DAT_Data(x)                          (((uint32_t)(((uint32_t)(x))<<I2C_DAT_Data_SHIFT))&I2C_DAT_Data_MASK) /*!< I2C_DAT                                 */
/* ------- ADR0 Bit Fields                          ------ */
#define I2C_ADR0_GC_MASK                         (0x1U)                                              /*!< I2C_ADR0: GC Mask                       */
#define I2C_ADR0_GC_SHIFT                        (0U)                                                /*!< I2C_ADR0: GC Position                   */
#define I2C_ADR0_GC(x)                           (((uint32_t)(((uint32_t)(x))<<I2C_ADR0_GC_SHIFT))&I2C_ADR0_GC_MASK) /*!< I2C_ADR0                                */
#define I2C_ADR0_Address_MASK                    (0xFEU)                                             /*!< I2C_ADR0: Address Mask                  */
#define I2C_ADR0_Address_SHIFT                   (1U)                                                /*!< I2C_ADR0: Address Position              */
#define I2C_ADR0_Address(x)                      (((uint32_t)(((uint32_t)(x))<<I2C_ADR0_Address_SHIFT))&I2C_ADR0_Address_MASK) /*!< I2C_ADR0                                */
/* ------- SCLH Bit Fields                          ------ */
#define I2C_SCLH_SCLH_MASK                       (0xFFFFU)                                           /*!< I2C_SCLH: SCLH Mask                     */
#define I2C_SCLH_SCLH_SHIFT                      (0U)                                                /*!< I2C_SCLH: SCLH Position                 */
#define I2C_SCLH_SCLH(x)                         (((uint32_t)(((uint32_t)(x))<<I2C_SCLH_SCLH_SHIFT))&I2C_SCLH_SCLH_MASK) /*!< I2C_SCLH                                */
/* ------- SCLL Bit Fields                          ------ */
#define I2C_SCLL_SCLL_MASK                       (0xFFFFU)                                           /*!< I2C_SCLL: SCLL Mask                     */
#define I2C_SCLL_SCLL_SHIFT                      (0U)                                                /*!< I2C_SCLL: SCLL Position                 */
#define I2C_SCLL_SCLL(x)                         (((uint32_t)(((uint32_t)(x))<<I2C_SCLL_SCLL_SHIFT))&I2C_SCLL_SCLL_MASK) /*!< I2C_SCLL                                */
/* ------- CONCLR Bit Fields                        ------ */
#define I2C_CONCLR_AAC_MASK                      (0x4U)                                              /*!< I2C_CONCLR: AAC Mask                    */
#define I2C_CONCLR_AAC_SHIFT                     (2U)                                                /*!< I2C_CONCLR: AAC Position                */
#define I2C_CONCLR_AAC(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_CONCLR_AAC_SHIFT))&I2C_CONCLR_AAC_MASK) /*!< I2C_CONCLR                              */
#define I2C_CONCLR_SIC_MASK                      (0x8U)                                              /*!< I2C_CONCLR: SIC Mask                    */
#define I2C_CONCLR_SIC_SHIFT                     (3U)                                                /*!< I2C_CONCLR: SIC Position                */
#define I2C_CONCLR_SIC(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_CONCLR_SIC_SHIFT))&I2C_CONCLR_SIC_MASK) /*!< I2C_CONCLR                              */
#define I2C_CONCLR_STAC_MASK                     (0x20U)                                             /*!< I2C_CONCLR: STAC Mask                   */
#define I2C_CONCLR_STAC_SHIFT                    (5U)                                                /*!< I2C_CONCLR: STAC Position               */
#define I2C_CONCLR_STAC(x)                       (((uint32_t)(((uint32_t)(x))<<I2C_CONCLR_STAC_SHIFT))&I2C_CONCLR_STAC_MASK) /*!< I2C_CONCLR                              */
#define I2C_CONCLR_I2ENC_MASK                    (0x40U)                                             /*!< I2C_CONCLR: I2ENC Mask                  */
#define I2C_CONCLR_I2ENC_SHIFT                   (6U)                                                /*!< I2C_CONCLR: I2ENC Position              */
#define I2C_CONCLR_I2ENC(x)                      (((uint32_t)(((uint32_t)(x))<<I2C_CONCLR_I2ENC_SHIFT))&I2C_CONCLR_I2ENC_MASK) /*!< I2C_CONCLR                              */
/* ------- MMCTRL Bit Fields                        ------ */
#define I2C_MMCTRL_MM_ENA_MASK                   (0x1U)                                              /*!< I2C_MMCTRL: MM_ENA Mask                 */
#define I2C_MMCTRL_MM_ENA_SHIFT                  (0U)                                                /*!< I2C_MMCTRL: MM_ENA Position             */
#define I2C_MMCTRL_MM_ENA(x)                     (((uint32_t)(((uint32_t)(x))<<I2C_MMCTRL_MM_ENA_SHIFT))&I2C_MMCTRL_MM_ENA_MASK) /*!< I2C_MMCTRL                              */
#define I2C_MMCTRL_ENA_SCL_MASK                  (0x2U)                                              /*!< I2C_MMCTRL: ENA_SCL Mask                */
#define I2C_MMCTRL_ENA_SCL_SHIFT                 (1U)                                                /*!< I2C_MMCTRL: ENA_SCL Position            */
#define I2C_MMCTRL_ENA_SCL(x)                    (((uint32_t)(((uint32_t)(x))<<I2C_MMCTRL_ENA_SCL_SHIFT))&I2C_MMCTRL_ENA_SCL_MASK) /*!< I2C_MMCTRL                              */
#define I2C_MMCTRL_MATCH_ALL_MASK                (0x4U)                                              /*!< I2C_MMCTRL: MATCH_ALL Mask              */
#define I2C_MMCTRL_MATCH_ALL_SHIFT               (2U)                                                /*!< I2C_MMCTRL: MATCH_ALL Position          */
#define I2C_MMCTRL_MATCH_ALL(x)                  (((uint32_t)(((uint32_t)(x))<<I2C_MMCTRL_MATCH_ALL_SHIFT))&I2C_MMCTRL_MATCH_ALL_MASK) /*!< I2C_MMCTRL                              */
/* ------- ADR1 Bit Fields                          ------ */
#define I2C_ADR1_GC_MASK                         (0x1U)                                              /*!< I2C_ADR1: GC Mask                       */
#define I2C_ADR1_GC_SHIFT                        (0U)                                                /*!< I2C_ADR1: GC Position                   */
#define I2C_ADR1_GC(x)                           (((uint32_t)(((uint32_t)(x))<<I2C_ADR1_GC_SHIFT))&I2C_ADR1_GC_MASK) /*!< I2C_ADR1                                */
#define I2C_ADR1_Address_MASK                    (0xFEU)                                             /*!< I2C_ADR1: Address Mask                  */
#define I2C_ADR1_Address_SHIFT                   (1U)                                                /*!< I2C_ADR1: Address Position              */
#define I2C_ADR1_Address(x)                      (((uint32_t)(((uint32_t)(x))<<I2C_ADR1_Address_SHIFT))&I2C_ADR1_Address_MASK) /*!< I2C_ADR1                                */
/* ------- ADR2 Bit Fields                          ------ */
#define I2C_ADR2_GC_MASK                         (0x1U)                                              /*!< I2C_ADR2: GC Mask                       */
#define I2C_ADR2_GC_SHIFT                        (0U)                                                /*!< I2C_ADR2: GC Position                   */
#define I2C_ADR2_GC(x)                           (((uint32_t)(((uint32_t)(x))<<I2C_ADR2_GC_SHIFT))&I2C_ADR2_GC_MASK) /*!< I2C_ADR2                                */
#define I2C_ADR2_Address_MASK                    (0xFEU)                                             /*!< I2C_ADR2: Address Mask                  */
#define I2C_ADR2_Address_SHIFT                   (1U)                                                /*!< I2C_ADR2: Address Position              */
#define I2C_ADR2_Address(x)                      (((uint32_t)(((uint32_t)(x))<<I2C_ADR2_Address_SHIFT))&I2C_ADR2_Address_MASK) /*!< I2C_ADR2                                */
/* ------- ADR3 Bit Fields                          ------ */
#define I2C_ADR3_GC_MASK                         (0x1U)                                              /*!< I2C_ADR3: GC Mask                       */
#define I2C_ADR3_GC_SHIFT                        (0U)                                                /*!< I2C_ADR3: GC Position                   */
#define I2C_ADR3_GC(x)                           (((uint32_t)(((uint32_t)(x))<<I2C_ADR3_GC_SHIFT))&I2C_ADR3_GC_MASK) /*!< I2C_ADR3                                */
#define I2C_ADR3_Address_MASK                    (0xFEU)                                             /*!< I2C_ADR3: Address Mask                  */
#define I2C_ADR3_Address_SHIFT                   (1U)                                                /*!< I2C_ADR3: Address Position              */
#define I2C_ADR3_Address(x)                      (((uint32_t)(((uint32_t)(x))<<I2C_ADR3_Address_SHIFT))&I2C_ADR3_Address_MASK) /*!< I2C_ADR3                                */
/* ------- DATA_BUFFER Bit Fields                   ------ */
#define I2C_DATA_BUFFER_Data_MASK                (0xFFU)                                             /*!< I2C_DATA_BUFFER: Data Mask              */
#define I2C_DATA_BUFFER_Data_SHIFT               (0U)                                                /*!< I2C_DATA_BUFFER: Data Position          */
#define I2C_DATA_BUFFER_Data(x)                  (((uint32_t)(((uint32_t)(x))<<I2C_DATA_BUFFER_Data_SHIFT))&I2C_DATA_BUFFER_Data_MASK) /*!< I2C_DATA_BUFFER                         */
/* ------- MASK0 Bit Fields                         ------ */
#define I2C_MASK0_MASK_MASK                      (0xFEU)                                             /*!< I2C_MASK0: MASK Mask                    */
#define I2C_MASK0_MASK_SHIFT                     (1U)                                                /*!< I2C_MASK0: MASK Position                */
#define I2C_MASK0_MASK(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_MASK0_MASK_SHIFT))&I2C_MASK0_MASK_MASK) /*!< I2C_MASK0                               */
/* ------- MASK1 Bit Fields                         ------ */
#define I2C_MASK1_MASK_MASK                      (0xFEU)                                             /*!< I2C_MASK1: MASK Mask                    */
#define I2C_MASK1_MASK_SHIFT                     (1U)                                                /*!< I2C_MASK1: MASK Position                */
#define I2C_MASK1_MASK(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_MASK1_MASK_SHIFT))&I2C_MASK1_MASK_MASK) /*!< I2C_MASK1                               */
/* ------- MASK2 Bit Fields                         ------ */
#define I2C_MASK2_MASK_MASK                      (0xFEU)                                             /*!< I2C_MASK2: MASK Mask                    */
#define I2C_MASK2_MASK_SHIFT                     (1U)                                                /*!< I2C_MASK2: MASK Position                */
#define I2C_MASK2_MASK(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_MASK2_MASK_SHIFT))&I2C_MASK2_MASK_MASK) /*!< I2C_MASK2                               */
/* ------- MASK3 Bit Fields                         ------ */
#define I2C_MASK3_MASK_MASK                      (0xFEU)                                             /*!< I2C_MASK3: MASK Mask                    */
#define I2C_MASK3_MASK_SHIFT                     (1U)                                                /*!< I2C_MASK3: MASK Position                */
#define I2C_MASK3_MASK(x)                        (((uint32_t)(((uint32_t)(x))<<I2C_MASK3_MASK_SHIFT))&I2C_MASK3_MASK_MASK) /*!< I2C_MASK3                               */
/**
 * @} */ /* End group I2C_Register_Masks_GROUP 
 */

/* I2C - Peripheral instance base addresses */
#define I2C_BasePtr                    0x40000000UL //!< Peripheral base address
#define I2C                            ((I2C_Type *) I2C_BasePtr) //!< Freescale base pointer
#define I2C_BASE_PTR                   (I2C) //!< Freescale style base pointer
/**
 * @} */ /* End group I2C_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup IOCON_Peripheral_access_layer_GROUP IOCON Peripheral Access Layer
* @brief C Struct for IOCON
* @{
*/

/* ================================================================================ */
/* ================           IOCON (file:IOCON_LPC11Cxx)          ================ */
/* ================================================================================ */

/**
 * @brief I/O configuration
 */
/**
* @addtogroup IOCON_structs_GROUP IOCON struct
* @brief Struct for IOCON
* @{
*/
typedef struct {                                /*       IOCON Structure                                              */
   __IO uint32_t  PIO2_6;                       /**< 0000: I/O configuration for pin PIO2_6/ CT32B0_MAT1                */
        uint8_t   RESERVED_0[4];               
   __IO uint32_t  PIO2_0;                       /**< 0008: I/O configuration for pin PIO2_0/DTR/SSEL1                   */
   __IO uint32_t  RESET_PIO0_0;                 /**< 000C: I/O configuration for pin RESET/PIO0_0                       */
   __IO uint32_t  PIO0_1;                       /**< 0010: I/O configuration for pin PIO0_1/CLKOUT/CT32B0_MAT2          */
   __IO uint32_t  PIO1_8;                       /**< 0014: I/O configuration for pin PIO1_8/CT16B1_CAP0                 */
   __IO uint32_t  SSEL1_LOC;                    /**< 0018: SSEL1 pin location select register                           */
   __IO uint32_t  PIO0_2;                       /**< 001C: I/O configuration for pin PIO0_2/SSEL0/CT16B0_CAP0           */
   __IO uint32_t  PIO2_7;                       /**< 0020: I/O configuration for pin PIO2_7/ CT32B0_MAT2/RXD            */
   __IO uint32_t  PIO2_8;                       /**< 0024: I/O configuration for pin PIO2_8/ CT32B0_MAT3/TXD            */
   __IO uint32_t  PIO2_1;                       /**< 0028: I/O configuration for pin PIO2_1/DSR/SCK1                    */
   __IO uint32_t  PIO0_3;                       /**< 002C: I/O configuration for pin PIO0_3                             */
   __IO uint32_t  PIO0_4;                       /**< 0030: I/O configuration for pin PIO0_4/SCL                         */
   __IO uint32_t  PIO0_5;                       /**< 0034: I/O configuration for pin PIO0_5/SDA                         */
   __IO uint32_t  PIO1_9;                       /**< 0038: I/O configuration for pin PIO1_9/CT16B1_MAT0/ MOSI1          */
   __IO uint32_t  PIO3_4;                       /**< 003C: I/O configuration for pin PIO3_4/ CT16B0_CAP1/RXD            */
        uint8_t   RESERVED_1[8];               
   __IO uint32_t  PIO3_5;                       /**< 0048: I/O configuration for pin PIO3_5/ CT16B1_CAP1/TXD            */
   __IO uint32_t  PIO0_6;                       /**< 004C: I/O configuration for pin PIO0_6/SCK0                        */
   __IO uint32_t  PIO0_7;                       /**< 0050: I/O configuration for pin PIO0_7/CTS                         */
   __IO uint32_t  PIO2_9;                       /**< 0054: I/O configuration for pin PIO2_9/ CT32B0_CAP0                */
   __IO uint32_t  PIO2_10;                      /**< 0058: I/O configuration for pin PIO2_10                            */
   __IO uint32_t  PIO2_2;                       /**< 005C: I/O configuration for pin PIO2_2/DCD/MISO1                   */
   __IO uint32_t  PIO0_8;                       /**< 0060: I/O configuration for pin PIO0_8/MISO0/CT16B0_MAT0           */
   __IO uint32_t  PIO0_9;                       /**< 0064: I/O configuration for pin PIO0_9/MOSI0/CT16B0_MAT1           */
   __IO uint32_t  SWCLK_PIO0_10;                /**< 0068: I/O configuration for pin SWCLK/PIO0_10/ SCK0/CT16B0_MAT2    */
   __IO uint32_t  PIO1_10;                      /**< 006C: I/O configuration for pin PIO1_10/AD6/CT16B1_MAT1/ MISO1     */
   __IO uint32_t  PIO2_11;                      /**< 0070: I/O configuration for pin PIO2_11/SCK0/ CT32B0_CAP1          */
   __IO uint32_t  R_PIO0_11;                    /**< 0074: I/O configuration for pin R/PIO0_11/AD0/CT32B0_MAT3          */
   __IO uint32_t  R_PIO1_0;                     /**< 0078: I/O configuration for pin R/PIO1_0/AD1/CT32B1_CAP0           */
   __IO uint32_t  R_PIO1_1;                     /**< 007C: I/O configuration for pin R/PIO1_1/AD2/CT32B1_MAT0           */
   __IO uint32_t  R_PIO1_2;                     /**< 0080: I/O configuration for pin R/PIO1_2/AD3/CT32B1_MAT1           */
   __IO uint32_t  PIO3_0;                       /**< 0084: I/O configuration for pin PIO3_0/DTR/CT16B0_MAT0/TXD         */
   __IO uint32_t  PIO3_1;                       /**< 0088: I/O configuration for pin PIO3_1/DSR/CT16B0_MAT1/RXD         */
   __IO uint32_t  PIO2_3;                       /**< 008C: I/O configuration for pin PIO2_3/RI/MOSI1                    */
   __IO uint32_t  SWDIO_PIO1_3;                 /**< 0090: I/O configuration for pin SWDIO/PIO1_3/AD4/CT32B1_MAT2       */
   __IO uint32_t  PIO1_4;                       /**< 0094: I/O configuration for pin PIO1_4/AD5/CT32B1_MAT3             */
   __IO uint32_t  PIO1_11;                      /**< 0098: I/O configuration for pin PIO1_11/AD7/CT32B1_CAP1            */
   __IO uint32_t  PIO3_2;                       /**< 009C: I/O configuration for pin PIO3_2/DCD/ CT16B0_MAT2/SCK1       */
   __IO uint32_t  PIO1_5;                       /**< 00A0: I/O configuration for pin PIO1_5/RTS/CT32B0_CAP0             */
   __IO uint32_t  PIO1_6;                       /**< 00A4: I/O configuration for pin PIO1_6/RXD/CT32B0_MAT0             */
   __IO uint32_t  PIO1_7;                       /**< 00A8: I/O configuration for pin PIO1_7/TXD/CT32B0_MAT1             */
   __IO uint32_t  PIO3_3;                       /**< 00AC: I/O configuration for pin PIO3_3/RI/ CT16B0_CAP0             */
   __IO uint32_t  SCK0_LOC;                     /**< 00B0: SCK0 pin location select register                            */
   __IO uint32_t  DSR_LOC;                      /**< 00B4: DSR pin location select register                             */
   __IO uint32_t  DCD_LOC;                      /**< 00B8: DCD pin location select register                             */
   __IO uint32_t  RI_LOC;                       /**< 00BC: RI pin location select register                              */
        uint8_t   RESERVED_2[4];               
   __IO uint32_t  SCK1_LOC;                     /**< 00C4: SCK1 pin location select register                            */
   __IO uint32_t  MISO1_LOC;                    /**< 00C8: MISO1 pin location select register                           */
   __IO uint32_t  MOSI1_LOC;                    /**< 00CC: MOSI1 pin location select register                           */
        uint8_t   RESERVED_3[4];               
   __IO uint32_t  RXD_LOC;                      /**< 00D4: RXD pin location select register                             */
} IOCON_Type;

/**
 * @} */ /* End group IOCON_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'IOCON' Position & Mask macros                       ----------- */
/* -------------------------------------------------------------------------------- */

