podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup IOCON_Register_Masks_GROUP IOCON Register Masks
* @brief Register Masks for IOCON
* @{
*/
/* ------- PIO2_6 Bit Fields                        ------ */
#define IOCON_PIO2_6_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_6: FUNC Mask                 */
#define IOCON_PIO2_6_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_6: FUNC Position             */
#define IOCON_PIO2_6_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_6_FUNC_SHIFT))&IOCON_PIO2_6_FUNC_MASK) /*!< IOCON_PIO2_6                            */
#define IOCON_PIO2_6_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_6: MODE Mask                 */
#define IOCON_PIO2_6_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_6: MODE Position             */
#define IOCON_PIO2_6_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_6_MODE_SHIFT))&IOCON_PIO2_6_MODE_MASK) /*!< IOCON_PIO2_6                            */
#define IOCON_PIO2_6_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_6: HYS Mask                  */
#define IOCON_PIO2_6_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_6: HYS Position              */
#define IOCON_PIO2_6_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_6_HYS_SHIFT))&IOCON_PIO2_6_HYS_MASK) /*!< IOCON_PIO2_6                            */
#define IOCON_PIO2_6_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_6: OD Mask                   */
#define IOCON_PIO2_6_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_6: OD Position               */
#define IOCON_PIO2_6_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_6_OD_SHIFT))&IOCON_PIO2_6_OD_MASK) /*!< IOCON_PIO2_6                            */
/* ------- PIO2_0 Bit Fields                        ------ */
#define IOCON_PIO2_0_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_0: FUNC Mask                 */
#define IOCON_PIO2_0_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_0: FUNC Position             */
#define IOCON_PIO2_0_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_0_FUNC_SHIFT))&IOCON_PIO2_0_FUNC_MASK) /*!< IOCON_PIO2_0                            */
#define IOCON_PIO2_0_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_0: MODE Mask                 */
#define IOCON_PIO2_0_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_0: MODE Position             */
#define IOCON_PIO2_0_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_0_MODE_SHIFT))&IOCON_PIO2_0_MODE_MASK) /*!< IOCON_PIO2_0                            */
#define IOCON_PIO2_0_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_0: HYS Mask                  */
#define IOCON_PIO2_0_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_0: HYS Position              */
#define IOCON_PIO2_0_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_0_HYS_SHIFT))&IOCON_PIO2_0_HYS_MASK) /*!< IOCON_PIO2_0                            */
#define IOCON_PIO2_0_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_0: OD Mask                   */
#define IOCON_PIO2_0_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_0: OD Position               */
#define IOCON_PIO2_0_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_0_OD_SHIFT))&IOCON_PIO2_0_OD_MASK) /*!< IOCON_PIO2_0                            */
/* ------- RESET_PIO0_0 Bit Fields                  ------ */
#define IOCON_RESET_PIO0_0_FUNC_MASK             (0x7U)                                              /*!< IOCON_RESET_PIO0_0: FUNC Mask           */
#define IOCON_RESET_PIO0_0_FUNC_SHIFT            (0U)                                                /*!< IOCON_RESET_PIO0_0: FUNC Position       */
#define IOCON_RESET_PIO0_0_FUNC(x)               (((uint32_t)(((uint32_t)(x))<<IOCON_RESET_PIO0_0_FUNC_SHIFT))&IOCON_RESET_PIO0_0_FUNC_MASK) /*!< IOCON_RESET_PIO0_0                      */
#define IOCON_RESET_PIO0_0_MODE_MASK             (0x18U)                                             /*!< IOCON_RESET_PIO0_0: MODE Mask           */
#define IOCON_RESET_PIO0_0_MODE_SHIFT            (3U)                                                /*!< IOCON_RESET_PIO0_0: MODE Position       */
#define IOCON_RESET_PIO0_0_MODE(x)               (((uint32_t)(((uint32_t)(x))<<IOCON_RESET_PIO0_0_MODE_SHIFT))&IOCON_RESET_PIO0_0_MODE_MASK) /*!< IOCON_RESET_PIO0_0                      */
#define IOCON_RESET_PIO0_0_HYS_MASK              (0x20U)                                             /*!< IOCON_RESET_PIO0_0: HYS Mask            */
#define IOCON_RESET_PIO0_0_HYS_SHIFT             (5U)                                                /*!< IOCON_RESET_PIO0_0: HYS Position        */
#define IOCON_RESET_PIO0_0_HYS(x)                (((uint32_t)(((uint32_t)(x))<<IOCON_RESET_PIO0_0_HYS_SHIFT))&IOCON_RESET_PIO0_0_HYS_MASK) /*!< IOCON_RESET_PIO0_0                      */
#define IOCON_RESET_PIO0_0_OD_MASK               (0x400U)                                            /*!< IOCON_RESET_PIO0_0: OD Mask             */
#define IOCON_RESET_PIO0_0_OD_SHIFT              (10U)                                               /*!< IOCON_RESET_PIO0_0: OD Position         */
#define IOCON_RESET_PIO0_0_OD(x)                 (((uint32_t)(((uint32_t)(x))<<IOCON_RESET_PIO0_0_OD_SHIFT))&IOCON_RESET_PIO0_0_OD_MASK) /*!< IOCON_RESET_PIO0_0                      */
/* ------- PIO0_1 Bit Fields                        ------ */
#define IOCON_PIO0_1_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_1: FUNC Mask                 */
#define IOCON_PIO0_1_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_1: FUNC Position             */
#define IOCON_PIO0_1_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_1_FUNC_SHIFT))&IOCON_PIO0_1_FUNC_MASK) /*!< IOCON_PIO0_1                            */
#define IOCON_PIO0_1_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_1: MODE Mask                 */
#define IOCON_PIO0_1_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_1: MODE Position             */
#define IOCON_PIO0_1_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_1_MODE_SHIFT))&IOCON_PIO0_1_MODE_MASK) /*!< IOCON_PIO0_1                            */
#define IOCON_PIO0_1_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_1: HYS Mask                  */
#define IOCON_PIO0_1_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_1: HYS Position              */
#define IOCON_PIO0_1_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_1_HYS_SHIFT))&IOCON_PIO0_1_HYS_MASK) /*!< IOCON_PIO0_1                            */
#define IOCON_PIO0_1_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_1: OD Mask                   */
#define IOCON_PIO0_1_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_1: OD Position               */
#define IOCON_PIO0_1_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_1_OD_SHIFT))&IOCON_PIO0_1_OD_MASK) /*!< IOCON_PIO0_1                            */
/* ------- PIO1_8 Bit Fields                        ------ */
#define IOCON_PIO1_8_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO1_8: FUNC Mask                 */
#define IOCON_PIO1_8_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO1_8: FUNC Position             */
#define IOCON_PIO1_8_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_8_FUNC_SHIFT))&IOCON_PIO1_8_FUNC_MASK) /*!< IOCON_PIO1_8                            */
#define IOCON_PIO1_8_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO1_8: MODE Mask                 */
#define IOCON_PIO1_8_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO1_8: MODE Position             */
#define IOCON_PIO1_8_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_8_MODE_SHIFT))&IOCON_PIO1_8_MODE_MASK) /*!< IOCON_PIO1_8                            */
#define IOCON_PIO1_8_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO1_8: HYS Mask                  */
#define IOCON_PIO1_8_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO1_8: HYS Position              */
#define IOCON_PIO1_8_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_8_HYS_SHIFT))&IOCON_PIO1_8_HYS_MASK) /*!< IOCON_PIO1_8                            */
#define IOCON_PIO1_8_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO1_8: OD Mask                   */
#define IOCON_PIO1_8_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO1_8: OD Position               */
#define IOCON_PIO1_8_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_8_OD_SHIFT))&IOCON_PIO1_8_OD_MASK) /*!< IOCON_PIO1_8                            */
/* ------- SSEL1_LOC Bit Fields                     ------ */
#define IOCON_SSEL1_LOC_SSEL1LOC_MASK            (0x3U)                                              /*!< IOCON_SSEL1_LOC: SSEL1LOC Mask          */
#define IOCON_SSEL1_LOC_SSEL1LOC_SHIFT           (0U)                                                /*!< IOCON_SSEL1_LOC: SSEL1LOC Position      */
#define IOCON_SSEL1_LOC_SSEL1LOC(x)              (((uint32_t)(((uint32_t)(x))<<IOCON_SSEL1_LOC_SSEL1LOC_SHIFT))&IOCON_SSEL1_LOC_SSEL1LOC_MASK) /*!< IOCON_SSEL1_LOC                         */
/* ------- PIO0_2 Bit Fields                        ------ */
#define IOCON_PIO0_2_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_2: FUNC Mask                 */
#define IOCON_PIO0_2_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_2: FUNC Position             */
#define IOCON_PIO0_2_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_2_FUNC_SHIFT))&IOCON_PIO0_2_FUNC_MASK) /*!< IOCON_PIO0_2                            */
#define IOCON_PIO0_2_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_2: MODE Mask                 */
#define IOCON_PIO0_2_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_2: MODE Position             */
#define IOCON_PIO0_2_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_2_MODE_SHIFT))&IOCON_PIO0_2_MODE_MASK) /*!< IOCON_PIO0_2                            */
#define IOCON_PIO0_2_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_2: HYS Mask                  */
#define IOCON_PIO0_2_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_2: HYS Position              */
#define IOCON_PIO0_2_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_2_HYS_SHIFT))&IOCON_PIO0_2_HYS_MASK) /*!< IOCON_PIO0_2                            */
#define IOCON_PIO0_2_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_2: OD Mask                   */
#define IOCON_PIO0_2_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_2: OD Position               */
#define IOCON_PIO0_2_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_2_OD_SHIFT))&IOCON_PIO0_2_OD_MASK) /*!< IOCON_PIO0_2                            */
/* ------- PIO2_7 Bit Fields                        ------ */
#define IOCON_PIO2_7_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_7: FUNC Mask                 */
#define IOCON_PIO2_7_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_7: FUNC Position             */
#define IOCON_PIO2_7_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_7_FUNC_SHIFT))&IOCON_PIO2_7_FUNC_MASK) /*!< IOCON_PIO2_7                            */
#define IOCON_PIO2_7_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_7: MODE Mask                 */
#define IOCON_PIO2_7_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_7: MODE Position             */
#define IOCON_PIO2_7_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_7_MODE_SHIFT))&IOCON_PIO2_7_MODE_MASK) /*!< IOCON_PIO2_7                            */
#define IOCON_PIO2_7_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_7: HYS Mask                  */
#define IOCON_PIO2_7_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_7: HYS Position              */
#define IOCON_PIO2_7_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_7_HYS_SHIFT))&IOCON_PIO2_7_HYS_MASK) /*!< IOCON_PIO2_7                            */
#define IOCON_PIO2_7_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_7: OD Mask                   */
#define IOCON_PIO2_7_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_7: OD Position               */
#define IOCON_PIO2_7_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_7_OD_SHIFT))&IOCON_PIO2_7_OD_MASK) /*!< IOCON_PIO2_7                            */
/* ------- PIO2_8 Bit Fields                        ------ */
#define IOCON_PIO2_8_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_8: FUNC Mask                 */
#define IOCON_PIO2_8_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_8: FUNC Position             */
#define IOCON_PIO2_8_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_8_FUNC_SHIFT))&IOCON_PIO2_8_FUNC_MASK) /*!< IOCON_PIO2_8                            */
#define IOCON_PIO2_8_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_8: MODE Mask                 */
#define IOCON_PIO2_8_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_8: MODE Position             */
#define IOCON_PIO2_8_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_8_MODE_SHIFT))&IOCON_PIO2_8_MODE_MASK) /*!< IOCON_PIO2_8                            */
#define IOCON_PIO2_8_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_8: HYS Mask                  */
#define IOCON_PIO2_8_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_8: HYS Position              */
#define IOCON_PIO2_8_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_8_HYS_SHIFT))&IOCON_PIO2_8_HYS_MASK) /*!< IOCON_PIO2_8                            */
#define IOCON_PIO2_8_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_8: OD Mask                   */
#define IOCON_PIO2_8_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_8: OD Position               */
#define IOCON_PIO2_8_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_8_OD_SHIFT))&IOCON_PIO2_8_OD_MASK) /*!< IOCON_PIO2_8                            */
/* ------- PIO2_1 Bit Fields                        ------ */
#define IOCON_PIO2_1_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_1: FUNC Mask                 */
#define IOCON_PIO2_1_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_1: FUNC Position             */
#define IOCON_PIO2_1_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_1_FUNC_SHIFT))&IOCON_PIO2_1_FUNC_MASK) /*!< IOCON_PIO2_1                            */
#define IOCON_PIO2_1_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_1: MODE Mask                 */
#define IOCON_PIO2_1_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_1: MODE Position             */
#define IOCON_PIO2_1_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_1_MODE_SHIFT))&IOCON_PIO2_1_MODE_MASK) /*!< IOCON_PIO2_1                            */
#define IOCON_PIO2_1_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_1: HYS Mask                  */
#define IOCON_PIO2_1_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_1: HYS Position              */
#define IOCON_PIO2_1_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_1_HYS_SHIFT))&IOCON_PIO2_1_HYS_MASK) /*!< IOCON_PIO2_1                            */
#define IOCON_PIO2_1_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_1: OD Mask                   */
#define IOCON_PIO2_1_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_1: OD Position               */
#define IOCON_PIO2_1_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_1_OD_SHIFT))&IOCON_PIO2_1_OD_MASK) /*!< IOCON_PIO2_1                            */
/* ------- PIO0_3 Bit Fields                        ------ */
#define IOCON_PIO0_3_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_3: FUNC Mask                 */
#define IOCON_PIO0_3_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_3: FUNC Position             */
#define IOCON_PIO0_3_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_3_FUNC_SHIFT))&IOCON_PIO0_3_FUNC_MASK) /*!< IOCON_PIO0_3                            */
#define IOCON_PIO0_3_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_3: MODE Mask                 */
#define IOCON_PIO0_3_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_3: MODE Position             */
#define IOCON_PIO0_3_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_3_MODE_SHIFT))&IOCON_PIO0_3_MODE_MASK) /*!< IOCON_PIO0_3                            */
#define IOCON_PIO0_3_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_3: HYS Mask                  */
#define IOCON_PIO0_3_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_3: HYS Position              */
#define IOCON_PIO0_3_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_3_HYS_SHIFT))&IOCON_PIO0_3_HYS_MASK) /*!< IOCON_PIO0_3                            */
#define IOCON_PIO0_3_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_3: OD Mask                   */
#define IOCON_PIO0_3_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_3: OD Position               */
#define IOCON_PIO0_3_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_3_OD_SHIFT))&IOCON_PIO0_3_OD_MASK) /*!< IOCON_PIO0_3                            */
/* ------- PIO0_4 Bit Fields                        ------ */
#define IOCON_PIO0_4_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_4: FUNC Mask                 */
#define IOCON_PIO0_4_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_4: FUNC Position             */
#define IOCON_PIO0_4_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_4_FUNC_SHIFT))&IOCON_PIO0_4_FUNC_MASK) /*!< IOCON_PIO0_4                            */
#define IOCON_PIO0_4_I2CMODE_MASK                (0x300U)                                            /*!< IOCON_PIO0_4: I2CMODE Mask              */
#define IOCON_PIO0_4_I2CMODE_SHIFT               (8U)                                                /*!< IOCON_PIO0_4: I2CMODE Position          */
#define IOCON_PIO0_4_I2CMODE(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_4_I2CMODE_SHIFT))&IOCON_PIO0_4_I2CMODE_MASK) /*!< IOCON_PIO0_4                            */
/* ------- PIO0_5 Bit Fields                        ------ */
#define IOCON_PIO0_5_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_5: FUNC Mask                 */
#define IOCON_PIO0_5_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_5: FUNC Position             */
#define IOCON_PIO0_5_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_5_FUNC_SHIFT))&IOCON_PIO0_5_FUNC_MASK) /*!< IOCON_PIO0_5                            */
#define IOCON_PIO0_5_I2CMODE_MASK                (0x300U)                                            /*!< IOCON_PIO0_5: I2CMODE Mask              */
#define IOCON_PIO0_5_I2CMODE_SHIFT               (8U)                                                /*!< IOCON_PIO0_5: I2CMODE Position          */
#define IOCON_PIO0_5_I2CMODE(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_5_I2CMODE_SHIFT))&IOCON_PIO0_5_I2CMODE_MASK) /*!< IOCON_PIO0_5                            */
/* ------- PIO1_9 Bit Fields                        ------ */
#define IOCON_PIO1_9_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO1_9: FUNC Mask                 */
#define IOCON_PIO1_9_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO1_9: FUNC Position             */
#define IOCON_PIO1_9_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_9_FUNC_SHIFT))&IOCON_PIO1_9_FUNC_MASK) /*!< IOCON_PIO1_9                            */
#define IOCON_PIO1_9_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO1_9: MODE Mask                 */
#define IOCON_PIO1_9_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO1_9: MODE Position             */
#define IOCON_PIO1_9_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_9_MODE_SHIFT))&IOCON_PIO1_9_MODE_MASK) /*!< IOCON_PIO1_9                            */
#define IOCON_PIO1_9_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO1_9: HYS Mask                  */
#define IOCON_PIO1_9_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO1_9: HYS Position              */
#define IOCON_PIO1_9_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_9_HYS_SHIFT))&IOCON_PIO1_9_HYS_MASK) /*!< IOCON_PIO1_9                            */
#define IOCON_PIO1_9_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO1_9: OD Mask                   */
