podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define IOCON_PIO1_9_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO1_9: OD Position               */
#define IOCON_PIO1_9_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_9_OD_SHIFT))&IOCON_PIO1_9_OD_MASK) /*!< IOCON_PIO1_9                            */
/* ------- PIO3_4 Bit Fields                        ------ */
#define IOCON_PIO3_4_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO3_4: FUNC Mask                 */
#define IOCON_PIO3_4_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO3_4: FUNC Position             */
#define IOCON_PIO3_4_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_4_FUNC_SHIFT))&IOCON_PIO3_4_FUNC_MASK) /*!< IOCON_PIO3_4                            */
#define IOCON_PIO3_4_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO3_4: MODE Mask                 */
#define IOCON_PIO3_4_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO3_4: MODE Position             */
#define IOCON_PIO3_4_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_4_MODE_SHIFT))&IOCON_PIO3_4_MODE_MASK) /*!< IOCON_PIO3_4                            */
#define IOCON_PIO3_4_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO3_4: HYS Mask                  */
#define IOCON_PIO3_4_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO3_4: HYS Position              */
#define IOCON_PIO3_4_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_4_HYS_SHIFT))&IOCON_PIO3_4_HYS_MASK) /*!< IOCON_PIO3_4                            */
#define IOCON_PIO3_4_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO3_4: OD Mask                   */
#define IOCON_PIO3_4_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO3_4: OD Position               */
#define IOCON_PIO3_4_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_4_OD_SHIFT))&IOCON_PIO3_4_OD_MASK) /*!< IOCON_PIO3_4                            */
/* ------- PIO3_5 Bit Fields                        ------ */
#define IOCON_PIO3_5_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO3_5: FUNC Mask                 */
#define IOCON_PIO3_5_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO3_5: FUNC Position             */
#define IOCON_PIO3_5_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_5_FUNC_SHIFT))&IOCON_PIO3_5_FUNC_MASK) /*!< IOCON_PIO3_5                            */
#define IOCON_PIO3_5_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO3_5: MODE Mask                 */
#define IOCON_PIO3_5_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO3_5: MODE Position             */
#define IOCON_PIO3_5_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_5_MODE_SHIFT))&IOCON_PIO3_5_MODE_MASK) /*!< IOCON_PIO3_5                            */
#define IOCON_PIO3_5_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO3_5: HYS Mask                  */
#define IOCON_PIO3_5_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO3_5: HYS Position              */
#define IOCON_PIO3_5_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_5_HYS_SHIFT))&IOCON_PIO3_5_HYS_MASK) /*!< IOCON_PIO3_5                            */
#define IOCON_PIO3_5_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO3_5: OD Mask                   */
#define IOCON_PIO3_5_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO3_5: OD Position               */
#define IOCON_PIO3_5_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_5_OD_SHIFT))&IOCON_PIO3_5_OD_MASK) /*!< IOCON_PIO3_5                            */
/* ------- PIO0_6 Bit Fields                        ------ */
#define IOCON_PIO0_6_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_6: FUNC Mask                 */
#define IOCON_PIO0_6_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_6: FUNC Position             */
#define IOCON_PIO0_6_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_6_FUNC_SHIFT))&IOCON_PIO0_6_FUNC_MASK) /*!< IOCON_PIO0_6                            */
#define IOCON_PIO0_6_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_6: MODE Mask                 */
#define IOCON_PIO0_6_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_6: MODE Position             */
#define IOCON_PIO0_6_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_6_MODE_SHIFT))&IOCON_PIO0_6_MODE_MASK) /*!< IOCON_PIO0_6                            */
#define IOCON_PIO0_6_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_6: HYS Mask                  */
#define IOCON_PIO0_6_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_6: HYS Position              */
#define IOCON_PIO0_6_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_6_HYS_SHIFT))&IOCON_PIO0_6_HYS_MASK) /*!< IOCON_PIO0_6                            */
#define IOCON_PIO0_6_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_6: OD Mask                   */
#define IOCON_PIO0_6_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_6: OD Position               */
#define IOCON_PIO0_6_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_6_OD_SHIFT))&IOCON_PIO0_6_OD_MASK) /*!< IOCON_PIO0_6                            */
/* ------- PIO0_7 Bit Fields                        ------ */
#define IOCON_PIO0_7_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_7: FUNC Mask                 */
#define IOCON_PIO0_7_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_7: FUNC Position             */
#define IOCON_PIO0_7_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_7_FUNC_SHIFT))&IOCON_PIO0_7_FUNC_MASK) /*!< IOCON_PIO0_7                            */
#define IOCON_PIO0_7_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_7: MODE Mask                 */
#define IOCON_PIO0_7_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_7: MODE Position             */
#define IOCON_PIO0_7_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_7_MODE_SHIFT))&IOCON_PIO0_7_MODE_MASK) /*!< IOCON_PIO0_7                            */
#define IOCON_PIO0_7_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_7: HYS Mask                  */
#define IOCON_PIO0_7_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_7: HYS Position              */
#define IOCON_PIO0_7_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_7_HYS_SHIFT))&IOCON_PIO0_7_HYS_MASK) /*!< IOCON_PIO0_7                            */
#define IOCON_PIO0_7_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_7: OD Mask                   */
#define IOCON_PIO0_7_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_7: OD Position               */
#define IOCON_PIO0_7_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_7_OD_SHIFT))&IOCON_PIO0_7_OD_MASK) /*!< IOCON_PIO0_7                            */
/* ------- PIO2_9 Bit Fields                        ------ */
#define IOCON_PIO2_9_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_9: FUNC Mask                 */
#define IOCON_PIO2_9_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_9: FUNC Position             */
#define IOCON_PIO2_9_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_9_FUNC_SHIFT))&IOCON_PIO2_9_FUNC_MASK) /*!< IOCON_PIO2_9                            */
#define IOCON_PIO2_9_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_9: MODE Mask                 */
#define IOCON_PIO2_9_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_9: MODE Position             */
#define IOCON_PIO2_9_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_9_MODE_SHIFT))&IOCON_PIO2_9_MODE_MASK) /*!< IOCON_PIO2_9                            */
#define IOCON_PIO2_9_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_9: HYS Mask                  */
#define IOCON_PIO2_9_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_9: HYS Position              */
#define IOCON_PIO2_9_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_9_HYS_SHIFT))&IOCON_PIO2_9_HYS_MASK) /*!< IOCON_PIO2_9                            */
#define IOCON_PIO2_9_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_9: OD Mask                   */
#define IOCON_PIO2_9_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_9: OD Position               */
#define IOCON_PIO2_9_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_9_OD_SHIFT))&IOCON_PIO2_9_OD_MASK) /*!< IOCON_PIO2_9                            */
/* ------- PIO2_10 Bit Fields                       ------ */
#define IOCON_PIO2_10_FUNC_MASK                  (0x7U)                                              /*!< IOCON_PIO2_10: FUNC Mask                */
#define IOCON_PIO2_10_FUNC_SHIFT                 (0U)                                                /*!< IOCON_PIO2_10: FUNC Position            */
#define IOCON_PIO2_10_FUNC(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_10_FUNC_SHIFT))&IOCON_PIO2_10_FUNC_MASK) /*!< IOCON_PIO2_10                           */
#define IOCON_PIO2_10_MODE_MASK                  (0x18U)                                             /*!< IOCON_PIO2_10: MODE Mask                */
#define IOCON_PIO2_10_MODE_SHIFT                 (3U)                                                /*!< IOCON_PIO2_10: MODE Position            */
#define IOCON_PIO2_10_MODE(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_10_MODE_SHIFT))&IOCON_PIO2_10_MODE_MASK) /*!< IOCON_PIO2_10                           */
#define IOCON_PIO2_10_HYS_MASK                   (0x20U)                                             /*!< IOCON_PIO2_10: HYS Mask                 */
#define IOCON_PIO2_10_HYS_SHIFT                  (5U)                                                /*!< IOCON_PIO2_10: HYS Position             */
#define IOCON_PIO2_10_HYS(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_10_HYS_SHIFT))&IOCON_PIO2_10_HYS_MASK) /*!< IOCON_PIO2_10                           */
#define IOCON_PIO2_10_OD_MASK                    (0x400U)                                            /*!< IOCON_PIO2_10: OD Mask                  */
#define IOCON_PIO2_10_OD_SHIFT                   (10U)                                               /*!< IOCON_PIO2_10: OD Position              */
#define IOCON_PIO2_10_OD(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_10_OD_SHIFT))&IOCON_PIO2_10_OD_MASK) /*!< IOCON_PIO2_10                           */
/* ------- PIO2_2 Bit Fields                        ------ */
#define IOCON_PIO2_2_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_2: FUNC Mask                 */
#define IOCON_PIO2_2_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_2: FUNC Position             */
#define IOCON_PIO2_2_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_2_FUNC_SHIFT))&IOCON_PIO2_2_FUNC_MASK) /*!< IOCON_PIO2_2                            */
#define IOCON_PIO2_2_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_2: MODE Mask                 */
#define IOCON_PIO2_2_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_2: MODE Position             */
#define IOCON_PIO2_2_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_2_MODE_SHIFT))&IOCON_PIO2_2_MODE_MASK) /*!< IOCON_PIO2_2                            */
#define IOCON_PIO2_2_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_2: HYS Mask                  */
#define IOCON_PIO2_2_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_2: HYS Position              */
#define IOCON_PIO2_2_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_2_HYS_SHIFT))&IOCON_PIO2_2_HYS_MASK) /*!< IOCON_PIO2_2                            */
#define IOCON_PIO2_2_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_2: OD Mask                   */
#define IOCON_PIO2_2_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_2: OD Position               */
#define IOCON_PIO2_2_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_2_OD_SHIFT))&IOCON_PIO2_2_OD_MASK) /*!< IOCON_PIO2_2                            */
/* ------- PIO0_8 Bit Fields                        ------ */
#define IOCON_PIO0_8_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_8: FUNC Mask                 */
#define IOCON_PIO0_8_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_8: FUNC Position             */
#define IOCON_PIO0_8_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_8_FUNC_SHIFT))&IOCON_PIO0_8_FUNC_MASK) /*!< IOCON_PIO0_8                            */
#define IOCON_PIO0_8_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_8: MODE Mask                 */
#define IOCON_PIO0_8_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_8: MODE Position             */
#define IOCON_PIO0_8_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_8_MODE_SHIFT))&IOCON_PIO0_8_MODE_MASK) /*!< IOCON_PIO0_8                            */
#define IOCON_PIO0_8_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_8: HYS Mask                  */
#define IOCON_PIO0_8_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_8: HYS Position              */
#define IOCON_PIO0_8_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_8_HYS_SHIFT))&IOCON_PIO0_8_HYS_MASK) /*!< IOCON_PIO0_8                            */
#define IOCON_PIO0_8_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_8: OD Mask                   */
#define IOCON_PIO0_8_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_8: OD Position               */
#define IOCON_PIO0_8_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_8_OD_SHIFT))&IOCON_PIO0_8_OD_MASK) /*!< IOCON_PIO0_8                            */
/* ------- PIO0_9 Bit Fields                        ------ */
#define IOCON_PIO0_9_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO0_9: FUNC Mask                 */
#define IOCON_PIO0_9_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO0_9: FUNC Position             */
#define IOCON_PIO0_9_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_9_FUNC_SHIFT))&IOCON_PIO0_9_FUNC_MASK) /*!< IOCON_PIO0_9                            */
#define IOCON_PIO0_9_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO0_9: MODE Mask                 */
#define IOCON_PIO0_9_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO0_9: MODE Position             */
#define IOCON_PIO0_9_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_9_MODE_SHIFT))&IOCON_PIO0_9_MODE_MASK) /*!< IOCON_PIO0_9                            */
#define IOCON_PIO0_9_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO0_9: HYS Mask                  */
#define IOCON_PIO0_9_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO0_9: HYS Position              */
#define IOCON_PIO0_9_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_9_HYS_SHIFT))&IOCON_PIO0_9_HYS_MASK) /*!< IOCON_PIO0_9                            */
#define IOCON_PIO0_9_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO0_9: OD Mask                   */
#define IOCON_PIO0_9_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO0_9: OD Position               */
#define IOCON_PIO0_9_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO0_9_OD_SHIFT))&IOCON_PIO0_9_OD_MASK) /*!< IOCON_PIO0_9                            */
/* ------- SWCLK_PIO0_10 Bit Fields                 ------ */
#define IOCON_SWCLK_PIO0_10_FUNC_MASK            (0x7U)                                              /*!< IOCON_SWCLK_PIO0_10: FUNC Mask          */
#define IOCON_SWCLK_PIO0_10_FUNC_SHIFT           (0U)                                                /*!< IOCON_SWCLK_PIO0_10: FUNC Position      */
#define IOCON_SWCLK_PIO0_10_FUNC(x)              (((uint32_t)(((uint32_t)(x))<<IOCON_SWCLK_PIO0_10_FUNC_SHIFT))&IOCON_SWCLK_PIO0_10_FUNC_MASK) /*!< IOCON_SWCLK_PIO0_10                     */
#define IOCON_SWCLK_PIO0_10_MODE_MASK            (0x18U)                                             /*!< IOCON_SWCLK_PIO0_10: MODE Mask          */
#define IOCON_SWCLK_PIO0_10_MODE_SHIFT           (3U)                                                /*!< IOCON_SWCLK_PIO0_10: MODE Position      */
#define IOCON_SWCLK_PIO0_10_MODE(x)              (((uint32_t)(((uint32_t)(x))<<IOCON_SWCLK_PIO0_10_MODE_SHIFT))&IOCON_SWCLK_PIO0_10_MODE_MASK) /*!< IOCON_SWCLK_PIO0_10                     */
#define IOCON_SWCLK_PIO0_10_HYS_MASK             (0x20U)                                             /*!< IOCON_SWCLK_PIO0_10: HYS Mask           */
#define IOCON_SWCLK_PIO0_10_HYS_SHIFT            (5U)                                                /*!< IOCON_SWCLK_PIO0_10: HYS Position       */
#define IOCON_SWCLK_PIO0_10_HYS(x)               (((uint32_t)(((uint32_t)(x))<<IOCON_SWCLK_PIO0_10_HYS_SHIFT))&IOCON_SWCLK_PIO0_10_HYS_MASK) /*!< IOCON_SWCLK_PIO0_10                     */
#define IOCON_SWCLK_PIO0_10_OD_MASK              (0x400U)                                            /*!< IOCON_SWCLK_PIO0_10: OD Mask            */
#define IOCON_SWCLK_PIO0_10_OD_SHIFT             (10U)                                               /*!< IOCON_SWCLK_PIO0_10: OD Position        */
#define IOCON_SWCLK_PIO0_10_OD(x)                (((uint32_t)(((uint32_t)(x))<<IOCON_SWCLK_PIO0_10_OD_SHIFT))&IOCON_SWCLK_PIO0_10_OD_MASK) /*!< IOCON_SWCLK_PIO0_10                     */
/* ------- PIO1_10 Bit Fields                       ------ */
#define IOCON_PIO1_10_FUNC_MASK                  (0x7U)                                              /*!< IOCON_PIO1_10: FUNC Mask                */
#define IOCON_PIO1_10_FUNC_SHIFT                 (0U)                                                /*!< IOCON_PIO1_10: FUNC Position            */
#define IOCON_PIO1_10_FUNC(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_10_FUNC_SHIFT))&IOCON_PIO1_10_FUNC_MASK) /*!< IOCON_PIO1_10                           */
#define IOCON_PIO1_10_MODE_MASK                  (0x18U)                                             /*!< IOCON_PIO1_10: MODE Mask                */
#define IOCON_PIO1_10_MODE_SHIFT                 (3U)                                                /*!< IOCON_PIO1_10: MODE Position            */
#define IOCON_PIO1_10_MODE(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_10_MODE_SHIFT))&IOCON_PIO1_10_MODE_MASK) /*!< IOCON_PIO1_10                           */
#define IOCON_PIO1_10_HYS_MASK                   (0x20U)                                             /*!< IOCON_PIO1_10: HYS Mask                 */
#define IOCON_PIO1_10_HYS_SHIFT                  (5U)                                                /*!< IOCON_PIO1_10: HYS Position             */
#define IOCON_PIO1_10_HYS(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_10_HYS_SHIFT))&IOCON_PIO1_10_HYS_MASK) /*!< IOCON_PIO1_10                           */
#define IOCON_PIO1_10_ADMODE_MASK                (0x80U)                                             /*!< IOCON_PIO1_10: ADMODE Mask              */
#define IOCON_PIO1_10_ADMODE_SHIFT               (7U)                                                /*!< IOCON_PIO1_10: ADMODE Position          */
#define IOCON_PIO1_10_ADMODE(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_10_ADMODE_SHIFT))&IOCON_PIO1_10_ADMODE_MASK) /*!< IOCON_PIO1_10                           */
#define IOCON_PIO1_10_OD_MASK                    (0x400U)                                            /*!< IOCON_PIO1_10: OD Mask                  */
#define IOCON_PIO1_10_OD_SHIFT                   (10U)                                               /*!< IOCON_PIO1_10: OD Position              */
#define IOCON_PIO1_10_OD(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_10_OD_SHIFT))&IOCON_PIO1_10_OD_MASK) /*!< IOCON_PIO1_10                           */
/* ------- PIO2_11 Bit Fields                       ------ */
#define IOCON_PIO2_11_FUNC_MASK                  (0x7U)                                              /*!< IOCON_PIO2_11: FUNC Mask                */
#define IOCON_PIO2_11_FUNC_SHIFT                 (0U)                                                /*!< IOCON_PIO2_11: FUNC Position            */
#define IOCON_PIO2_11_FUNC(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_11_FUNC_SHIFT))&IOCON_PIO2_11_FUNC_MASK) /*!< IOCON_PIO2_11                           */
#define IOCON_PIO2_11_MODE_MASK                  (0x18U)                                             /*!< IOCON_PIO2_11: MODE Mask                */
#define IOCON_PIO2_11_MODE_SHIFT                 (3U)                                                /*!< IOCON_PIO2_11: MODE Position            */
#define IOCON_PIO2_11_MODE(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_11_MODE_SHIFT))&IOCON_PIO2_11_MODE_MASK) /*!< IOCON_PIO2_11                           */
#define IOCON_PIO2_11_HYS_MASK                   (0x20U)                                             /*!< IOCON_PIO2_11: HYS Mask                 */
#define IOCON_PIO2_11_HYS_SHIFT                  (5U)                                                /*!< IOCON_PIO2_11: HYS Position             */
#define IOCON_PIO2_11_HYS(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_11_HYS_SHIFT))&IOCON_PIO2_11_HYS_MASK) /*!< IOCON_PIO2_11                           */
