podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define IOCON_PIO2_11_OD_MASK                    (0x400U)                                            /*!< IOCON_PIO2_11: OD Mask                  */
#define IOCON_PIO2_11_OD_SHIFT                   (10U)                                               /*!< IOCON_PIO2_11: OD Position              */
#define IOCON_PIO2_11_OD(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_11_OD_SHIFT))&IOCON_PIO2_11_OD_MASK) /*!< IOCON_PIO2_11                           */
/* ------- R_PIO0_11 Bit Fields                     ------ */
#define IOCON_R_PIO0_11_FUNC_MASK                (0x7U)                                              /*!< IOCON_R_PIO0_11: FUNC Mask              */
#define IOCON_R_PIO0_11_FUNC_SHIFT               (0U)                                                /*!< IOCON_R_PIO0_11: FUNC Position          */
#define IOCON_R_PIO0_11_FUNC(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO0_11_FUNC_SHIFT))&IOCON_R_PIO0_11_FUNC_MASK) /*!< IOCON_R_PIO0_11                         */
#define IOCON_R_PIO0_11_MODE_MASK                (0x18U)                                             /*!< IOCON_R_PIO0_11: MODE Mask              */
#define IOCON_R_PIO0_11_MODE_SHIFT               (3U)                                                /*!< IOCON_R_PIO0_11: MODE Position          */
#define IOCON_R_PIO0_11_MODE(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO0_11_MODE_SHIFT))&IOCON_R_PIO0_11_MODE_MASK) /*!< IOCON_R_PIO0_11                         */
#define IOCON_R_PIO0_11_HYS_MASK                 (0x20U)                                             /*!< IOCON_R_PIO0_11: HYS Mask               */
#define IOCON_R_PIO0_11_HYS_SHIFT                (5U)                                                /*!< IOCON_R_PIO0_11: HYS Position           */
#define IOCON_R_PIO0_11_HYS(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO0_11_HYS_SHIFT))&IOCON_R_PIO0_11_HYS_MASK) /*!< IOCON_R_PIO0_11                         */
#define IOCON_R_PIO0_11_ADMODE_MASK              (0x80U)                                             /*!< IOCON_R_PIO0_11: ADMODE Mask            */
#define IOCON_R_PIO0_11_ADMODE_SHIFT             (7U)                                                /*!< IOCON_R_PIO0_11: ADMODE Position        */
#define IOCON_R_PIO0_11_ADMODE(x)                (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO0_11_ADMODE_SHIFT))&IOCON_R_PIO0_11_ADMODE_MASK) /*!< IOCON_R_PIO0_11                         */
#define IOCON_R_PIO0_11_OD_MASK                  (0x400U)                                            /*!< IOCON_R_PIO0_11: OD Mask                */
#define IOCON_R_PIO0_11_OD_SHIFT                 (10U)                                               /*!< IOCON_R_PIO0_11: OD Position            */
#define IOCON_R_PIO0_11_OD(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO0_11_OD_SHIFT))&IOCON_R_PIO0_11_OD_MASK) /*!< IOCON_R_PIO0_11                         */
/* ------- R_PIO1_0 Bit Fields                      ------ */
#define IOCON_R_PIO1_0_FUNC_MASK                 (0x7U)                                              /*!< IOCON_R_PIO1_0: FUNC Mask               */
#define IOCON_R_PIO1_0_FUNC_SHIFT                (0U)                                                /*!< IOCON_R_PIO1_0: FUNC Position           */
#define IOCON_R_PIO1_0_FUNC(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_0_FUNC_SHIFT))&IOCON_R_PIO1_0_FUNC_MASK) /*!< IOCON_R_PIO1_0                          */
#define IOCON_R_PIO1_0_MODE_MASK                 (0x18U)                                             /*!< IOCON_R_PIO1_0: MODE Mask               */
#define IOCON_R_PIO1_0_MODE_SHIFT                (3U)                                                /*!< IOCON_R_PIO1_0: MODE Position           */
#define IOCON_R_PIO1_0_MODE(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_0_MODE_SHIFT))&IOCON_R_PIO1_0_MODE_MASK) /*!< IOCON_R_PIO1_0                          */
#define IOCON_R_PIO1_0_HYS_MASK                  (0x20U)                                             /*!< IOCON_R_PIO1_0: HYS Mask                */
#define IOCON_R_PIO1_0_HYS_SHIFT                 (5U)                                                /*!< IOCON_R_PIO1_0: HYS Position            */
#define IOCON_R_PIO1_0_HYS(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_0_HYS_SHIFT))&IOCON_R_PIO1_0_HYS_MASK) /*!< IOCON_R_PIO1_0                          */
#define IOCON_R_PIO1_0_ADMODE_MASK               (0x80U)                                             /*!< IOCON_R_PIO1_0: ADMODE Mask             */
#define IOCON_R_PIO1_0_ADMODE_SHIFT              (7U)                                                /*!< IOCON_R_PIO1_0: ADMODE Position         */
#define IOCON_R_PIO1_0_ADMODE(x)                 (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_0_ADMODE_SHIFT))&IOCON_R_PIO1_0_ADMODE_MASK) /*!< IOCON_R_PIO1_0                          */
#define IOCON_R_PIO1_0_OD_MASK                   (0x400U)                                            /*!< IOCON_R_PIO1_0: OD Mask                 */
#define IOCON_R_PIO1_0_OD_SHIFT                  (10U)                                               /*!< IOCON_R_PIO1_0: OD Position             */
#define IOCON_R_PIO1_0_OD(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_0_OD_SHIFT))&IOCON_R_PIO1_0_OD_MASK) /*!< IOCON_R_PIO1_0                          */
/* ------- R_PIO1_1 Bit Fields                      ------ */
#define IOCON_R_PIO1_1_FUNC_MASK                 (0x7U)                                              /*!< IOCON_R_PIO1_1: FUNC Mask               */
#define IOCON_R_PIO1_1_FUNC_SHIFT                (0U)                                                /*!< IOCON_R_PIO1_1: FUNC Position           */
#define IOCON_R_PIO1_1_FUNC(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_1_FUNC_SHIFT))&IOCON_R_PIO1_1_FUNC_MASK) /*!< IOCON_R_PIO1_1                          */
#define IOCON_R_PIO1_1_MODE_MASK                 (0x18U)                                             /*!< IOCON_R_PIO1_1: MODE Mask               */
#define IOCON_R_PIO1_1_MODE_SHIFT                (3U)                                                /*!< IOCON_R_PIO1_1: MODE Position           */
#define IOCON_R_PIO1_1_MODE(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_1_MODE_SHIFT))&IOCON_R_PIO1_1_MODE_MASK) /*!< IOCON_R_PIO1_1                          */
#define IOCON_R_PIO1_1_HYS_MASK                  (0x20U)                                             /*!< IOCON_R_PIO1_1: HYS Mask                */
#define IOCON_R_PIO1_1_HYS_SHIFT                 (5U)                                                /*!< IOCON_R_PIO1_1: HYS Position            */
#define IOCON_R_PIO1_1_HYS(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_1_HYS_SHIFT))&IOCON_R_PIO1_1_HYS_MASK) /*!< IOCON_R_PIO1_1                          */
#define IOCON_R_PIO1_1_ADMODE_MASK               (0x80U)                                             /*!< IOCON_R_PIO1_1: ADMODE Mask             */
#define IOCON_R_PIO1_1_ADMODE_SHIFT              (7U)                                                /*!< IOCON_R_PIO1_1: ADMODE Position         */
#define IOCON_R_PIO1_1_ADMODE(x)                 (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_1_ADMODE_SHIFT))&IOCON_R_PIO1_1_ADMODE_MASK) /*!< IOCON_R_PIO1_1                          */
#define IOCON_R_PIO1_1_OD_MASK                   (0x400U)                                            /*!< IOCON_R_PIO1_1: OD Mask                 */
#define IOCON_R_PIO1_1_OD_SHIFT                  (10U)                                               /*!< IOCON_R_PIO1_1: OD Position             */
#define IOCON_R_PIO1_1_OD(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_1_OD_SHIFT))&IOCON_R_PIO1_1_OD_MASK) /*!< IOCON_R_PIO1_1                          */
/* ------- R_PIO1_2 Bit Fields                      ------ */
#define IOCON_R_PIO1_2_FUNC_MASK                 (0x7U)                                              /*!< IOCON_R_PIO1_2: FUNC Mask               */
#define IOCON_R_PIO1_2_FUNC_SHIFT                (0U)                                                /*!< IOCON_R_PIO1_2: FUNC Position           */
#define IOCON_R_PIO1_2_FUNC(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_2_FUNC_SHIFT))&IOCON_R_PIO1_2_FUNC_MASK) /*!< IOCON_R_PIO1_2                          */
#define IOCON_R_PIO1_2_MODE_MASK                 (0x18U)                                             /*!< IOCON_R_PIO1_2: MODE Mask               */
#define IOCON_R_PIO1_2_MODE_SHIFT                (3U)                                                /*!< IOCON_R_PIO1_2: MODE Position           */
#define IOCON_R_PIO1_2_MODE(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_2_MODE_SHIFT))&IOCON_R_PIO1_2_MODE_MASK) /*!< IOCON_R_PIO1_2                          */
#define IOCON_R_PIO1_2_HYS_MASK                  (0x20U)                                             /*!< IOCON_R_PIO1_2: HYS Mask                */
#define IOCON_R_PIO1_2_HYS_SHIFT                 (5U)                                                /*!< IOCON_R_PIO1_2: HYS Position            */
#define IOCON_R_PIO1_2_HYS(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_2_HYS_SHIFT))&IOCON_R_PIO1_2_HYS_MASK) /*!< IOCON_R_PIO1_2                          */
#define IOCON_R_PIO1_2_ADMODE_MASK               (0x80U)                                             /*!< IOCON_R_PIO1_2: ADMODE Mask             */
#define IOCON_R_PIO1_2_ADMODE_SHIFT              (7U)                                                /*!< IOCON_R_PIO1_2: ADMODE Position         */
#define IOCON_R_PIO1_2_ADMODE(x)                 (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_2_ADMODE_SHIFT))&IOCON_R_PIO1_2_ADMODE_MASK) /*!< IOCON_R_PIO1_2                          */
#define IOCON_R_PIO1_2_OD_MASK                   (0x400U)                                            /*!< IOCON_R_PIO1_2: OD Mask                 */
#define IOCON_R_PIO1_2_OD_SHIFT                  (10U)                                               /*!< IOCON_R_PIO1_2: OD Position             */
#define IOCON_R_PIO1_2_OD(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_R_PIO1_2_OD_SHIFT))&IOCON_R_PIO1_2_OD_MASK) /*!< IOCON_R_PIO1_2                          */
/* ------- PIO3_0 Bit Fields                        ------ */
#define IOCON_PIO3_0_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO3_0: FUNC Mask                 */
#define IOCON_PIO3_0_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO3_0: FUNC Position             */
#define IOCON_PIO3_0_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_0_FUNC_SHIFT))&IOCON_PIO3_0_FUNC_MASK) /*!< IOCON_PIO3_0                            */
#define IOCON_PIO3_0_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO3_0: MODE Mask                 */
#define IOCON_PIO3_0_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO3_0: MODE Position             */
#define IOCON_PIO3_0_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_0_MODE_SHIFT))&IOCON_PIO3_0_MODE_MASK) /*!< IOCON_PIO3_0                            */
#define IOCON_PIO3_0_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO3_0: HYS Mask                  */
#define IOCON_PIO3_0_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO3_0: HYS Position              */
#define IOCON_PIO3_0_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_0_HYS_SHIFT))&IOCON_PIO3_0_HYS_MASK) /*!< IOCON_PIO3_0                            */
#define IOCON_PIO3_0_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO3_0: OD Mask                   */
#define IOCON_PIO3_0_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO3_0: OD Position               */
#define IOCON_PIO3_0_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_0_OD_SHIFT))&IOCON_PIO3_0_OD_MASK) /*!< IOCON_PIO3_0                            */
/* ------- PIO3_1 Bit Fields                        ------ */
#define IOCON_PIO3_1_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO3_1: FUNC Mask                 */
#define IOCON_PIO3_1_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO3_1: FUNC Position             */
#define IOCON_PIO3_1_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_1_FUNC_SHIFT))&IOCON_PIO3_1_FUNC_MASK) /*!< IOCON_PIO3_1                            */
#define IOCON_PIO3_1_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO3_1: MODE Mask                 */
#define IOCON_PIO3_1_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO3_1: MODE Position             */
#define IOCON_PIO3_1_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_1_MODE_SHIFT))&IOCON_PIO3_1_MODE_MASK) /*!< IOCON_PIO3_1                            */
#define IOCON_PIO3_1_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO3_1: HYS Mask                  */
#define IOCON_PIO3_1_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO3_1: HYS Position              */
#define IOCON_PIO3_1_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_1_HYS_SHIFT))&IOCON_PIO3_1_HYS_MASK) /*!< IOCON_PIO3_1                            */
#define IOCON_PIO3_1_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO3_1: OD Mask                   */
#define IOCON_PIO3_1_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO3_1: OD Position               */
#define IOCON_PIO3_1_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_1_OD_SHIFT))&IOCON_PIO3_1_OD_MASK) /*!< IOCON_PIO3_1                            */
/* ------- PIO2_3 Bit Fields                        ------ */
#define IOCON_PIO2_3_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO2_3: FUNC Mask                 */
#define IOCON_PIO2_3_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO2_3: FUNC Position             */
#define IOCON_PIO2_3_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_3_FUNC_SHIFT))&IOCON_PIO2_3_FUNC_MASK) /*!< IOCON_PIO2_3                            */
#define IOCON_PIO2_3_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO2_3: MODE Mask                 */
#define IOCON_PIO2_3_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO2_3: MODE Position             */
#define IOCON_PIO2_3_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_3_MODE_SHIFT))&IOCON_PIO2_3_MODE_MASK) /*!< IOCON_PIO2_3                            */
#define IOCON_PIO2_3_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO2_3: HYS Mask                  */
#define IOCON_PIO2_3_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO2_3: HYS Position              */
#define IOCON_PIO2_3_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_3_HYS_SHIFT))&IOCON_PIO2_3_HYS_MASK) /*!< IOCON_PIO2_3                            */
#define IOCON_PIO2_3_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO2_3: OD Mask                   */
#define IOCON_PIO2_3_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO2_3: OD Position               */
#define IOCON_PIO2_3_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO2_3_OD_SHIFT))&IOCON_PIO2_3_OD_MASK) /*!< IOCON_PIO2_3                            */
/* ------- SWDIO_PIO1_3 Bit Fields                  ------ */
#define IOCON_SWDIO_PIO1_3_FUNC_MASK             (0x7U)                                              /*!< IOCON_SWDIO_PIO1_3: FUNC Mask           */
#define IOCON_SWDIO_PIO1_3_FUNC_SHIFT            (0U)                                                /*!< IOCON_SWDIO_PIO1_3: FUNC Position       */
#define IOCON_SWDIO_PIO1_3_FUNC(x)               (((uint32_t)(((uint32_t)(x))<<IOCON_SWDIO_PIO1_3_FUNC_SHIFT))&IOCON_SWDIO_PIO1_3_FUNC_MASK) /*!< IOCON_SWDIO_PIO1_3                      */
#define IOCON_SWDIO_PIO1_3_MODE_MASK             (0x18U)                                             /*!< IOCON_SWDIO_PIO1_3: MODE Mask           */
#define IOCON_SWDIO_PIO1_3_MODE_SHIFT            (3U)                                                /*!< IOCON_SWDIO_PIO1_3: MODE Position       */
#define IOCON_SWDIO_PIO1_3_MODE(x)               (((uint32_t)(((uint32_t)(x))<<IOCON_SWDIO_PIO1_3_MODE_SHIFT))&IOCON_SWDIO_PIO1_3_MODE_MASK) /*!< IOCON_SWDIO_PIO1_3                      */
#define IOCON_SWDIO_PIO1_3_HYS_MASK              (0x20U)                                             /*!< IOCON_SWDIO_PIO1_3: HYS Mask            */
#define IOCON_SWDIO_PIO1_3_HYS_SHIFT             (5U)                                                /*!< IOCON_SWDIO_PIO1_3: HYS Position        */
#define IOCON_SWDIO_PIO1_3_HYS(x)                (((uint32_t)(((uint32_t)(x))<<IOCON_SWDIO_PIO1_3_HYS_SHIFT))&IOCON_SWDIO_PIO1_3_HYS_MASK) /*!< IOCON_SWDIO_PIO1_3                      */
#define IOCON_SWDIO_PIO1_3_ADMODE_MASK           (0x80U)                                             /*!< IOCON_SWDIO_PIO1_3: ADMODE Mask         */
#define IOCON_SWDIO_PIO1_3_ADMODE_SHIFT          (7U)                                                /*!< IOCON_SWDIO_PIO1_3: ADMODE Position     */
#define IOCON_SWDIO_PIO1_3_ADMODE(x)             (((uint32_t)(((uint32_t)(x))<<IOCON_SWDIO_PIO1_3_ADMODE_SHIFT))&IOCON_SWDIO_PIO1_3_ADMODE_MASK) /*!< IOCON_SWDIO_PIO1_3                      */
#define IOCON_SWDIO_PIO1_3_OD_MASK               (0x400U)                                            /*!< IOCON_SWDIO_PIO1_3: OD Mask             */
#define IOCON_SWDIO_PIO1_3_OD_SHIFT              (10U)                                               /*!< IOCON_SWDIO_PIO1_3: OD Position         */
#define IOCON_SWDIO_PIO1_3_OD(x)                 (((uint32_t)(((uint32_t)(x))<<IOCON_SWDIO_PIO1_3_OD_SHIFT))&IOCON_SWDIO_PIO1_3_OD_MASK) /*!< IOCON_SWDIO_PIO1_3                      */
/* ------- PIO1_4 Bit Fields                        ------ */
#define IOCON_PIO1_4_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO1_4: FUNC Mask                 */
#define IOCON_PIO1_4_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO1_4: FUNC Position             */
#define IOCON_PIO1_4_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_4_FUNC_SHIFT))&IOCON_PIO1_4_FUNC_MASK) /*!< IOCON_PIO1_4                            */
#define IOCON_PIO1_4_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO1_4: MODE Mask                 */
#define IOCON_PIO1_4_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO1_4: MODE Position             */
#define IOCON_PIO1_4_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_4_MODE_SHIFT))&IOCON_PIO1_4_MODE_MASK) /*!< IOCON_PIO1_4                            */
#define IOCON_PIO1_4_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO1_4: HYS Mask                  */
#define IOCON_PIO1_4_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO1_4: HYS Position              */
#define IOCON_PIO1_4_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_4_HYS_SHIFT))&IOCON_PIO1_4_HYS_MASK) /*!< IOCON_PIO1_4                            */
#define IOCON_PIO1_4_ADMODE_MASK                 (0x80U)                                             /*!< IOCON_PIO1_4: ADMODE Mask               */
#define IOCON_PIO1_4_ADMODE_SHIFT                (7U)                                                /*!< IOCON_PIO1_4: ADMODE Position           */
#define IOCON_PIO1_4_ADMODE(x)                   (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_4_ADMODE_SHIFT))&IOCON_PIO1_4_ADMODE_MASK) /*!< IOCON_PIO1_4                            */
#define IOCON_PIO1_4_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO1_4: OD Mask                   */
#define IOCON_PIO1_4_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO1_4: OD Position               */
#define IOCON_PIO1_4_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_4_OD_SHIFT))&IOCON_PIO1_4_OD_MASK) /*!< IOCON_PIO1_4                            */
/* ------- PIO1_11 Bit Fields                       ------ */
#define IOCON_PIO1_11_FUNC_MASK                  (0x7U)                                              /*!< IOCON_PIO1_11: FUNC Mask                */
#define IOCON_PIO1_11_FUNC_SHIFT                 (0U)                                                /*!< IOCON_PIO1_11: FUNC Position            */
#define IOCON_PIO1_11_FUNC(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_11_FUNC_SHIFT))&IOCON_PIO1_11_FUNC_MASK) /*!< IOCON_PIO1_11                           */
#define IOCON_PIO1_11_MODE_MASK                  (0x18U)                                             /*!< IOCON_PIO1_11: MODE Mask                */
#define IOCON_PIO1_11_MODE_SHIFT                 (3U)                                                /*!< IOCON_PIO1_11: MODE Position            */
#define IOCON_PIO1_11_MODE(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_11_MODE_SHIFT))&IOCON_PIO1_11_MODE_MASK) /*!< IOCON_PIO1_11                           */
#define IOCON_PIO1_11_HYS_MASK                   (0x20U)                                             /*!< IOCON_PIO1_11: HYS Mask                 */
#define IOCON_PIO1_11_HYS_SHIFT                  (5U)                                                /*!< IOCON_PIO1_11: HYS Position             */
#define IOCON_PIO1_11_HYS(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_11_HYS_SHIFT))&IOCON_PIO1_11_HYS_MASK) /*!< IOCON_PIO1_11                           */
#define IOCON_PIO1_11_ADMODE_MASK                (0x80U)                                             /*!< IOCON_PIO1_11: ADMODE Mask              */
#define IOCON_PIO1_11_ADMODE_SHIFT               (7U)                                                /*!< IOCON_PIO1_11: ADMODE Position          */
#define IOCON_PIO1_11_ADMODE(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_11_ADMODE_SHIFT))&IOCON_PIO1_11_ADMODE_MASK) /*!< IOCON_PIO1_11                           */
#define IOCON_PIO1_11_OD_MASK                    (0x400U)                                            /*!< IOCON_PIO1_11: OD Mask                  */
#define IOCON_PIO1_11_OD_SHIFT                   (10U)                                               /*!< IOCON_PIO1_11: OD Position              */
#define IOCON_PIO1_11_OD(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_11_OD_SHIFT))&IOCON_PIO1_11_OD_MASK) /*!< IOCON_PIO1_11                           */
/* ------- PIO3_2 Bit Fields                        ------ */
#define IOCON_PIO3_2_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO3_2: FUNC Mask                 */
#define IOCON_PIO3_2_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO3_2: FUNC Position             */
