podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define IOCON_PIO3_2_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_2_FUNC_SHIFT))&IOCON_PIO3_2_FUNC_MASK) /*!< IOCON_PIO3_2                            */
#define IOCON_PIO3_2_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO3_2: MODE Mask                 */
#define IOCON_PIO3_2_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO3_2: MODE Position             */
#define IOCON_PIO3_2_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_2_MODE_SHIFT))&IOCON_PIO3_2_MODE_MASK) /*!< IOCON_PIO3_2                            */
#define IOCON_PIO3_2_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO3_2: HYS Mask                  */
#define IOCON_PIO3_2_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO3_2: HYS Position              */
#define IOCON_PIO3_2_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_2_HYS_SHIFT))&IOCON_PIO3_2_HYS_MASK) /*!< IOCON_PIO3_2                            */
#define IOCON_PIO3_2_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO3_2: OD Mask                   */
#define IOCON_PIO3_2_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO3_2: OD Position               */
#define IOCON_PIO3_2_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_2_OD_SHIFT))&IOCON_PIO3_2_OD_MASK) /*!< IOCON_PIO3_2                            */
/* ------- PIO1_5 Bit Fields                        ------ */
#define IOCON_PIO1_5_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO1_5: FUNC Mask                 */
#define IOCON_PIO1_5_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO1_5: FUNC Position             */
#define IOCON_PIO1_5_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_5_FUNC_SHIFT))&IOCON_PIO1_5_FUNC_MASK) /*!< IOCON_PIO1_5                            */
#define IOCON_PIO1_5_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO1_5: MODE Mask                 */
#define IOCON_PIO1_5_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO1_5: MODE Position             */
#define IOCON_PIO1_5_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_5_MODE_SHIFT))&IOCON_PIO1_5_MODE_MASK) /*!< IOCON_PIO1_5                            */
#define IOCON_PIO1_5_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO1_5: HYS Mask                  */
#define IOCON_PIO1_5_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO1_5: HYS Position              */
#define IOCON_PIO1_5_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_5_HYS_SHIFT))&IOCON_PIO1_5_HYS_MASK) /*!< IOCON_PIO1_5                            */
#define IOCON_PIO1_5_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO1_5: OD Mask                   */
#define IOCON_PIO1_5_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO1_5: OD Position               */
#define IOCON_PIO1_5_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_5_OD_SHIFT))&IOCON_PIO1_5_OD_MASK) /*!< IOCON_PIO1_5                            */
/* ------- PIO1_6 Bit Fields                        ------ */
#define IOCON_PIO1_6_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO1_6: FUNC Mask                 */
#define IOCON_PIO1_6_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO1_6: FUNC Position             */
#define IOCON_PIO1_6_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_6_FUNC_SHIFT))&IOCON_PIO1_6_FUNC_MASK) /*!< IOCON_PIO1_6                            */
#define IOCON_PIO1_6_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO1_6: MODE Mask                 */
#define IOCON_PIO1_6_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO1_6: MODE Position             */
#define IOCON_PIO1_6_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_6_MODE_SHIFT))&IOCON_PIO1_6_MODE_MASK) /*!< IOCON_PIO1_6                            */
#define IOCON_PIO1_6_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO1_6: HYS Mask                  */
#define IOCON_PIO1_6_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO1_6: HYS Position              */
#define IOCON_PIO1_6_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_6_HYS_SHIFT))&IOCON_PIO1_6_HYS_MASK) /*!< IOCON_PIO1_6                            */
#define IOCON_PIO1_6_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO1_6: OD Mask                   */
#define IOCON_PIO1_6_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO1_6: OD Position               */
#define IOCON_PIO1_6_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_6_OD_SHIFT))&IOCON_PIO1_6_OD_MASK) /*!< IOCON_PIO1_6                            */
/* ------- PIO1_7 Bit Fields                        ------ */
#define IOCON_PIO1_7_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO1_7: FUNC Mask                 */
#define IOCON_PIO1_7_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO1_7: FUNC Position             */
#define IOCON_PIO1_7_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_7_FUNC_SHIFT))&IOCON_PIO1_7_FUNC_MASK) /*!< IOCON_PIO1_7                            */
#define IOCON_PIO1_7_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO1_7: MODE Mask                 */
#define IOCON_PIO1_7_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO1_7: MODE Position             */
#define IOCON_PIO1_7_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_7_MODE_SHIFT))&IOCON_PIO1_7_MODE_MASK) /*!< IOCON_PIO1_7                            */
#define IOCON_PIO1_7_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO1_7: HYS Mask                  */
#define IOCON_PIO1_7_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO1_7: HYS Position              */
#define IOCON_PIO1_7_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_7_HYS_SHIFT))&IOCON_PIO1_7_HYS_MASK) /*!< IOCON_PIO1_7                            */
#define IOCON_PIO1_7_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO1_7: OD Mask                   */
#define IOCON_PIO1_7_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO1_7: OD Position               */
#define IOCON_PIO1_7_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO1_7_OD_SHIFT))&IOCON_PIO1_7_OD_MASK) /*!< IOCON_PIO1_7                            */
/* ------- PIO3_3 Bit Fields                        ------ */
#define IOCON_PIO3_3_FUNC_MASK                   (0x7U)                                              /*!< IOCON_PIO3_3: FUNC Mask                 */
#define IOCON_PIO3_3_FUNC_SHIFT                  (0U)                                                /*!< IOCON_PIO3_3: FUNC Position             */
#define IOCON_PIO3_3_FUNC(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_3_FUNC_SHIFT))&IOCON_PIO3_3_FUNC_MASK) /*!< IOCON_PIO3_3                            */
#define IOCON_PIO3_3_MODE_MASK                   (0x18U)                                             /*!< IOCON_PIO3_3: MODE Mask                 */
#define IOCON_PIO3_3_MODE_SHIFT                  (3U)                                                /*!< IOCON_PIO3_3: MODE Position             */
#define IOCON_PIO3_3_MODE(x)                     (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_3_MODE_SHIFT))&IOCON_PIO3_3_MODE_MASK) /*!< IOCON_PIO3_3                            */
#define IOCON_PIO3_3_HYS_MASK                    (0x20U)                                             /*!< IOCON_PIO3_3: HYS Mask                  */
#define IOCON_PIO3_3_HYS_SHIFT                   (5U)                                                /*!< IOCON_PIO3_3: HYS Position              */
#define IOCON_PIO3_3_HYS(x)                      (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_3_HYS_SHIFT))&IOCON_PIO3_3_HYS_MASK) /*!< IOCON_PIO3_3                            */
#define IOCON_PIO3_3_OD_MASK                     (0x400U)                                            /*!< IOCON_PIO3_3: OD Mask                   */
#define IOCON_PIO3_3_OD_SHIFT                    (10U)                                               /*!< IOCON_PIO3_3: OD Position               */
#define IOCON_PIO3_3_OD(x)                       (((uint32_t)(((uint32_t)(x))<<IOCON_PIO3_3_OD_SHIFT))&IOCON_PIO3_3_OD_MASK) /*!< IOCON_PIO3_3                            */
/* ------- SCK0_LOC Bit Fields                      ------ */
#define IOCON_SCK0_LOC_SCKLOC_MASK               (0x3U)                                              /*!< IOCON_SCK0_LOC: SCKLOC Mask             */
#define IOCON_SCK0_LOC_SCKLOC_SHIFT              (0U)                                                /*!< IOCON_SCK0_LOC: SCKLOC Position         */
#define IOCON_SCK0_LOC_SCKLOC(x)                 (((uint32_t)(((uint32_t)(x))<<IOCON_SCK0_LOC_SCKLOC_SHIFT))&IOCON_SCK0_LOC_SCKLOC_MASK) /*!< IOCON_SCK0_LOC                          */
/* ------- DSR_LOC Bit Fields                       ------ */
#define IOCON_DSR_LOC_DSRLOC_MASK                (0x3U)                                              /*!< IOCON_DSR_LOC: DSRLOC Mask              */
#define IOCON_DSR_LOC_DSRLOC_SHIFT               (0U)                                                /*!< IOCON_DSR_LOC: DSRLOC Position          */
#define IOCON_DSR_LOC_DSRLOC(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_DSR_LOC_DSRLOC_SHIFT))&IOCON_DSR_LOC_DSRLOC_MASK) /*!< IOCON_DSR_LOC                           */
/* ------- DCD_LOC Bit Fields                       ------ */
#define IOCON_DCD_LOC_DCDLOC_MASK                (0x3U)                                              /*!< IOCON_DCD_LOC: DCDLOC Mask              */
#define IOCON_DCD_LOC_DCDLOC_SHIFT               (0U)                                                /*!< IOCON_DCD_LOC: DCDLOC Position          */
#define IOCON_DCD_LOC_DCDLOC(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_DCD_LOC_DCDLOC_SHIFT))&IOCON_DCD_LOC_DCDLOC_MASK) /*!< IOCON_DCD_LOC                           */
/* ------- RI_LOC Bit Fields                        ------ */
#define IOCON_RI_LOC_RILOC_MASK                  (0x3U)                                              /*!< IOCON_RI_LOC: RILOC Mask                */
#define IOCON_RI_LOC_RILOC_SHIFT                 (0U)                                                /*!< IOCON_RI_LOC: RILOC Position            */
#define IOCON_RI_LOC_RILOC(x)                    (((uint32_t)(((uint32_t)(x))<<IOCON_RI_LOC_RILOC_SHIFT))&IOCON_RI_LOC_RILOC_MASK) /*!< IOCON_RI_LOC                            */
/* ------- SCK1_LOC Bit Fields                      ------ */
#define IOCON_SCK1_LOC_SCK1LOC_MASK              (0x3U)                                              /*!< IOCON_SCK1_LOC: SCK1LOC Mask            */
#define IOCON_SCK1_LOC_SCK1LOC_SHIFT             (0U)                                                /*!< IOCON_SCK1_LOC: SCK1LOC Position        */
#define IOCON_SCK1_LOC_SCK1LOC(x)                (((uint32_t)(((uint32_t)(x))<<IOCON_SCK1_LOC_SCK1LOC_SHIFT))&IOCON_SCK1_LOC_SCK1LOC_MASK) /*!< IOCON_SCK1_LOC                          */
/* ------- MISO1_LOC Bit Fields                     ------ */
#define IOCON_MISO1_LOC_MISO1LOC_MASK            (0x3U)                                              /*!< IOCON_MISO1_LOC: MISO1LOC Mask          */
#define IOCON_MISO1_LOC_MISO1LOC_SHIFT           (0U)                                                /*!< IOCON_MISO1_LOC: MISO1LOC Position      */
#define IOCON_MISO1_LOC_MISO1LOC(x)              (((uint32_t)(((uint32_t)(x))<<IOCON_MISO1_LOC_MISO1LOC_SHIFT))&IOCON_MISO1_LOC_MISO1LOC_MASK) /*!< IOCON_MISO1_LOC                         */
/* ------- MOSI1_LOC Bit Fields                     ------ */
#define IOCON_MOSI1_LOC_MOSI1LOC_MASK            (0x3U)                                              /*!< IOCON_MOSI1_LOC: MOSI1LOC Mask          */
#define IOCON_MOSI1_LOC_MOSI1LOC_SHIFT           (0U)                                                /*!< IOCON_MOSI1_LOC: MOSI1LOC Position      */
#define IOCON_MOSI1_LOC_MOSI1LOC(x)              (((uint32_t)(((uint32_t)(x))<<IOCON_MOSI1_LOC_MOSI1LOC_SHIFT))&IOCON_MOSI1_LOC_MOSI1LOC_MASK) /*!< IOCON_MOSI1_LOC                         */
/* ------- RXD_LOC Bit Fields                       ------ */
#define IOCON_RXD_LOC_RXDLOC_MASK                (0x3U)                                              /*!< IOCON_RXD_LOC: RXDLOC Mask              */
#define IOCON_RXD_LOC_RXDLOC_SHIFT               (0U)                                                /*!< IOCON_RXD_LOC: RXDLOC Position          */
#define IOCON_RXD_LOC_RXDLOC(x)                  (((uint32_t)(((uint32_t)(x))<<IOCON_RXD_LOC_RXDLOC_SHIFT))&IOCON_RXD_LOC_RXDLOC_MASK) /*!< IOCON_RXD_LOC                           */
/**
 * @} */ /* End group IOCON_Register_Masks_GROUP 
 */

/* IOCON - Peripheral instance base addresses */
#define IOCON_BasePtr                  0x40044000UL //!< Peripheral base address
#define IOCON                          ((IOCON_Type *) IOCON_BasePtr) //!< Freescale base pointer
#define IOCON_BASE_PTR                 (IOCON) //!< Freescale style base pointer
/**
 * @} */ /* End group IOCON_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup PMU_Peripheral_access_layer_GROUP PMU Peripheral Access Layer
* @brief C Struct for PMU
* @{
*/

/* ================================================================================ */
/* ================           PMU (file:PMU_LPC11Cxx)              ================ */
/* ================================================================================ */

/**
 * @brief Power management unit
 */
/**
* @addtogroup PMU_structs_GROUP PMU struct
* @brief Struct for PMU
* @{
*/
typedef struct {                                /*       PMU Structure                                                */
   __IO uint32_t  PCON;                         /**< 0000: Power control register                                       */
   __IO uint32_t  GPREG[4];                     /**< 0004: General purpose register                                     */
   __IO uint32_t  GPREG4;                       /**< 0014: General purpose register 4                                   */
} PMU_Type;

/**
 * @} */ /* End group PMU_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'PMU' Position & Mask macros                         ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup PMU_Register_Masks_GROUP PMU Register Masks
* @brief Register Masks for PMU
* @{
*/
/* ------- PCON Bit Fields                          ------ */
#define PMU_PCON_DPDEN_MASK                      (0x2U)                                              /*!< PMU_PCON: DPDEN Mask                    */
#define PMU_PCON_DPDEN_SHIFT                     (1U)                                                /*!< PMU_PCON: DPDEN Position                */
#define PMU_PCON_DPDEN(x)                        (((uint32_t)(((uint32_t)(x))<<PMU_PCON_DPDEN_SHIFT))&PMU_PCON_DPDEN_MASK) /*!< PMU_PCON                                */
#define PMU_PCON_SLEEPFLAG_MASK                  (0x100U)                                            /*!< PMU_PCON: SLEEPFLAG Mask                */
#define PMU_PCON_SLEEPFLAG_SHIFT                 (8U)                                                /*!< PMU_PCON: SLEEPFLAG Position            */
#define PMU_PCON_SLEEPFLAG(x)                    (((uint32_t)(((uint32_t)(x))<<PMU_PCON_SLEEPFLAG_SHIFT))&PMU_PCON_SLEEPFLAG_MASK) /*!< PMU_PCON                                */
#define PMU_PCON_DPDFLAG_MASK                    (0x800U)                                            /*!< PMU_PCON: DPDFLAG Mask                  */
#define PMU_PCON_DPDFLAG_SHIFT                   (11U)                                               /*!< PMU_PCON: DPDFLAG Position              */
#define PMU_PCON_DPDFLAG(x)                      (((uint32_t)(((uint32_t)(x))<<PMU_PCON_DPDFLAG_SHIFT))&PMU_PCON_DPDFLAG_MASK) /*!< PMU_PCON                                */
/* ------- GPREG Bit Fields                         ------ */
#define PMU_GPREG_GPDATA_MASK                    (0xFFFFFFFFU)                                       /*!< PMU_GPREG: GPDATA Mask                  */
#define PMU_GPREG_GPDATA_SHIFT                   (0U)                                                /*!< PMU_GPREG: GPDATA Position              */
#define PMU_GPREG_GPDATA(x)                      (((uint32_t)(((uint32_t)(x))<<PMU_GPREG_GPDATA_SHIFT))&PMU_GPREG_GPDATA_MASK) /*!< PMU_GPREG                               */
/* ------- GPREG4 Bit Fields                        ------ */
#define PMU_GPREG4_WAKEUPHYS_MASK                (0x400U)                                            /*!< PMU_GPREG4: WAKEUPHYS Mask              */
#define PMU_GPREG4_WAKEUPHYS_SHIFT               (10U)                                               /*!< PMU_GPREG4: WAKEUPHYS Position          */
#define PMU_GPREG4_WAKEUPHYS(x)                  (((uint32_t)(((uint32_t)(x))<<PMU_GPREG4_WAKEUPHYS_SHIFT))&PMU_GPREG4_WAKEUPHYS_MASK) /*!< PMU_GPREG4                              */
#define PMU_GPREG4_GPDATA_MASK                   (0xFFFFF800U)                                       /*!< PMU_GPREG4: GPDATA Mask                 */
#define PMU_GPREG4_GPDATA_SHIFT                  (11U)                                               /*!< PMU_GPREG4: GPDATA Position             */
#define PMU_GPREG4_GPDATA(x)                     (((uint32_t)(((uint32_t)(x))<<PMU_GPREG4_GPDATA_SHIFT))&PMU_GPREG4_GPDATA_MASK) /*!< PMU_GPREG4                              */
/**
 * @} */ /* End group PMU_Register_Masks_GROUP 
 */

/* PMU - Peripheral instance base addresses */
#define PMU_BasePtr                    0x40038000UL //!< Peripheral base address
#define PMU                            ((PMU_Type *) PMU_BasePtr) //!< Freescale base pointer
#define PMU_BASE_PTR                   (PMU) //!< Freescale style base pointer
/**
 * @} */ /* End group PMU_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SPI_Peripheral_access_layer_GROUP SPI Peripheral Access Layer
* @brief C Struct for SPI
* @{
*/

/* ================================================================================ */
/* ================           SPI0 (file:SPI0_LPC11Cxx)            ================ */
/* ================================================================================ */

/**
 * @brief SPI0
 */
/**
* @addtogroup SPI_structs_GROUP SPI struct
* @brief Struct for SPI
* @{
*/
typedef struct {                                /*       SPI0 Structure                                               */
   __IO uint32_t  CR0;                          /**< 0000: Control Register 0. Selects the serial clock rate, bus type, and data size */
   __IO uint32_t  CR1;                          /**< 0004: Control Register 1. Selects master/slave and other modes     */
   __IO uint32_t  DR;                           /**< 0008: Data Register. Writes fill the transmit FIFO, and reads empty the receive FIFO */
   __I  uint32_t  SR;                           /**< 000C: Status Register                                              */
   __IO uint32_t  CPSR;                         /**< 0010: Clock Prescale Register                                      */
   __IO uint32_t  IMSC;                         /**< 0014: Interrupt Mask Set and Clear Register                        */
   __I  uint32_t  RIS;                          /**< 0018: Raw Interrupt Status Register                                */
   __I  uint32_t  MIS;                          /**< 001C: Masked Interrupt Status Register                             */
   __O  uint32_t  ICR;                          /**< 0020: SSPICR Interrupt Clear Register                              */
} SPI0_Type;

/**
 * @} */ /* End group SPI_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SPI0' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

