podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup SPI_Register_Masks_GROUP SPI Register Masks
* @brief Register Masks for SPI
* @{
*/
/* ------- CR0 Bit Fields                           ------ */
#define SPI_CR0_DSS_MASK                         (0xFU)                                              /*!< SPI0_CR0: DSS Mask                      */
#define SPI_CR0_DSS_SHIFT                        (0U)                                                /*!< SPI0_CR0: DSS Position                  */
#define SPI_CR0_DSS(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CR0_DSS_SHIFT))&SPI_CR0_DSS_MASK) /*!< SPI0_CR0                                */
#define SPI_CR0_FRF_MASK                         (0x30U)                                             /*!< SPI0_CR0: FRF Mask                      */
#define SPI_CR0_FRF_SHIFT                        (4U)                                                /*!< SPI0_CR0: FRF Position                  */
#define SPI_CR0_FRF(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CR0_FRF_SHIFT))&SPI_CR0_FRF_MASK) /*!< SPI0_CR0                                */
#define SPI_CR0_CPOL_MASK                        (0x40U)                                             /*!< SPI0_CR0: CPOL Mask                     */
#define SPI_CR0_CPOL_SHIFT                       (6U)                                                /*!< SPI0_CR0: CPOL Position                 */
#define SPI_CR0_CPOL(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_CR0_CPOL_SHIFT))&SPI_CR0_CPOL_MASK) /*!< SPI0_CR0                                */
#define SPI_CR0_CPHA_MASK                        (0x80U)                                             /*!< SPI0_CR0: CPHA Mask                     */
#define SPI_CR0_CPHA_SHIFT                       (7U)                                                /*!< SPI0_CR0: CPHA Position                 */
#define SPI_CR0_CPHA(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_CR0_CPHA_SHIFT))&SPI_CR0_CPHA_MASK) /*!< SPI0_CR0                                */
#define SPI_CR0_SCR_MASK                         (0xFF00U)                                           /*!< SPI0_CR0: SCR Mask                      */
#define SPI_CR0_SCR_SHIFT                        (8U)                                                /*!< SPI0_CR0: SCR Position                  */
#define SPI_CR0_SCR(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CR0_SCR_SHIFT))&SPI_CR0_SCR_MASK) /*!< SPI0_CR0                                */
/* ------- CR1 Bit Fields                           ------ */
#define SPI_CR1_LBM_MASK                         (0x1U)                                              /*!< SPI0_CR1: LBM Mask                      */
#define SPI_CR1_LBM_SHIFT                        (0U)                                                /*!< SPI0_CR1: LBM Position                  */
#define SPI_CR1_LBM(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CR1_LBM_SHIFT))&SPI_CR1_LBM_MASK) /*!< SPI0_CR1                                */
#define SPI_CR1_SSE_MASK                         (0x2U)                                              /*!< SPI0_CR1: SSE Mask                      */
#define SPI_CR1_SSE_SHIFT                        (1U)                                                /*!< SPI0_CR1: SSE Position                  */
#define SPI_CR1_SSE(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CR1_SSE_SHIFT))&SPI_CR1_SSE_MASK) /*!< SPI0_CR1                                */
#define SPI_CR1_MS_MASK                          (0x4U)                                              /*!< SPI0_CR1: MS Mask                       */
#define SPI_CR1_MS_SHIFT                         (2U)                                                /*!< SPI0_CR1: MS Position                   */
#define SPI_CR1_MS(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_CR1_MS_SHIFT))&SPI_CR1_MS_MASK) /*!< SPI0_CR1                                */
#define SPI_CR1_SOD_MASK                         (0x8U)                                              /*!< SPI0_CR1: SOD Mask                      */
#define SPI_CR1_SOD_SHIFT                        (3U)                                                /*!< SPI0_CR1: SOD Position                  */
#define SPI_CR1_SOD(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_CR1_SOD_SHIFT))&SPI_CR1_SOD_MASK) /*!< SPI0_CR1                                */
/* ------- DR Bit Fields                            ------ */
#define SPI_DR_DATA_MASK                         (0xFFFFU)                                           /*!< SPI0_DR: DATA Mask                      */
#define SPI_DR_DATA_SHIFT                        (0U)                                                /*!< SPI0_DR: DATA Position                  */
#define SPI_DR_DATA(x)                           (((uint32_t)(((uint32_t)(x))<<SPI_DR_DATA_SHIFT))&SPI_DR_DATA_MASK) /*!< SPI0_DR                                 */
/* ------- SR Bit Fields                            ------ */
#define SPI_SR_TFE_MASK                          (0x1U)                                              /*!< SPI0_SR: TFE Mask                       */
#define SPI_SR_TFE_SHIFT                         (0U)                                                /*!< SPI0_SR: TFE Position                   */
#define SPI_SR_TFE(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_SR_TFE_SHIFT))&SPI_SR_TFE_MASK) /*!< SPI0_SR                                 */
#define SPI_SR_TNF_MASK                          (0x2U)                                              /*!< SPI0_SR: TNF Mask                       */
#define SPI_SR_TNF_SHIFT                         (1U)                                                /*!< SPI0_SR: TNF Position                   */
#define SPI_SR_TNF(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_SR_TNF_SHIFT))&SPI_SR_TNF_MASK) /*!< SPI0_SR                                 */
#define SPI_SR_RNE_MASK                          (0x4U)                                              /*!< SPI0_SR: RNE Mask                       */
#define SPI_SR_RNE_SHIFT                         (2U)                                                /*!< SPI0_SR: RNE Position                   */
#define SPI_SR_RNE(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_SR_RNE_SHIFT))&SPI_SR_RNE_MASK) /*!< SPI0_SR                                 */
#define SPI_SR_RFF_MASK                          (0x8U)                                              /*!< SPI0_SR: RFF Mask                       */
#define SPI_SR_RFF_SHIFT                         (3U)                                                /*!< SPI0_SR: RFF Position                   */
#define SPI_SR_RFF(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_SR_RFF_SHIFT))&SPI_SR_RFF_MASK) /*!< SPI0_SR                                 */
#define SPI_SR_BSY_MASK                          (0x10U)                                             /*!< SPI0_SR: BSY Mask                       */
#define SPI_SR_BSY_SHIFT                         (4U)                                                /*!< SPI0_SR: BSY Position                   */
#define SPI_SR_BSY(x)                            (((uint32_t)(((uint32_t)(x))<<SPI_SR_BSY_SHIFT))&SPI_SR_BSY_MASK) /*!< SPI0_SR                                 */
/* ------- CPSR Bit Fields                          ------ */
#define SPI_CPSR_CPSDVSR_MASK                    (0xFFU)                                             /*!< SPI0_CPSR: CPSDVSR Mask                 */
#define SPI_CPSR_CPSDVSR_SHIFT                   (0U)                                                /*!< SPI0_CPSR: CPSDVSR Position             */
#define SPI_CPSR_CPSDVSR(x)                      (((uint32_t)(((uint32_t)(x))<<SPI_CPSR_CPSDVSR_SHIFT))&SPI_CPSR_CPSDVSR_MASK) /*!< SPI0_CPSR                               */
/* ------- IMSC Bit Fields                          ------ */
#define SPI_IMSC_RORIM_MASK                      (0x1U)                                              /*!< SPI0_IMSC: RORIM Mask                   */
#define SPI_IMSC_RORIM_SHIFT                     (0U)                                                /*!< SPI0_IMSC: RORIM Position               */
#define SPI_IMSC_RORIM(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_IMSC_RORIM_SHIFT))&SPI_IMSC_RORIM_MASK) /*!< SPI0_IMSC                               */
#define SPI_IMSC_RTIM_MASK                       (0x2U)                                              /*!< SPI0_IMSC: RTIM Mask                    */
#define SPI_IMSC_RTIM_SHIFT                      (1U)                                                /*!< SPI0_IMSC: RTIM Position                */
#define SPI_IMSC_RTIM(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_IMSC_RTIM_SHIFT))&SPI_IMSC_RTIM_MASK) /*!< SPI0_IMSC                               */
#define SPI_IMSC_RXIM_MASK                       (0x4U)                                              /*!< SPI0_IMSC: RXIM Mask                    */
#define SPI_IMSC_RXIM_SHIFT                      (2U)                                                /*!< SPI0_IMSC: RXIM Position                */
#define SPI_IMSC_RXIM(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_IMSC_RXIM_SHIFT))&SPI_IMSC_RXIM_MASK) /*!< SPI0_IMSC                               */
#define SPI_IMSC_TXIM_MASK                       (0x8U)                                              /*!< SPI0_IMSC: TXIM Mask                    */
#define SPI_IMSC_TXIM_SHIFT                      (3U)                                                /*!< SPI0_IMSC: TXIM Position                */
#define SPI_IMSC_TXIM(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_IMSC_TXIM_SHIFT))&SPI_IMSC_TXIM_MASK) /*!< SPI0_IMSC                               */
/* ------- RIS Bit Fields                           ------ */
#define SPI_RIS_RORRIS_MASK                      (0x1U)                                              /*!< SPI0_RIS: RORRIS Mask                   */
#define SPI_RIS_RORRIS_SHIFT                     (0U)                                                /*!< SPI0_RIS: RORRIS Position               */
#define SPI_RIS_RORRIS(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_RIS_RORRIS_SHIFT))&SPI_RIS_RORRIS_MASK) /*!< SPI0_RIS                                */
#define SPI_RIS_RTRIS_MASK                       (0x2U)                                              /*!< SPI0_RIS: RTRIS Mask                    */
#define SPI_RIS_RTRIS_SHIFT                      (1U)                                                /*!< SPI0_RIS: RTRIS Position                */
#define SPI_RIS_RTRIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_RIS_RTRIS_SHIFT))&SPI_RIS_RTRIS_MASK) /*!< SPI0_RIS                                */
#define SPI_RIS_RXRIS_MASK                       (0x4U)                                              /*!< SPI0_RIS: RXRIS Mask                    */
#define SPI_RIS_RXRIS_SHIFT                      (2U)                                                /*!< SPI0_RIS: RXRIS Position                */
#define SPI_RIS_RXRIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_RIS_RXRIS_SHIFT))&SPI_RIS_RXRIS_MASK) /*!< SPI0_RIS                                */
#define SPI_RIS_TXRIS_MASK                       (0x8U)                                              /*!< SPI0_RIS: TXRIS Mask                    */
#define SPI_RIS_TXRIS_SHIFT                      (3U)                                                /*!< SPI0_RIS: TXRIS Position                */
#define SPI_RIS_TXRIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_RIS_TXRIS_SHIFT))&SPI_RIS_TXRIS_MASK) /*!< SPI0_RIS                                */
/* ------- MIS Bit Fields                           ------ */
#define SPI_MIS_RORMIS_MASK                      (0x1U)                                              /*!< SPI0_MIS: RORMIS Mask                   */
#define SPI_MIS_RORMIS_SHIFT                     (0U)                                                /*!< SPI0_MIS: RORMIS Position               */
#define SPI_MIS_RORMIS(x)                        (((uint32_t)(((uint32_t)(x))<<SPI_MIS_RORMIS_SHIFT))&SPI_MIS_RORMIS_MASK) /*!< SPI0_MIS                                */
#define SPI_MIS_RTMIS_MASK                       (0x2U)                                              /*!< SPI0_MIS: RTMIS Mask                    */
#define SPI_MIS_RTMIS_SHIFT                      (1U)                                                /*!< SPI0_MIS: RTMIS Position                */
#define SPI_MIS_RTMIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_MIS_RTMIS_SHIFT))&SPI_MIS_RTMIS_MASK) /*!< SPI0_MIS                                */
#define SPI_MIS_RXMIS_MASK                       (0x4U)                                              /*!< SPI0_MIS: RXMIS Mask                    */
#define SPI_MIS_RXMIS_SHIFT                      (2U)                                                /*!< SPI0_MIS: RXMIS Position                */
#define SPI_MIS_RXMIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_MIS_RXMIS_SHIFT))&SPI_MIS_RXMIS_MASK) /*!< SPI0_MIS                                */
#define SPI_MIS_TXMIS_MASK                       (0x8U)                                              /*!< SPI0_MIS: TXMIS Mask                    */
#define SPI_MIS_TXMIS_SHIFT                      (3U)                                                /*!< SPI0_MIS: TXMIS Position                */
#define SPI_MIS_TXMIS(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_MIS_TXMIS_SHIFT))&SPI_MIS_TXMIS_MASK) /*!< SPI0_MIS                                */
/* ------- ICR Bit Fields                           ------ */
#define SPI_ICR_RORIC_MASK                       (0x1U)                                              /*!< SPI0_ICR: RORIC Mask                    */
#define SPI_ICR_RORIC_SHIFT                      (0U)                                                /*!< SPI0_ICR: RORIC Position                */
#define SPI_ICR_RORIC(x)                         (((uint32_t)(((uint32_t)(x))<<SPI_ICR_RORIC_SHIFT))&SPI_ICR_RORIC_MASK) /*!< SPI0_ICR                                */
#define SPI_ICR_RTIC_MASK                        (0x2U)                                              /*!< SPI0_ICR: RTIC Mask                     */
#define SPI_ICR_RTIC_SHIFT                       (1U)                                                /*!< SPI0_ICR: RTIC Position                 */
#define SPI_ICR_RTIC(x)                          (((uint32_t)(((uint32_t)(x))<<SPI_ICR_RTIC_SHIFT))&SPI_ICR_RTIC_MASK) /*!< SPI0_ICR                                */
/**
 * @} */ /* End group SPI_Register_Masks_GROUP 
 */

/* SPI0 - Peripheral instance base addresses */
#define SPI0_BasePtr                   0x40040000UL //!< Peripheral base address
#define SPI0                           ((SPI0_Type *) SPI0_BasePtr) //!< Freescale base pointer
#define SPI0_BASE_PTR                  (SPI0) //!< Freescale style base pointer
/**
 * @} */ /* End group SPI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SPI_Peripheral_access_layer_GROUP SPI Peripheral Access Layer
* @brief C Struct for SPI
* @{
*/

/* ================================================================================ */
/* ================           SPI1 (derived from SPI0)             ================ */
/* ================================================================================ */

/**
 * @brief SPI0
 */

/* SPI1 - Peripheral instance base addresses */
#define SPI1_BasePtr                   0x40058000UL //!< Peripheral base address
#define SPI1                           ((SPI0_Type *) SPI1_BasePtr) //!< Freescale base pointer
#define SPI1_BASE_PTR                  (SPI1) //!< Freescale style base pointer
/**
 * @} */ /* End group SPI_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup SYSCON_Peripheral_access_layer_GROUP SYSCON Peripheral Access Layer
* @brief C Struct for SYSCON
* @{
*/

/* ================================================================================ */
/* ================           SYSCON (file:SYSCON_LPC11Cxx)        ================ */
/* ================================================================================ */

/**
 * @brief System configuration
 */
/**
* @addtogroup SYSCON_structs_GROUP SYSCON struct
* @brief Struct for SYSCON
* @{
*/
typedef struct {                                /*       SYSCON Structure                                             */
   __IO uint32_t  SYSMEMREMAP;                  /**< 0000: System memory remap                                          */
   __IO uint32_t  PRESETCTRL;                   /**< 0004: Peripheral reset control                                     */
   __IO uint32_t  SYSPLLCTRL;                   /**< 0008: System PLL control                                           */
   __I  uint32_t  SYSPLLSTAT;                   /**< 000C: System PLL status                                            */
        uint8_t   RESERVED_0[16];              
   __IO uint32_t  SYSOSCCTRL;                   /**< 0020: System oscillator control                                    */
   __IO uint32_t  WDTOSCCTRL;                   /**< 0024: Watchdog oscillator control                                  */
   __IO uint32_t  IRCCTRL;                      /**< 0028: IRC control                                                  */
        uint8_t   RESERVED_1[4];               
   __I  uint32_t  SYSRSTSTAT;                   /**< 0030: System reset status register                                 */
        uint8_t   RESERVED_2[12];              
   __IO uint32_t  SYSPLLCLKSEL;                 /**< 0040: System PLL clock source select                               */
   __IO uint32_t  SYSPLLCLKUEN;                 /**< 0044: System PLL clock source update enable                        */
        uint8_t   RESERVED_3[40];              
   __IO uint32_t  MAINCLKSEL;                   /**< 0070: Main clock source select                                     */
   __IO uint32_t  MAINCLKUEN;                   /**< 0074: Main clock source update enable                              */
   __IO uint32_t  SYSAHBCLKDIV;                 /**< 0078: System AHB clock divider                                     */
        uint8_t   RESERVED_4[4];               
   __IO uint32_t  SYSAHBCLKCTRL;                /**< 0080: System AHB clock control                                     */
        uint8_t   RESERVED_5[16];              
   __IO uint32_t  SSP0CLKDIV;                   /**< 0094: SPI0 clock divider                                           */
   __IO uint32_t  UARTCLKDIV;                   /**< 0098: UART clock divder                                            */
   __IO uint32_t  SSP1CLKDIV;                   /**< 009C: SPI1 clock divder                                            */
        uint8_t   RESERVED_6[48];              
   __IO uint32_t  WDTCLKSEL;                    /**< 00D0: WDT clock source select                                      */
   __IO uint32_t  WDTCLKUEN;                    /**< 00D4: WDT clock source update enable                               */
   __IO uint32_t  WDTCLKDIV;                    /**< 00D8: WDT clock divider                                            */
        uint8_t   RESERVED_7[4];               
   __IO uint32_t  CLKOUTCLKSEL;                 /**< 00E0: CLKOUT clock source select                                   */
   __IO uint32_t  CLKOUTUEN;                    /**< 00E4: CLKOUT clock source update enable                            */
   __IO uint32_t  CLKOUTCLKDIV;                 /**< 00E8: CLKOUT clock divider                                         */
        uint8_t   RESERVED_8[20];              
   __I  uint32_t  PIOPORCAP0;                   /**< 0100: POR captured PIO status 0                                    */
   __I  uint32_t  PIOPORCAP1;                   /**< 0104: POR captured PIO status 1                                    */
        uint8_t   RESERVED_9[72];              
   __IO uint32_t  BODCTRL;                      /**< 0150: BOD control                                                  */
   __IO uint32_t  SYSTCKCAL;                    /**< 0154: System tick counter calibration                              */
        uint8_t   RESERVED_10[28];             
   __IO uint32_t  NMISRC;                       /**< 0174: NMI source selection                                         */
        uint8_t   RESERVED_11[136];            
   __IO uint32_t  STARTAPRP0;                   /**< 0200: Start logic edge control register 0                          */
   __IO uint32_t  STARTERP0;                    /**< 0204: Start logic signal enable register 0                         */
   __O  uint32_t  STARTRSRP0CLR;                /**< 0208: Start logic reset register 0                                 */
   __I  uint32_t  STARTSRP0;                    /**< 020C: Start logic status register 0                                */
        uint8_t   RESERVED_12[32];             
   __IO uint32_t  PDSLEEPCFG;                   /**< 0230: Power-down states in Deep-sleep mode                         */
   __IO uint32_t  PDAWAKECFG;                   /**< 0234: Power-down states after wake-up from Deep-sleep mode         */
   __IO uint32_t  PDRUNCFG;                     /**< 0238: Power-down configuration register                            */
        uint8_t   RESERVED_13[440];            
   __I  uint32_t  DEVICE_ID;                    /**< 03F4: Device ID register 0 for parts  LPC1100C                     */
} SYSCON_Type;

/**
 * @} */ /* End group SYSCON_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'SYSCON' Position & Mask macros                      ----------- */
/* -------------------------------------------------------------------------------- */

