podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup SYSCON_Register_Masks_GROUP SYSCON Register Masks
* @brief Register Masks for SYSCON
* @{
*/
/* ------- SYSMEMREMAP Bit Fields                   ------ */
#define SYSCON_SYSMEMREMAP_MAP_MASK              (0x3U)                                              /*!< SYSCON_SYSMEMREMAP: MAP Mask            */
#define SYSCON_SYSMEMREMAP_MAP_SHIFT             (0U)                                                /*!< SYSCON_SYSMEMREMAP: MAP Position        */
#define SYSCON_SYSMEMREMAP_MAP(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSMEMREMAP_MAP_SHIFT))&SYSCON_SYSMEMREMAP_MAP_MASK) /*!< SYSCON_SYSMEMREMAP                      */
/* ------- PRESETCTRL Bit Fields                    ------ */
#define SYSCON_PRESETCTRL_SSP0_RST_N_MASK        (0x1U)                                              /*!< SYSCON_PRESETCTRL: SSP0_RST_N Mask      */
#define SYSCON_PRESETCTRL_SSP0_RST_N_SHIFT       (0U)                                                /*!< SYSCON_PRESETCTRL: SSP0_RST_N Position  */
#define SYSCON_PRESETCTRL_SSP0_RST_N(x)          (((uint32_t)(((uint32_t)(x))<<SYSCON_PRESETCTRL_SSP0_RST_N_SHIFT))&SYSCON_PRESETCTRL_SSP0_RST_N_MASK) /*!< SYSCON_PRESETCTRL                       */
#define SYSCON_PRESETCTRL_I2C_RST_N_MASK         (0x2U)                                              /*!< SYSCON_PRESETCTRL: I2C_RST_N Mask       */
#define SYSCON_PRESETCTRL_I2C_RST_N_SHIFT        (1U)                                                /*!< SYSCON_PRESETCTRL: I2C_RST_N Position   */
#define SYSCON_PRESETCTRL_I2C_RST_N(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PRESETCTRL_I2C_RST_N_SHIFT))&SYSCON_PRESETCTRL_I2C_RST_N_MASK) /*!< SYSCON_PRESETCTRL                       */
#define SYSCON_PRESETCTRL_SSP1_RST_N_MASK        (0x4U)                                              /*!< SYSCON_PRESETCTRL: SSP1_RST_N Mask      */
#define SYSCON_PRESETCTRL_SSP1_RST_N_SHIFT       (2U)                                                /*!< SYSCON_PRESETCTRL: SSP1_RST_N Position  */
#define SYSCON_PRESETCTRL_SSP1_RST_N(x)          (((uint32_t)(((uint32_t)(x))<<SYSCON_PRESETCTRL_SSP1_RST_N_SHIFT))&SYSCON_PRESETCTRL_SSP1_RST_N_MASK) /*!< SYSCON_PRESETCTRL                       */
#define SYSCON_PRESETCTRL_CAN_RST_N_MASK         (0x8U)                                              /*!< SYSCON_PRESETCTRL: CAN_RST_N Mask       */
#define SYSCON_PRESETCTRL_CAN_RST_N_SHIFT        (3U)                                                /*!< SYSCON_PRESETCTRL: CAN_RST_N Position   */
#define SYSCON_PRESETCTRL_CAN_RST_N(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PRESETCTRL_CAN_RST_N_SHIFT))&SYSCON_PRESETCTRL_CAN_RST_N_MASK) /*!< SYSCON_PRESETCTRL                       */
/* ------- SYSPLLCTRL Bit Fields                    ------ */
#define SYSCON_SYSPLLCTRL_MSEL_MASK              (0x1FU)                                             /*!< SYSCON_SYSPLLCTRL: MSEL Mask            */
#define SYSCON_SYSPLLCTRL_MSEL_SHIFT             (0U)                                                /*!< SYSCON_SYSPLLCTRL: MSEL Position        */
#define SYSCON_SYSPLLCTRL_MSEL(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSPLLCTRL_MSEL_SHIFT))&SYSCON_SYSPLLCTRL_MSEL_MASK) /*!< SYSCON_SYSPLLCTRL                       */
#define SYSCON_SYSPLLCTRL_PSEL_MASK              (0x60U)                                             /*!< SYSCON_SYSPLLCTRL: PSEL Mask            */
#define SYSCON_SYSPLLCTRL_PSEL_SHIFT             (5U)                                                /*!< SYSCON_SYSPLLCTRL: PSEL Position        */
#define SYSCON_SYSPLLCTRL_PSEL(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSPLLCTRL_PSEL_SHIFT))&SYSCON_SYSPLLCTRL_PSEL_MASK) /*!< SYSCON_SYSPLLCTRL                       */
/* ------- SYSPLLSTAT Bit Fields                    ------ */
#define SYSCON_SYSPLLSTAT_LOCK_MASK              (0x1U)                                              /*!< SYSCON_SYSPLLSTAT: LOCK Mask            */
#define SYSCON_SYSPLLSTAT_LOCK_SHIFT             (0U)                                                /*!< SYSCON_SYSPLLSTAT: LOCK Position        */
#define SYSCON_SYSPLLSTAT_LOCK(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSPLLSTAT_LOCK_SHIFT))&SYSCON_SYSPLLSTAT_LOCK_MASK) /*!< SYSCON_SYSPLLSTAT                       */
/* ------- SYSOSCCTRL Bit Fields                    ------ */
#define SYSCON_SYSOSCCTRL_BYPASS_MASK            (0x1U)                                              /*!< SYSCON_SYSOSCCTRL: BYPASS Mask          */
#define SYSCON_SYSOSCCTRL_BYPASS_SHIFT           (0U)                                                /*!< SYSCON_SYSOSCCTRL: BYPASS Position      */
#define SYSCON_SYSOSCCTRL_BYPASS(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSOSCCTRL_BYPASS_SHIFT))&SYSCON_SYSOSCCTRL_BYPASS_MASK) /*!< SYSCON_SYSOSCCTRL                       */
#define SYSCON_SYSOSCCTRL_FREQRANGE_MASK         (0x2U)                                              /*!< SYSCON_SYSOSCCTRL: FREQRANGE Mask       */
#define SYSCON_SYSOSCCTRL_FREQRANGE_SHIFT        (1U)                                                /*!< SYSCON_SYSOSCCTRL: FREQRANGE Position   */
#define SYSCON_SYSOSCCTRL_FREQRANGE(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSOSCCTRL_FREQRANGE_SHIFT))&SYSCON_SYSOSCCTRL_FREQRANGE_MASK) /*!< SYSCON_SYSOSCCTRL                       */
/* ------- WDTOSCCTRL Bit Fields                    ------ */
#define SYSCON_WDTOSCCTRL_DIVSEL_MASK            (0x1FU)                                             /*!< SYSCON_WDTOSCCTRL: DIVSEL Mask          */
#define SYSCON_WDTOSCCTRL_DIVSEL_SHIFT           (0U)                                                /*!< SYSCON_WDTOSCCTRL: DIVSEL Position      */
#define SYSCON_WDTOSCCTRL_DIVSEL(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_WDTOSCCTRL_DIVSEL_SHIFT))&SYSCON_WDTOSCCTRL_DIVSEL_MASK) /*!< SYSCON_WDTOSCCTRL                       */
#define SYSCON_WDTOSCCTRL_FREQSEL_MASK           (0x1E0U)                                            /*!< SYSCON_WDTOSCCTRL: FREQSEL Mask         */
#define SYSCON_WDTOSCCTRL_FREQSEL_SHIFT          (5U)                                                /*!< SYSCON_WDTOSCCTRL: FREQSEL Position     */
#define SYSCON_WDTOSCCTRL_FREQSEL(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_WDTOSCCTRL_FREQSEL_SHIFT))&SYSCON_WDTOSCCTRL_FREQSEL_MASK) /*!< SYSCON_WDTOSCCTRL                       */
/* ------- IRCCTRL Bit Fields                       ------ */
#define SYSCON_IRCCTRL_TRIM_MASK                 (0xFFU)                                             /*!< SYSCON_IRCCTRL: TRIM Mask               */
#define SYSCON_IRCCTRL_TRIM_SHIFT                (0U)                                                /*!< SYSCON_IRCCTRL: TRIM Position           */
#define SYSCON_IRCCTRL_TRIM(x)                   (((uint32_t)(((uint32_t)(x))<<SYSCON_IRCCTRL_TRIM_SHIFT))&SYSCON_IRCCTRL_TRIM_MASK) /*!< SYSCON_IRCCTRL                          */
/* ------- SYSRSTSTAT Bit Fields                    ------ */
#define SYSCON_SYSRSTSTAT_POR_MASK               (0x1U)                                              /*!< SYSCON_SYSRSTSTAT: POR Mask             */
#define SYSCON_SYSRSTSTAT_POR_SHIFT              (0U)                                                /*!< SYSCON_SYSRSTSTAT: POR Position         */
#define SYSCON_SYSRSTSTAT_POR(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSRSTSTAT_POR_SHIFT))&SYSCON_SYSRSTSTAT_POR_MASK) /*!< SYSCON_SYSRSTSTAT                       */
#define SYSCON_SYSRSTSTAT_EXTRST_MASK            (0x2U)                                              /*!< SYSCON_SYSRSTSTAT: EXTRST Mask          */
#define SYSCON_SYSRSTSTAT_EXTRST_SHIFT           (1U)                                                /*!< SYSCON_SYSRSTSTAT: EXTRST Position      */
#define SYSCON_SYSRSTSTAT_EXTRST(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSRSTSTAT_EXTRST_SHIFT))&SYSCON_SYSRSTSTAT_EXTRST_MASK) /*!< SYSCON_SYSRSTSTAT                       */
#define SYSCON_SYSRSTSTAT_WDT_MASK               (0x4U)                                              /*!< SYSCON_SYSRSTSTAT: WDT Mask             */
#define SYSCON_SYSRSTSTAT_WDT_SHIFT              (2U)                                                /*!< SYSCON_SYSRSTSTAT: WDT Position         */
#define SYSCON_SYSRSTSTAT_WDT(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSRSTSTAT_WDT_SHIFT))&SYSCON_SYSRSTSTAT_WDT_MASK) /*!< SYSCON_SYSRSTSTAT                       */
#define SYSCON_SYSRSTSTAT_BOD_MASK               (0x8U)                                              /*!< SYSCON_SYSRSTSTAT: BOD Mask             */
#define SYSCON_SYSRSTSTAT_BOD_SHIFT              (3U)                                                /*!< SYSCON_SYSRSTSTAT: BOD Position         */
#define SYSCON_SYSRSTSTAT_BOD(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSRSTSTAT_BOD_SHIFT))&SYSCON_SYSRSTSTAT_BOD_MASK) /*!< SYSCON_SYSRSTSTAT                       */
#define SYSCON_SYSRSTSTAT_SYSRST_MASK            (0x10U)                                             /*!< SYSCON_SYSRSTSTAT: SYSRST Mask          */
#define SYSCON_SYSRSTSTAT_SYSRST_SHIFT           (4U)                                                /*!< SYSCON_SYSRSTSTAT: SYSRST Position      */
#define SYSCON_SYSRSTSTAT_SYSRST(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSRSTSTAT_SYSRST_SHIFT))&SYSCON_SYSRSTSTAT_SYSRST_MASK) /*!< SYSCON_SYSRSTSTAT                       */
/* ------- SYSPLLCLKSEL Bit Fields                  ------ */
#define SYSCON_SYSPLLCLKSEL_SEL_MASK             (0x3U)                                              /*!< SYSCON_SYSPLLCLKSEL: SEL Mask           */
#define SYSCON_SYSPLLCLKSEL_SEL_SHIFT            (0U)                                                /*!< SYSCON_SYSPLLCLKSEL: SEL Position       */
#define SYSCON_SYSPLLCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSPLLCLKSEL_SEL_SHIFT))&SYSCON_SYSPLLCLKSEL_SEL_MASK) /*!< SYSCON_SYSPLLCLKSEL                     */
/* ------- SYSPLLCLKUEN Bit Fields                  ------ */
#define SYSCON_SYSPLLCLKUEN_ENA_MASK             (0x1U)                                              /*!< SYSCON_SYSPLLCLKUEN: ENA Mask           */
#define SYSCON_SYSPLLCLKUEN_ENA_SHIFT            (0U)                                                /*!< SYSCON_SYSPLLCLKUEN: ENA Position       */
#define SYSCON_SYSPLLCLKUEN_ENA(x)               (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSPLLCLKUEN_ENA_SHIFT))&SYSCON_SYSPLLCLKUEN_ENA_MASK) /*!< SYSCON_SYSPLLCLKUEN                     */
/* ------- MAINCLKSEL Bit Fields                    ------ */
#define SYSCON_MAINCLKSEL_SEL_MASK               (0x3U)                                              /*!< SYSCON_MAINCLKSEL: SEL Mask             */
#define SYSCON_MAINCLKSEL_SEL_SHIFT              (0U)                                                /*!< SYSCON_MAINCLKSEL: SEL Position         */
#define SYSCON_MAINCLKSEL_SEL(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_MAINCLKSEL_SEL_SHIFT))&SYSCON_MAINCLKSEL_SEL_MASK) /*!< SYSCON_MAINCLKSEL                       */
/* ------- MAINCLKUEN Bit Fields                    ------ */
#define SYSCON_MAINCLKUEN_ENA_MASK               (0x1U)                                              /*!< SYSCON_MAINCLKUEN: ENA Mask             */
#define SYSCON_MAINCLKUEN_ENA_SHIFT              (0U)                                                /*!< SYSCON_MAINCLKUEN: ENA Position         */
#define SYSCON_MAINCLKUEN_ENA(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_MAINCLKUEN_ENA_SHIFT))&SYSCON_MAINCLKUEN_ENA_MASK) /*!< SYSCON_MAINCLKUEN                       */
/* ------- SYSAHBCLKDIV Bit Fields                  ------ */
#define SYSCON_SYSAHBCLKDIV_DIV_MASK             (0xFFU)                                             /*!< SYSCON_SYSAHBCLKDIV: DIV Mask           */
#define SYSCON_SYSAHBCLKDIV_DIV_SHIFT            (0U)                                                /*!< SYSCON_SYSAHBCLKDIV: DIV Position       */
#define SYSCON_SYSAHBCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKDIV_DIV_SHIFT))&SYSCON_SYSAHBCLKDIV_DIV_MASK) /*!< SYSCON_SYSAHBCLKDIV                     */
/* ------- SYSAHBCLKCTRL Bit Fields                 ------ */
#define SYSCON_SYSAHBCLKCTRL_SYS_MASK            (0x1U)                                              /*!< SYSCON_SYSAHBCLKCTRL: SYS Mask          */
#define SYSCON_SYSAHBCLKCTRL_SYS_SHIFT           (0U)                                                /*!< SYSCON_SYSAHBCLKCTRL: SYS Position      */
#define SYSCON_SYSAHBCLKCTRL_SYS(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_SYS_SHIFT))&SYSCON_SYSAHBCLKCTRL_SYS_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_ROM_MASK            (0x2U)                                              /*!< SYSCON_SYSAHBCLKCTRL: ROM Mask          */
#define SYSCON_SYSAHBCLKCTRL_ROM_SHIFT           (1U)                                                /*!< SYSCON_SYSAHBCLKCTRL: ROM Position      */
#define SYSCON_SYSAHBCLKCTRL_ROM(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_ROM_SHIFT))&SYSCON_SYSAHBCLKCTRL_ROM_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_RAM_MASK            (0x4U)                                              /*!< SYSCON_SYSAHBCLKCTRL: RAM Mask          */
#define SYSCON_SYSAHBCLKCTRL_RAM_SHIFT           (2U)                                                /*!< SYSCON_SYSAHBCLKCTRL: RAM Position      */
#define SYSCON_SYSAHBCLKCTRL_RAM(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_RAM_SHIFT))&SYSCON_SYSAHBCLKCTRL_RAM_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_FLASHREG_MASK       (0x8U)                                              /*!< SYSCON_SYSAHBCLKCTRL: FLASHREG Mask     */
#define SYSCON_SYSAHBCLKCTRL_FLASHREG_SHIFT      (3U)                                                /*!< SYSCON_SYSAHBCLKCTRL: FLASHREG Position */
#define SYSCON_SYSAHBCLKCTRL_FLASHREG(x)         (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_FLASHREG_SHIFT))&SYSCON_SYSAHBCLKCTRL_FLASHREG_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_FLASHARRAY_MASK     (0x10U)                                             /*!< SYSCON_SYSAHBCLKCTRL: FLASHARRAY Mask   */
#define SYSCON_SYSAHBCLKCTRL_FLASHARRAY_SHIFT    (4U)                                                /*!< SYSCON_SYSAHBCLKCTRL: FLASHARRAY Position*/
#define SYSCON_SYSAHBCLKCTRL_FLASHARRAY(x)       (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_FLASHARRAY_SHIFT))&SYSCON_SYSAHBCLKCTRL_FLASHARRAY_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_I2C_MASK            (0x20U)                                             /*!< SYSCON_SYSAHBCLKCTRL: I2C Mask          */
#define SYSCON_SYSAHBCLKCTRL_I2C_SHIFT           (5U)                                                /*!< SYSCON_SYSAHBCLKCTRL: I2C Position      */
#define SYSCON_SYSAHBCLKCTRL_I2C(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_I2C_SHIFT))&SYSCON_SYSAHBCLKCTRL_I2C_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_GPIO_MASK           (0x40U)                                             /*!< SYSCON_SYSAHBCLKCTRL: GPIO Mask         */
#define SYSCON_SYSAHBCLKCTRL_GPIO_SHIFT          (6U)                                                /*!< SYSCON_SYSAHBCLKCTRL: GPIO Position     */
#define SYSCON_SYSAHBCLKCTRL_GPIO(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_GPIO_SHIFT))&SYSCON_SYSAHBCLKCTRL_GPIO_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_CT16B0_MASK         (0x80U)                                             /*!< SYSCON_SYSAHBCLKCTRL: CT16B0 Mask       */
#define SYSCON_SYSAHBCLKCTRL_CT16B0_SHIFT        (7U)                                                /*!< SYSCON_SYSAHBCLKCTRL: CT16B0 Position   */
#define SYSCON_SYSAHBCLKCTRL_CT16B0(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_CT16B0_SHIFT))&SYSCON_SYSAHBCLKCTRL_CT16B0_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_CT16B1_MASK         (0x100U)                                            /*!< SYSCON_SYSAHBCLKCTRL: CT16B1 Mask       */
#define SYSCON_SYSAHBCLKCTRL_CT16B1_SHIFT        (8U)                                                /*!< SYSCON_SYSAHBCLKCTRL: CT16B1 Position   */
#define SYSCON_SYSAHBCLKCTRL_CT16B1(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_CT16B1_SHIFT))&SYSCON_SYSAHBCLKCTRL_CT16B1_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_CT32B0_MASK         (0x200U)                                            /*!< SYSCON_SYSAHBCLKCTRL: CT32B0 Mask       */
#define SYSCON_SYSAHBCLKCTRL_CT32B0_SHIFT        (9U)                                                /*!< SYSCON_SYSAHBCLKCTRL: CT32B0 Position   */
#define SYSCON_SYSAHBCLKCTRL_CT32B0(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_CT32B0_SHIFT))&SYSCON_SYSAHBCLKCTRL_CT32B0_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_CT32B1_MASK         (0x400U)                                            /*!< SYSCON_SYSAHBCLKCTRL: CT32B1 Mask       */
#define SYSCON_SYSAHBCLKCTRL_CT32B1_SHIFT        (10U)                                               /*!< SYSCON_SYSAHBCLKCTRL: CT32B1 Position   */
#define SYSCON_SYSAHBCLKCTRL_CT32B1(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_CT32B1_SHIFT))&SYSCON_SYSAHBCLKCTRL_CT32B1_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_SSP0_MASK           (0x800U)                                            /*!< SYSCON_SYSAHBCLKCTRL: SSP0 Mask         */
#define SYSCON_SYSAHBCLKCTRL_SSP0_SHIFT          (11U)                                               /*!< SYSCON_SYSAHBCLKCTRL: SSP0 Position     */
#define SYSCON_SYSAHBCLKCTRL_SSP0(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_SSP0_SHIFT))&SYSCON_SYSAHBCLKCTRL_SSP0_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_UART_MASK           (0x1000U)                                           /*!< SYSCON_SYSAHBCLKCTRL: UART Mask         */
#define SYSCON_SYSAHBCLKCTRL_UART_SHIFT          (12U)                                               /*!< SYSCON_SYSAHBCLKCTRL: UART Position     */
#define SYSCON_SYSAHBCLKCTRL_UART(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_UART_SHIFT))&SYSCON_SYSAHBCLKCTRL_UART_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_ADC_MASK            (0x2000U)                                           /*!< SYSCON_SYSAHBCLKCTRL: ADC Mask          */
#define SYSCON_SYSAHBCLKCTRL_ADC_SHIFT           (13U)                                               /*!< SYSCON_SYSAHBCLKCTRL: ADC Position      */
#define SYSCON_SYSAHBCLKCTRL_ADC(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_ADC_SHIFT))&SYSCON_SYSAHBCLKCTRL_ADC_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_WDT_MASK            (0x8000U)                                           /*!< SYSCON_SYSAHBCLKCTRL: WDT Mask          */
#define SYSCON_SYSAHBCLKCTRL_WDT_SHIFT           (15U)                                               /*!< SYSCON_SYSAHBCLKCTRL: WDT Position      */
#define SYSCON_SYSAHBCLKCTRL_WDT(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_WDT_SHIFT))&SYSCON_SYSAHBCLKCTRL_WDT_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_IOCON_MASK          (0x10000U)                                          /*!< SYSCON_SYSAHBCLKCTRL: IOCON Mask        */
#define SYSCON_SYSAHBCLKCTRL_IOCON_SHIFT         (16U)                                               /*!< SYSCON_SYSAHBCLKCTRL: IOCON Position    */
#define SYSCON_SYSAHBCLKCTRL_IOCON(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_IOCON_SHIFT))&SYSCON_SYSAHBCLKCTRL_IOCON_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_CAN_MASK            (0x20000U)                                          /*!< SYSCON_SYSAHBCLKCTRL: CAN Mask          */
#define SYSCON_SYSAHBCLKCTRL_CAN_SHIFT           (17U)                                               /*!< SYSCON_SYSAHBCLKCTRL: CAN Position      */
#define SYSCON_SYSAHBCLKCTRL_CAN(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_CAN_SHIFT))&SYSCON_SYSAHBCLKCTRL_CAN_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
#define SYSCON_SYSAHBCLKCTRL_SSP1_MASK           (0x40000U)                                          /*!< SYSCON_SYSAHBCLKCTRL: SSP1 Mask         */
#define SYSCON_SYSAHBCLKCTRL_SSP1_SHIFT          (18U)                                               /*!< SYSCON_SYSAHBCLKCTRL: SSP1 Position     */
#define SYSCON_SYSAHBCLKCTRL_SSP1(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSAHBCLKCTRL_SSP1_SHIFT))&SYSCON_SYSAHBCLKCTRL_SSP1_MASK) /*!< SYSCON_SYSAHBCLKCTRL                    */
/* ------- SSP0CLKDIV Bit Fields                    ------ */
#define SYSCON_SSP0CLKDIV_DIV_MASK               (0xFFU)                                             /*!< SYSCON_SSP0CLKDIV: DIV Mask             */
#define SYSCON_SSP0CLKDIV_DIV_SHIFT              (0U)                                                /*!< SYSCON_SSP0CLKDIV: DIV Position         */
#define SYSCON_SSP0CLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_SSP0CLKDIV_DIV_SHIFT))&SYSCON_SSP0CLKDIV_DIV_MASK) /*!< SYSCON_SSP0CLKDIV                       */
/* ------- UARTCLKDIV Bit Fields                    ------ */
#define SYSCON_UARTCLKDIV_DIV_MASK               (0xFFU)                                             /*!< SYSCON_UARTCLKDIV: DIV Mask             */
#define SYSCON_UARTCLKDIV_DIV_SHIFT              (0U)                                                /*!< SYSCON_UARTCLKDIV: DIV Position         */
#define SYSCON_UARTCLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_UARTCLKDIV_DIV_SHIFT))&SYSCON_UARTCLKDIV_DIV_MASK) /*!< SYSCON_UARTCLKDIV                       */
/* ------- SSP1CLKDIV Bit Fields                    ------ */
#define SYSCON_SSP1CLKDIV_DIV_MASK               (0xFFU)                                             /*!< SYSCON_SSP1CLKDIV: DIV Mask             */
#define SYSCON_SSP1CLKDIV_DIV_SHIFT              (0U)                                                /*!< SYSCON_SSP1CLKDIV: DIV Position         */
#define SYSCON_SSP1CLKDIV_DIV(x)                 (((uint32_t)(((uint32_t)(x))<<SYSCON_SSP1CLKDIV_DIV_SHIFT))&SYSCON_SSP1CLKDIV_DIV_MASK) /*!< SYSCON_SSP1CLKDIV                       */
/* ------- WDTCLKSEL Bit Fields                     ------ */
#define SYSCON_WDTCLKSEL_SEL_MASK                (0x3U)                                              /*!< SYSCON_WDTCLKSEL: SEL Mask              */
#define SYSCON_WDTCLKSEL_SEL_SHIFT               (0U)                                                /*!< SYSCON_WDTCLKSEL: SEL Position          */
#define SYSCON_WDTCLKSEL_SEL(x)                  (((uint32_t)(((uint32_t)(x))<<SYSCON_WDTCLKSEL_SEL_SHIFT))&SYSCON_WDTCLKSEL_SEL_MASK) /*!< SYSCON_WDTCLKSEL                        */
/* ------- WDTCLKUEN Bit Fields                     ------ */
#define SYSCON_WDTCLKUEN_ENA_MASK                (0x1U)                                              /*!< SYSCON_WDTCLKUEN: ENA Mask              */
#define SYSCON_WDTCLKUEN_ENA_SHIFT               (0U)                                                /*!< SYSCON_WDTCLKUEN: ENA Position          */
#define SYSCON_WDTCLKUEN_ENA(x)                  (((uint32_t)(((uint32_t)(x))<<SYSCON_WDTCLKUEN_ENA_SHIFT))&SYSCON_WDTCLKUEN_ENA_MASK) /*!< SYSCON_WDTCLKUEN                        */
/* ------- WDTCLKDIV Bit Fields                     ------ */
#define SYSCON_WDTCLKDIV_DIV_MASK                (0xFFU)                                             /*!< SYSCON_WDTCLKDIV: DIV Mask              */
