podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define SYSCON_WDTCLKDIV_DIV_SHIFT               (0U)                                                /*!< SYSCON_WDTCLKDIV: DIV Position          */
#define SYSCON_WDTCLKDIV_DIV(x)                  (((uint32_t)(((uint32_t)(x))<<SYSCON_WDTCLKDIV_DIV_SHIFT))&SYSCON_WDTCLKDIV_DIV_MASK) /*!< SYSCON_WDTCLKDIV                        */
/* ------- CLKOUTCLKSEL Bit Fields                  ------ */
#define SYSCON_CLKOUTCLKSEL_SEL_MASK             (0x3U)                                              /*!< SYSCON_CLKOUTCLKSEL: SEL Mask           */
#define SYSCON_CLKOUTCLKSEL_SEL_SHIFT            (0U)                                                /*!< SYSCON_CLKOUTCLKSEL: SEL Position       */
#define SYSCON_CLKOUTCLKSEL_SEL(x)               (((uint32_t)(((uint32_t)(x))<<SYSCON_CLKOUTCLKSEL_SEL_SHIFT))&SYSCON_CLKOUTCLKSEL_SEL_MASK) /*!< SYSCON_CLKOUTCLKSEL                     */
/* ------- CLKOUTUEN Bit Fields                     ------ */
#define SYSCON_CLKOUTUEN_ENA_MASK                (0x1U)                                              /*!< SYSCON_CLKOUTUEN: ENA Mask              */
#define SYSCON_CLKOUTUEN_ENA_SHIFT               (0U)                                                /*!< SYSCON_CLKOUTUEN: ENA Position          */
#define SYSCON_CLKOUTUEN_ENA(x)                  (((uint32_t)(((uint32_t)(x))<<SYSCON_CLKOUTUEN_ENA_SHIFT))&SYSCON_CLKOUTUEN_ENA_MASK) /*!< SYSCON_CLKOUTUEN                        */
/* ------- CLKOUTCLKDIV Bit Fields                  ------ */
#define SYSCON_CLKOUTCLKDIV_DIV_MASK             (0xFFU)                                             /*!< SYSCON_CLKOUTCLKDIV: DIV Mask           */
#define SYSCON_CLKOUTCLKDIV_DIV_SHIFT            (0U)                                                /*!< SYSCON_CLKOUTCLKDIV: DIV Position       */
#define SYSCON_CLKOUTCLKDIV_DIV(x)               (((uint32_t)(((uint32_t)(x))<<SYSCON_CLKOUTCLKDIV_DIV_SHIFT))&SYSCON_CLKOUTCLKDIV_DIV_MASK) /*!< SYSCON_CLKOUTCLKDIV                     */
/* ------- PIOPORCAP0 Bit Fields                    ------ */
#define SYSCON_PIOPORCAP0_CAPPIO0_n_MASK         (0xFFFU)                                            /*!< SYSCON_PIOPORCAP0: CAPPIO0_n Mask       */
#define SYSCON_PIOPORCAP0_CAPPIO0_n_SHIFT        (0U)                                                /*!< SYSCON_PIOPORCAP0: CAPPIO0_n Position   */
#define SYSCON_PIOPORCAP0_CAPPIO0_n(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP0_CAPPIO0_n_SHIFT))&SYSCON_PIOPORCAP0_CAPPIO0_n_MASK) /*!< SYSCON_PIOPORCAP0                       */
#define SYSCON_PIOPORCAP0_CAPPIO1_n_MASK         (0xFFF000U)                                         /*!< SYSCON_PIOPORCAP0: CAPPIO1_n Mask       */
#define SYSCON_PIOPORCAP0_CAPPIO1_n_SHIFT        (12U)                                               /*!< SYSCON_PIOPORCAP0: CAPPIO1_n Position   */
#define SYSCON_PIOPORCAP0_CAPPIO1_n(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP0_CAPPIO1_n_SHIFT))&SYSCON_PIOPORCAP0_CAPPIO1_n_MASK) /*!< SYSCON_PIOPORCAP0                       */
#define SYSCON_PIOPORCAP0_CAPPIO2_n_MASK         (0xFF000000U)                                       /*!< SYSCON_PIOPORCAP0: CAPPIO2_n Mask       */
#define SYSCON_PIOPORCAP0_CAPPIO2_n_SHIFT        (24U)                                               /*!< SYSCON_PIOPORCAP0: CAPPIO2_n Position   */
#define SYSCON_PIOPORCAP0_CAPPIO2_n(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP0_CAPPIO2_n_SHIFT))&SYSCON_PIOPORCAP0_CAPPIO2_n_MASK) /*!< SYSCON_PIOPORCAP0                       */
/* ------- PIOPORCAP1 Bit Fields                    ------ */
#define SYSCON_PIOPORCAP1_CAPPIO2_8_MASK         (0x1U)                                              /*!< SYSCON_PIOPORCAP1: CAPPIO2_8 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO2_8_SHIFT        (0U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO2_8 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO2_8(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO2_8_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO2_8_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO2_9_MASK         (0x2U)                                              /*!< SYSCON_PIOPORCAP1: CAPPIO2_9 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO2_9_SHIFT        (1U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO2_9 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO2_9(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO2_9_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO2_9_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO2_10_MASK        (0x4U)                                              /*!< SYSCON_PIOPORCAP1: CAPPIO2_10 Mask      */
#define SYSCON_PIOPORCAP1_CAPPIO2_10_SHIFT       (2U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO2_10 Position  */
#define SYSCON_PIOPORCAP1_CAPPIO2_10(x)          (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO2_10_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO2_10_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO2_11_MASK        (0x8U)                                              /*!< SYSCON_PIOPORCAP1: CAPPIO2_11 Mask      */
#define SYSCON_PIOPORCAP1_CAPPIO2_11_SHIFT       (3U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO2_11 Position  */
#define SYSCON_PIOPORCAP1_CAPPIO2_11(x)          (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO2_11_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO2_11_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO3_0_MASK         (0x10U)                                             /*!< SYSCON_PIOPORCAP1: CAPPIO3_0 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO3_0_SHIFT        (4U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO3_0 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO3_0(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO3_0_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO3_0_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO3_1_MASK         (0x20U)                                             /*!< SYSCON_PIOPORCAP1: CAPPIO3_1 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO3_1_SHIFT        (5U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO3_1 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO3_1(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO3_1_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO3_1_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO3_2_MASK         (0x40U)                                             /*!< SYSCON_PIOPORCAP1: CAPPIO3_2 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO3_2_SHIFT        (6U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO3_2 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO3_2(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO3_2_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO3_2_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO3_3_MASK         (0x80U)                                             /*!< SYSCON_PIOPORCAP1: CAPPIO3_3 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO3_3_SHIFT        (7U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO3_3 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO3_3(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO3_3_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO3_3_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO3_4_MASK         (0x100U)                                            /*!< SYSCON_PIOPORCAP1: CAPPIO3_4 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO3_4_SHIFT        (8U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO3_4 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO3_4(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO3_4_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO3_4_MASK) /*!< SYSCON_PIOPORCAP1                       */
#define SYSCON_PIOPORCAP1_CAPPIO3_5_MASK         (0x200U)                                            /*!< SYSCON_PIOPORCAP1: CAPPIO3_5 Mask       */
#define SYSCON_PIOPORCAP1_CAPPIO3_5_SHIFT        (9U)                                                /*!< SYSCON_PIOPORCAP1: CAPPIO3_5 Position   */
#define SYSCON_PIOPORCAP1_CAPPIO3_5(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PIOPORCAP1_CAPPIO3_5_SHIFT))&SYSCON_PIOPORCAP1_CAPPIO3_5_MASK) /*!< SYSCON_PIOPORCAP1                       */
/* ------- BODCTRL Bit Fields                       ------ */
#define SYSCON_BODCTRL_BODRSTLEV_MASK            (0x3U)                                              /*!< SYSCON_BODCTRL: BODRSTLEV Mask          */
#define SYSCON_BODCTRL_BODRSTLEV_SHIFT           (0U)                                                /*!< SYSCON_BODCTRL: BODRSTLEV Position      */
#define SYSCON_BODCTRL_BODRSTLEV(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_BODCTRL_BODRSTLEV_SHIFT))&SYSCON_BODCTRL_BODRSTLEV_MASK) /*!< SYSCON_BODCTRL                          */
#define SYSCON_BODCTRL_BODINTVAL_MASK            (0xCU)                                              /*!< SYSCON_BODCTRL: BODINTVAL Mask          */
#define SYSCON_BODCTRL_BODINTVAL_SHIFT           (2U)                                                /*!< SYSCON_BODCTRL: BODINTVAL Position      */
#define SYSCON_BODCTRL_BODINTVAL(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_BODCTRL_BODINTVAL_SHIFT))&SYSCON_BODCTRL_BODINTVAL_MASK) /*!< SYSCON_BODCTRL                          */
#define SYSCON_BODCTRL_BODRSTENA_MASK            (0x10U)                                             /*!< SYSCON_BODCTRL: BODRSTENA Mask          */
#define SYSCON_BODCTRL_BODRSTENA_SHIFT           (4U)                                                /*!< SYSCON_BODCTRL: BODRSTENA Position      */
#define SYSCON_BODCTRL_BODRSTENA(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_BODCTRL_BODRSTENA_SHIFT))&SYSCON_BODCTRL_BODRSTENA_MASK) /*!< SYSCON_BODCTRL                          */
/* ------- SYSTCKCAL Bit Fields                     ------ */
#define SYSCON_SYSTCKCAL_CAL_MASK                (0x3FFFFFFU)                                        /*!< SYSCON_SYSTCKCAL: CAL Mask              */
#define SYSCON_SYSTCKCAL_CAL_SHIFT               (0U)                                                /*!< SYSCON_SYSTCKCAL: CAL Position          */
#define SYSCON_SYSTCKCAL_CAL(x)                  (((uint32_t)(((uint32_t)(x))<<SYSCON_SYSTCKCAL_CAL_SHIFT))&SYSCON_SYSTCKCAL_CAL_MASK) /*!< SYSCON_SYSTCKCAL                        */
/* ------- NMISRC Bit Fields                        ------ */
#define SYSCON_NMISRC_IRQNO_MASK                 (0x1FU)                                             /*!< SYSCON_NMISRC: IRQNO Mask               */
#define SYSCON_NMISRC_IRQNO_SHIFT                (0U)                                                /*!< SYSCON_NMISRC: IRQNO Position           */
#define SYSCON_NMISRC_IRQNO(x)                   (((uint32_t)(((uint32_t)(x))<<SYSCON_NMISRC_IRQNO_SHIFT))&SYSCON_NMISRC_IRQNO_MASK) /*!< SYSCON_NMISRC                           */
#define SYSCON_NMISRC_NMIEN_MASK                 (0x80000000U)                                       /*!< SYSCON_NMISRC: NMIEN Mask               */
#define SYSCON_NMISRC_NMIEN_SHIFT                (31U)                                               /*!< SYSCON_NMISRC: NMIEN Position           */
#define SYSCON_NMISRC_NMIEN(x)                   (((uint32_t)(((uint32_t)(x))<<SYSCON_NMISRC_NMIEN_SHIFT))&SYSCON_NMISRC_NMIEN_MASK) /*!< SYSCON_NMISRC                           */
/* ------- STARTAPRP0 Bit Fields                    ------ */
#define SYSCON_STARTAPRP0_APRPIO0_0_MASK         (0x1U)                                              /*!< SYSCON_STARTAPRP0: APRPIO0_0 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_0_SHIFT        (0U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_0 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_0(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_0_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_0_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_1_MASK         (0x2U)                                              /*!< SYSCON_STARTAPRP0: APRPIO0_1 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_1_SHIFT        (1U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_1 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_1(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_1_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_1_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_2_MASK         (0x4U)                                              /*!< SYSCON_STARTAPRP0: APRPIO0_2 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_2_SHIFT        (2U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_2 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_2(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_2_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_2_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_3_MASK         (0x8U)                                              /*!< SYSCON_STARTAPRP0: APRPIO0_3 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_3_SHIFT        (3U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_3 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_3(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_3_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_3_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_4_MASK         (0x10U)                                             /*!< SYSCON_STARTAPRP0: APRPIO0_4 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_4_SHIFT        (4U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_4 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_4(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_4_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_4_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_5_MASK         (0x20U)                                             /*!< SYSCON_STARTAPRP0: APRPIO0_5 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_5_SHIFT        (5U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_5 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_5(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_5_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_5_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_6_MASK         (0x40U)                                             /*!< SYSCON_STARTAPRP0: APRPIO0_6 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_6_SHIFT        (6U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_6 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_6(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_6_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_6_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_7_MASK         (0x80U)                                             /*!< SYSCON_STARTAPRP0: APRPIO0_7 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_7_SHIFT        (7U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_7 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_7(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_7_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_7_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_8_MASK         (0x100U)                                            /*!< SYSCON_STARTAPRP0: APRPIO0_8 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_8_SHIFT        (8U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_8 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_8(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_8_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_8_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_9_MASK         (0x200U)                                            /*!< SYSCON_STARTAPRP0: APRPIO0_9 Mask       */
#define SYSCON_STARTAPRP0_APRPIO0_9_SHIFT        (9U)                                                /*!< SYSCON_STARTAPRP0: APRPIO0_9 Position   */
#define SYSCON_STARTAPRP0_APRPIO0_9(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_9_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_9_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_10_MASK        (0x400U)                                            /*!< SYSCON_STARTAPRP0: APRPIO0_10 Mask      */
#define SYSCON_STARTAPRP0_APRPIO0_10_SHIFT       (10U)                                               /*!< SYSCON_STARTAPRP0: APRPIO0_10 Position  */
#define SYSCON_STARTAPRP0_APRPIO0_10(x)          (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_10_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_10_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO0_11_MASK        (0x800U)                                            /*!< SYSCON_STARTAPRP0: APRPIO0_11 Mask      */
#define SYSCON_STARTAPRP0_APRPIO0_11_SHIFT       (11U)                                               /*!< SYSCON_STARTAPRP0: APRPIO0_11 Position  */
#define SYSCON_STARTAPRP0_APRPIO0_11(x)          (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO0_11_SHIFT))&SYSCON_STARTAPRP0_APRPIO0_11_MASK) /*!< SYSCON_STARTAPRP0                       */
#define SYSCON_STARTAPRP0_APRPIO1_0_MASK         (0x1000U)                                           /*!< SYSCON_STARTAPRP0: APRPIO1_0 Mask       */
#define SYSCON_STARTAPRP0_APRPIO1_0_SHIFT        (12U)                                               /*!< SYSCON_STARTAPRP0: APRPIO1_0 Position   */
#define SYSCON_STARTAPRP0_APRPIO1_0(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTAPRP0_APRPIO1_0_SHIFT))&SYSCON_STARTAPRP0_APRPIO1_0_MASK) /*!< SYSCON_STARTAPRP0                       */
/* ------- STARTERP0 Bit Fields                     ------ */
#define SYSCON_STARTERP0_ERPIO0_0_MASK           (0x1U)                                              /*!< SYSCON_STARTERP0: ERPIO0_0 Mask         */
#define SYSCON_STARTERP0_ERPIO0_0_SHIFT          (0U)                                                /*!< SYSCON_STARTERP0: ERPIO0_0 Position     */
#define SYSCON_STARTERP0_ERPIO0_0(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_0_SHIFT))&SYSCON_STARTERP0_ERPIO0_0_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_1_MASK           (0x2U)                                              /*!< SYSCON_STARTERP0: ERPIO0_1 Mask         */
#define SYSCON_STARTERP0_ERPIO0_1_SHIFT          (1U)                                                /*!< SYSCON_STARTERP0: ERPIO0_1 Position     */
#define SYSCON_STARTERP0_ERPIO0_1(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_1_SHIFT))&SYSCON_STARTERP0_ERPIO0_1_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_2_MASK           (0x4U)                                              /*!< SYSCON_STARTERP0: ERPIO0_2 Mask         */
#define SYSCON_STARTERP0_ERPIO0_2_SHIFT          (2U)                                                /*!< SYSCON_STARTERP0: ERPIO0_2 Position     */
#define SYSCON_STARTERP0_ERPIO0_2(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_2_SHIFT))&SYSCON_STARTERP0_ERPIO0_2_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_3_MASK           (0x8U)                                              /*!< SYSCON_STARTERP0: ERPIO0_3 Mask         */
#define SYSCON_STARTERP0_ERPIO0_3_SHIFT          (3U)                                                /*!< SYSCON_STARTERP0: ERPIO0_3 Position     */
#define SYSCON_STARTERP0_ERPIO0_3(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_3_SHIFT))&SYSCON_STARTERP0_ERPIO0_3_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_4_MASK           (0x10U)                                             /*!< SYSCON_STARTERP0: ERPIO0_4 Mask         */
#define SYSCON_STARTERP0_ERPIO0_4_SHIFT          (4U)                                                /*!< SYSCON_STARTERP0: ERPIO0_4 Position     */
#define SYSCON_STARTERP0_ERPIO0_4(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_4_SHIFT))&SYSCON_STARTERP0_ERPIO0_4_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_5_MASK           (0x20U)                                             /*!< SYSCON_STARTERP0: ERPIO0_5 Mask         */
#define SYSCON_STARTERP0_ERPIO0_5_SHIFT          (5U)                                                /*!< SYSCON_STARTERP0: ERPIO0_5 Position     */
#define SYSCON_STARTERP0_ERPIO0_5(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_5_SHIFT))&SYSCON_STARTERP0_ERPIO0_5_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_6_MASK           (0x40U)                                             /*!< SYSCON_STARTERP0: ERPIO0_6 Mask         */
#define SYSCON_STARTERP0_ERPIO0_6_SHIFT          (6U)                                                /*!< SYSCON_STARTERP0: ERPIO0_6 Position     */
#define SYSCON_STARTERP0_ERPIO0_6(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_6_SHIFT))&SYSCON_STARTERP0_ERPIO0_6_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_7_MASK           (0x80U)                                             /*!< SYSCON_STARTERP0: ERPIO0_7 Mask         */
#define SYSCON_STARTERP0_ERPIO0_7_SHIFT          (7U)                                                /*!< SYSCON_STARTERP0: ERPIO0_7 Position     */
#define SYSCON_STARTERP0_ERPIO0_7(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_7_SHIFT))&SYSCON_STARTERP0_ERPIO0_7_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_8_MASK           (0x100U)                                            /*!< SYSCON_STARTERP0: ERPIO0_8 Mask         */
#define SYSCON_STARTERP0_ERPIO0_8_SHIFT          (8U)                                                /*!< SYSCON_STARTERP0: ERPIO0_8 Position     */
#define SYSCON_STARTERP0_ERPIO0_8(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_8_SHIFT))&SYSCON_STARTERP0_ERPIO0_8_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_9_MASK           (0x200U)                                            /*!< SYSCON_STARTERP0: ERPIO0_9 Mask         */
#define SYSCON_STARTERP0_ERPIO0_9_SHIFT          (9U)                                                /*!< SYSCON_STARTERP0: ERPIO0_9 Position     */
#define SYSCON_STARTERP0_ERPIO0_9(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_9_SHIFT))&SYSCON_STARTERP0_ERPIO0_9_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_10_MASK          (0x400U)                                            /*!< SYSCON_STARTERP0: ERPIO0_10 Mask        */
#define SYSCON_STARTERP0_ERPIO0_10_SHIFT         (10U)                                               /*!< SYSCON_STARTERP0: ERPIO0_10 Position    */
#define SYSCON_STARTERP0_ERPIO0_10(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_10_SHIFT))&SYSCON_STARTERP0_ERPIO0_10_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO0_11_MASK          (0x800U)                                            /*!< SYSCON_STARTERP0: ERPIO0_11 Mask        */
#define SYSCON_STARTERP0_ERPIO0_11_SHIFT         (11U)                                               /*!< SYSCON_STARTERP0: ERPIO0_11 Position    */
