podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define SYSCON_STARTERP0_ERPIO0_11(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO0_11_SHIFT))&SYSCON_STARTERP0_ERPIO0_11_MASK) /*!< SYSCON_STARTERP0                        */
#define SYSCON_STARTERP0_ERPIO1_0_MASK           (0x1000U)                                           /*!< SYSCON_STARTERP0: ERPIO1_0 Mask         */
#define SYSCON_STARTERP0_ERPIO1_0_SHIFT          (12U)                                               /*!< SYSCON_STARTERP0: ERPIO1_0 Position     */
#define SYSCON_STARTERP0_ERPIO1_0(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTERP0_ERPIO1_0_SHIFT))&SYSCON_STARTERP0_ERPIO1_0_MASK) /*!< SYSCON_STARTERP0                        */
/* ------- STARTRSRP0CLR Bit Fields                 ------ */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_0_MASK      (0x1U)                                              /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_0 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_0_SHIFT     (0U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_0 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_0(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_0_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_0_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_1_MASK      (0x2U)                                              /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_1 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_1_SHIFT     (1U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_1 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_1(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_1_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_1_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_2_MASK      (0x4U)                                              /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_2 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_2_SHIFT     (2U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_2 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_2(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_2_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_2_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_3_MASK      (0x8U)                                              /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_3 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_3_SHIFT     (3U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_3 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_3(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_3_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_3_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_4_MASK      (0x10U)                                             /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_4 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_4_SHIFT     (4U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_4 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_4(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_4_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_4_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_5_MASK      (0x20U)                                             /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_5 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_5_SHIFT     (5U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_5 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_5(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_5_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_5_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_6_MASK      (0x40U)                                             /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_6 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_6_SHIFT     (6U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_6 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_6(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_6_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_6_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_7_MASK      (0x80U)                                             /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_7 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_7_SHIFT     (7U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_7 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_7(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_7_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_7_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_8_MASK      (0x100U)                                            /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_8 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_8_SHIFT     (8U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_8 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_8(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_8_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_8_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_9_MASK      (0x200U)                                            /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_9 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_9_SHIFT     (9U)                                                /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_9 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_9(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_9_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_9_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_10_MASK     (0x400U)                                            /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_10 Mask   */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_10_SHIFT    (10U)                                               /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_10 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_10(x)       (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_10_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_10_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_11_MASK     (0x800U)                                            /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_11 Mask   */
#define SYSCON_STARTRSRP0CLR_RSRPIO0_11_SHIFT    (11U)                                               /*!< SYSCON_STARTRSRP0CLR: RSRPIO0_11 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO0_11(x)       (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO0_11_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO0_11_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
#define SYSCON_STARTRSRP0CLR_RSRPIO1_0_MASK      (0x1000U)                                           /*!< SYSCON_STARTRSRP0CLR: RSRPIO1_0 Mask    */
#define SYSCON_STARTRSRP0CLR_RSRPIO1_0_SHIFT     (12U)                                               /*!< SYSCON_STARTRSRP0CLR: RSRPIO1_0 Position*/
#define SYSCON_STARTRSRP0CLR_RSRPIO1_0(x)        (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTRSRP0CLR_RSRPIO1_0_SHIFT))&SYSCON_STARTRSRP0CLR_RSRPIO1_0_MASK) /*!< SYSCON_STARTRSRP0CLR                    */
/* ------- STARTSRP0 Bit Fields                     ------ */
#define SYSCON_STARTSRP0_SRPIO0_0_MASK           (0x1U)                                              /*!< SYSCON_STARTSRP0: SRPIO0_0 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_0_SHIFT          (0U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_0 Position     */
#define SYSCON_STARTSRP0_SRPIO0_0(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_0_SHIFT))&SYSCON_STARTSRP0_SRPIO0_0_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_1_MASK           (0x2U)                                              /*!< SYSCON_STARTSRP0: SRPIO0_1 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_1_SHIFT          (1U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_1 Position     */
#define SYSCON_STARTSRP0_SRPIO0_1(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_1_SHIFT))&SYSCON_STARTSRP0_SRPIO0_1_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_2_MASK           (0x4U)                                              /*!< SYSCON_STARTSRP0: SRPIO0_2 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_2_SHIFT          (2U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_2 Position     */
#define SYSCON_STARTSRP0_SRPIO0_2(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_2_SHIFT))&SYSCON_STARTSRP0_SRPIO0_2_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_3_MASK           (0x8U)                                              /*!< SYSCON_STARTSRP0: SRPIO0_3 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_3_SHIFT          (3U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_3 Position     */
#define SYSCON_STARTSRP0_SRPIO0_3(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_3_SHIFT))&SYSCON_STARTSRP0_SRPIO0_3_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_4_MASK           (0x10U)                                             /*!< SYSCON_STARTSRP0: SRPIO0_4 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_4_SHIFT          (4U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_4 Position     */
#define SYSCON_STARTSRP0_SRPIO0_4(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_4_SHIFT))&SYSCON_STARTSRP0_SRPIO0_4_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_5_MASK           (0x20U)                                             /*!< SYSCON_STARTSRP0: SRPIO0_5 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_5_SHIFT          (5U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_5 Position     */
#define SYSCON_STARTSRP0_SRPIO0_5(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_5_SHIFT))&SYSCON_STARTSRP0_SRPIO0_5_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_6_MASK           (0x40U)                                             /*!< SYSCON_STARTSRP0: SRPIO0_6 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_6_SHIFT          (6U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_6 Position     */
#define SYSCON_STARTSRP0_SRPIO0_6(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_6_SHIFT))&SYSCON_STARTSRP0_SRPIO0_6_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_7_MASK           (0x80U)                                             /*!< SYSCON_STARTSRP0: SRPIO0_7 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_7_SHIFT          (7U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_7 Position     */
#define SYSCON_STARTSRP0_SRPIO0_7(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_7_SHIFT))&SYSCON_STARTSRP0_SRPIO0_7_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_8_MASK           (0x100U)                                            /*!< SYSCON_STARTSRP0: SRPIO0_8 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_8_SHIFT          (8U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_8 Position     */
#define SYSCON_STARTSRP0_SRPIO0_8(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_8_SHIFT))&SYSCON_STARTSRP0_SRPIO0_8_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_9_MASK           (0x200U)                                            /*!< SYSCON_STARTSRP0: SRPIO0_9 Mask         */
#define SYSCON_STARTSRP0_SRPIO0_9_SHIFT          (9U)                                                /*!< SYSCON_STARTSRP0: SRPIO0_9 Position     */
#define SYSCON_STARTSRP0_SRPIO0_9(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_9_SHIFT))&SYSCON_STARTSRP0_SRPIO0_9_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_10_MASK          (0x400U)                                            /*!< SYSCON_STARTSRP0: SRPIO0_10 Mask        */
#define SYSCON_STARTSRP0_SRPIO0_10_SHIFT         (10U)                                               /*!< SYSCON_STARTSRP0: SRPIO0_10 Position    */
#define SYSCON_STARTSRP0_SRPIO0_10(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_10_SHIFT))&SYSCON_STARTSRP0_SRPIO0_10_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO0_11_MASK          (0x800U)                                            /*!< SYSCON_STARTSRP0: SRPIO0_11 Mask        */
#define SYSCON_STARTSRP0_SRPIO0_11_SHIFT         (11U)                                               /*!< SYSCON_STARTSRP0: SRPIO0_11 Position    */
#define SYSCON_STARTSRP0_SRPIO0_11(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO0_11_SHIFT))&SYSCON_STARTSRP0_SRPIO0_11_MASK) /*!< SYSCON_STARTSRP0                        */
#define SYSCON_STARTSRP0_SRPIO1_0_MASK           (0x1000U)                                           /*!< SYSCON_STARTSRP0: SRPIO1_0 Mask         */
#define SYSCON_STARTSRP0_SRPIO1_0_SHIFT          (12U)                                               /*!< SYSCON_STARTSRP0: SRPIO1_0 Position     */
#define SYSCON_STARTSRP0_SRPIO1_0(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_STARTSRP0_SRPIO1_0_SHIFT))&SYSCON_STARTSRP0_SRPIO1_0_MASK) /*!< SYSCON_STARTSRP0                        */
/* ------- PDSLEEPCFG Bit Fields                    ------ */
#define SYSCON_PDSLEEPCFG_NOTUSED0_MASK          (0x7U)                                              /*!< SYSCON_PDSLEEPCFG: NOTUSED0 Mask        */
#define SYSCON_PDSLEEPCFG_NOTUSED0_SHIFT         (0U)                                                /*!< SYSCON_PDSLEEPCFG: NOTUSED0 Position    */
#define SYSCON_PDSLEEPCFG_NOTUSED0(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_NOTUSED0_SHIFT))&SYSCON_PDSLEEPCFG_NOTUSED0_MASK) /*!< SYSCON_PDSLEEPCFG                       */
#define SYSCON_PDSLEEPCFG_BOD_PD_MASK            (0x8U)                                              /*!< SYSCON_PDSLEEPCFG: BOD_PD Mask          */
#define SYSCON_PDSLEEPCFG_BOD_PD_SHIFT           (3U)                                                /*!< SYSCON_PDSLEEPCFG: BOD_PD Position      */
#define SYSCON_PDSLEEPCFG_BOD_PD(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_BOD_PD_SHIFT))&SYSCON_PDSLEEPCFG_BOD_PD_MASK) /*!< SYSCON_PDSLEEPCFG                       */
#define SYSCON_PDSLEEPCFG_NOTUSED1_MASK          (0x30U)                                             /*!< SYSCON_PDSLEEPCFG: NOTUSED1 Mask        */
#define SYSCON_PDSLEEPCFG_NOTUSED1_SHIFT         (4U)                                                /*!< SYSCON_PDSLEEPCFG: NOTUSED1 Position    */
#define SYSCON_PDSLEEPCFG_NOTUSED1(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_NOTUSED1_SHIFT))&SYSCON_PDSLEEPCFG_NOTUSED1_MASK) /*!< SYSCON_PDSLEEPCFG                       */
#define SYSCON_PDSLEEPCFG_WDTOSC_PD_MASK         (0x40U)                                             /*!< SYSCON_PDSLEEPCFG: WDTOSC_PD Mask       */
#define SYSCON_PDSLEEPCFG_WDTOSC_PD_SHIFT        (6U)                                                /*!< SYSCON_PDSLEEPCFG: WDTOSC_PD Position   */
#define SYSCON_PDSLEEPCFG_WDTOSC_PD(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_WDTOSC_PD_SHIFT))&SYSCON_PDSLEEPCFG_WDTOSC_PD_MASK) /*!< SYSCON_PDSLEEPCFG                       */
#define SYSCON_PDSLEEPCFG_NOTUSED2_MASK          (0x80U)                                             /*!< SYSCON_PDSLEEPCFG: NOTUSED2 Mask        */
#define SYSCON_PDSLEEPCFG_NOTUSED2_SHIFT         (7U)                                                /*!< SYSCON_PDSLEEPCFG: NOTUSED2 Position    */
#define SYSCON_PDSLEEPCFG_NOTUSED2(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_NOTUSED2_SHIFT))&SYSCON_PDSLEEPCFG_NOTUSED2_MASK) /*!< SYSCON_PDSLEEPCFG                       */
#define SYSCON_PDSLEEPCFG_NOTUSED3_MASK          (0x700U)                                            /*!< SYSCON_PDSLEEPCFG: NOTUSED3 Mask        */
#define SYSCON_PDSLEEPCFG_NOTUSED3_SHIFT         (8U)                                                /*!< SYSCON_PDSLEEPCFG: NOTUSED3 Position    */
#define SYSCON_PDSLEEPCFG_NOTUSED3(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_NOTUSED3_SHIFT))&SYSCON_PDSLEEPCFG_NOTUSED3_MASK) /*!< SYSCON_PDSLEEPCFG                       */
#define SYSCON_PDSLEEPCFG_NOTUSED4_MASK          (0x1800U)                                           /*!< SYSCON_PDSLEEPCFG: NOTUSED4 Mask        */
#define SYSCON_PDSLEEPCFG_NOTUSED4_SHIFT         (11U)                                               /*!< SYSCON_PDSLEEPCFG: NOTUSED4 Position    */
#define SYSCON_PDSLEEPCFG_NOTUSED4(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDSLEEPCFG_NOTUSED4_SHIFT))&SYSCON_PDSLEEPCFG_NOTUSED4_MASK) /*!< SYSCON_PDSLEEPCFG                       */
/* ------- PDAWAKECFG Bit Fields                    ------ */
#define SYSCON_PDAWAKECFG_IRCOUT_PD_MASK         (0x1U)                                              /*!< SYSCON_PDAWAKECFG: IRCOUT_PD Mask       */
#define SYSCON_PDAWAKECFG_IRCOUT_PD_SHIFT        (0U)                                                /*!< SYSCON_PDAWAKECFG: IRCOUT_PD Position   */
#define SYSCON_PDAWAKECFG_IRCOUT_PD(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_IRCOUT_PD_SHIFT))&SYSCON_PDAWAKECFG_IRCOUT_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_IRC_PD_MASK            (0x2U)                                              /*!< SYSCON_PDAWAKECFG: IRC_PD Mask          */
#define SYSCON_PDAWAKECFG_IRC_PD_SHIFT           (1U)                                                /*!< SYSCON_PDAWAKECFG: IRC_PD Position      */
#define SYSCON_PDAWAKECFG_IRC_PD(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_IRC_PD_SHIFT))&SYSCON_PDAWAKECFG_IRC_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_FLASH_PD_MASK          (0x4U)                                              /*!< SYSCON_PDAWAKECFG: FLASH_PD Mask        */
#define SYSCON_PDAWAKECFG_FLASH_PD_SHIFT         (2U)                                                /*!< SYSCON_PDAWAKECFG: FLASH_PD Position    */
#define SYSCON_PDAWAKECFG_FLASH_PD(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_FLASH_PD_SHIFT))&SYSCON_PDAWAKECFG_FLASH_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_BOD_PD_MASK            (0x8U)                                              /*!< SYSCON_PDAWAKECFG: BOD_PD Mask          */
#define SYSCON_PDAWAKECFG_BOD_PD_SHIFT           (3U)                                                /*!< SYSCON_PDAWAKECFG: BOD_PD Position      */
#define SYSCON_PDAWAKECFG_BOD_PD(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_BOD_PD_SHIFT))&SYSCON_PDAWAKECFG_BOD_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_ADC_PD_MASK            (0x10U)                                             /*!< SYSCON_PDAWAKECFG: ADC_PD Mask          */
#define SYSCON_PDAWAKECFG_ADC_PD_SHIFT           (4U)                                                /*!< SYSCON_PDAWAKECFG: ADC_PD Position      */
#define SYSCON_PDAWAKECFG_ADC_PD(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_ADC_PD_SHIFT))&SYSCON_PDAWAKECFG_ADC_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_SYSOSC_PD_MASK         (0x20U)                                             /*!< SYSCON_PDAWAKECFG: SYSOSC_PD Mask       */
#define SYSCON_PDAWAKECFG_SYSOSC_PD_SHIFT        (5U)                                                /*!< SYSCON_PDAWAKECFG: SYSOSC_PD Position   */
#define SYSCON_PDAWAKECFG_SYSOSC_PD(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_SYSOSC_PD_SHIFT))&SYSCON_PDAWAKECFG_SYSOSC_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_WDTOSC_PD_MASK         (0x40U)                                             /*!< SYSCON_PDAWAKECFG: WDTOSC_PD Mask       */
#define SYSCON_PDAWAKECFG_WDTOSC_PD_SHIFT        (6U)                                                /*!< SYSCON_PDAWAKECFG: WDTOSC_PD Position   */
#define SYSCON_PDAWAKECFG_WDTOSC_PD(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_WDTOSC_PD_SHIFT))&SYSCON_PDAWAKECFG_WDTOSC_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_SYSPLL_PD_MASK         (0x80U)                                             /*!< SYSCON_PDAWAKECFG: SYSPLL_PD Mask       */
#define SYSCON_PDAWAKECFG_SYSPLL_PD_SHIFT        (7U)                                                /*!< SYSCON_PDAWAKECFG: SYSPLL_PD Position   */
#define SYSCON_PDAWAKECFG_SYSPLL_PD(x)           (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_SYSPLL_PD_SHIFT))&SYSCON_PDAWAKECFG_SYSPLL_PD_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_NOTUSED0_MASK          (0x100U)                                            /*!< SYSCON_PDAWAKECFG: NOTUSED0 Mask        */
#define SYSCON_PDAWAKECFG_NOTUSED0_SHIFT         (8U)                                                /*!< SYSCON_PDAWAKECFG: NOTUSED0 Position    */
#define SYSCON_PDAWAKECFG_NOTUSED0(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_NOTUSED0_SHIFT))&SYSCON_PDAWAKECFG_NOTUSED0_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_NOTUSED1_MASK          (0x200U)                                            /*!< SYSCON_PDAWAKECFG: NOTUSED1 Mask        */
#define SYSCON_PDAWAKECFG_NOTUSED1_SHIFT         (9U)                                                /*!< SYSCON_PDAWAKECFG: NOTUSED1 Position    */
#define SYSCON_PDAWAKECFG_NOTUSED1(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_NOTUSED1_SHIFT))&SYSCON_PDAWAKECFG_NOTUSED1_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_NOTUSED2_MASK          (0x400U)                                            /*!< SYSCON_PDAWAKECFG: NOTUSED2 Mask        */
#define SYSCON_PDAWAKECFG_NOTUSED2_SHIFT         (10U)                                               /*!< SYSCON_PDAWAKECFG: NOTUSED2 Position    */
#define SYSCON_PDAWAKECFG_NOTUSED2(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_NOTUSED2_SHIFT))&SYSCON_PDAWAKECFG_NOTUSED2_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_NOTUSED3_MASK          (0x800U)                                            /*!< SYSCON_PDAWAKECFG: NOTUSED3 Mask        */
#define SYSCON_PDAWAKECFG_NOTUSED3_SHIFT         (11U)                                               /*!< SYSCON_PDAWAKECFG: NOTUSED3 Position    */
#define SYSCON_PDAWAKECFG_NOTUSED3(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_NOTUSED3_SHIFT))&SYSCON_PDAWAKECFG_NOTUSED3_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_NOTUSED4_MASK          (0x1000U)                                           /*!< SYSCON_PDAWAKECFG: NOTUSED4 Mask        */
#define SYSCON_PDAWAKECFG_NOTUSED4_SHIFT         (12U)                                               /*!< SYSCON_PDAWAKECFG: NOTUSED4 Position    */
#define SYSCON_PDAWAKECFG_NOTUSED4(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_NOTUSED4_SHIFT))&SYSCON_PDAWAKECFG_NOTUSED4_MASK) /*!< SYSCON_PDAWAKECFG                       */
#define SYSCON_PDAWAKECFG_NOTUSED5_MASK          (0xE000U)                                           /*!< SYSCON_PDAWAKECFG: NOTUSED5 Mask        */
#define SYSCON_PDAWAKECFG_NOTUSED5_SHIFT         (13U)                                               /*!< SYSCON_PDAWAKECFG: NOTUSED5 Position    */
