podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define SYSCON_PDAWAKECFG_NOTUSED5(x)            (((uint32_t)(((uint32_t)(x))<<SYSCON_PDAWAKECFG_NOTUSED5_SHIFT))&SYSCON_PDAWAKECFG_NOTUSED5_MASK) /*!< SYSCON_PDAWAKECFG                       */
/* ------- PDRUNCFG Bit Fields                      ------ */
#define SYSCON_PDRUNCFG_IRCOUT_PD_MASK           (0x1U)                                              /*!< SYSCON_PDRUNCFG: IRCOUT_PD Mask         */
#define SYSCON_PDRUNCFG_IRCOUT_PD_SHIFT          (0U)                                                /*!< SYSCON_PDRUNCFG: IRCOUT_PD Position     */
#define SYSCON_PDRUNCFG_IRCOUT_PD(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_IRCOUT_PD_SHIFT))&SYSCON_PDRUNCFG_IRCOUT_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_IRC_PD_MASK              (0x2U)                                              /*!< SYSCON_PDRUNCFG: IRC_PD Mask            */
#define SYSCON_PDRUNCFG_IRC_PD_SHIFT             (1U)                                                /*!< SYSCON_PDRUNCFG: IRC_PD Position        */
#define SYSCON_PDRUNCFG_IRC_PD(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_IRC_PD_SHIFT))&SYSCON_PDRUNCFG_IRC_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_FLASH_PD_MASK            (0x4U)                                              /*!< SYSCON_PDRUNCFG: FLASH_PD Mask          */
#define SYSCON_PDRUNCFG_FLASH_PD_SHIFT           (2U)                                                /*!< SYSCON_PDRUNCFG: FLASH_PD Position      */
#define SYSCON_PDRUNCFG_FLASH_PD(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_FLASH_PD_SHIFT))&SYSCON_PDRUNCFG_FLASH_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_BOD_PD_MASK              (0x8U)                                              /*!< SYSCON_PDRUNCFG: BOD_PD Mask            */
#define SYSCON_PDRUNCFG_BOD_PD_SHIFT             (3U)                                                /*!< SYSCON_PDRUNCFG: BOD_PD Position        */
#define SYSCON_PDRUNCFG_BOD_PD(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_BOD_PD_SHIFT))&SYSCON_PDRUNCFG_BOD_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_ADC_PD_MASK              (0x10U)                                             /*!< SYSCON_PDRUNCFG: ADC_PD Mask            */
#define SYSCON_PDRUNCFG_ADC_PD_SHIFT             (4U)                                                /*!< SYSCON_PDRUNCFG: ADC_PD Position        */
#define SYSCON_PDRUNCFG_ADC_PD(x)                (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_ADC_PD_SHIFT))&SYSCON_PDRUNCFG_ADC_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_SYSOSC_PD_MASK           (0x20U)                                             /*!< SYSCON_PDRUNCFG: SYSOSC_PD Mask         */
#define SYSCON_PDRUNCFG_SYSOSC_PD_SHIFT          (5U)                                                /*!< SYSCON_PDRUNCFG: SYSOSC_PD Position     */
#define SYSCON_PDRUNCFG_SYSOSC_PD(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_SYSOSC_PD_SHIFT))&SYSCON_PDRUNCFG_SYSOSC_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_WDTOSC_PD_MASK           (0x40U)                                             /*!< SYSCON_PDRUNCFG: WDTOSC_PD Mask         */
#define SYSCON_PDRUNCFG_WDTOSC_PD_SHIFT          (6U)                                                /*!< SYSCON_PDRUNCFG: WDTOSC_PD Position     */
#define SYSCON_PDRUNCFG_WDTOSC_PD(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_WDTOSC_PD_SHIFT))&SYSCON_PDRUNCFG_WDTOSC_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_SYSPLL_PD_MASK           (0x80U)                                             /*!< SYSCON_PDRUNCFG: SYSPLL_PD Mask         */
#define SYSCON_PDRUNCFG_SYSPLL_PD_SHIFT          (7U)                                                /*!< SYSCON_PDRUNCFG: SYSPLL_PD Position     */
#define SYSCON_PDRUNCFG_SYSPLL_PD(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_SYSPLL_PD_SHIFT))&SYSCON_PDRUNCFG_SYSPLL_PD_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_NOTUSED0_MASK            (0x100U)                                            /*!< SYSCON_PDRUNCFG: NOTUSED0 Mask          */
#define SYSCON_PDRUNCFG_NOTUSED0_SHIFT           (8U)                                                /*!< SYSCON_PDRUNCFG: NOTUSED0 Position      */
#define SYSCON_PDRUNCFG_NOTUSED0(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_NOTUSED0_SHIFT))&SYSCON_PDRUNCFG_NOTUSED0_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_NOTUSED1_MASK            (0x200U)                                            /*!< SYSCON_PDRUNCFG: NOTUSED1 Mask          */
#define SYSCON_PDRUNCFG_NOTUSED1_SHIFT           (9U)                                                /*!< SYSCON_PDRUNCFG: NOTUSED1 Position      */
#define SYSCON_PDRUNCFG_NOTUSED1(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_NOTUSED1_SHIFT))&SYSCON_PDRUNCFG_NOTUSED1_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_NOTUSED2_MASK            (0x400U)                                            /*!< SYSCON_PDRUNCFG: NOTUSED2 Mask          */
#define SYSCON_PDRUNCFG_NOTUSED2_SHIFT           (10U)                                               /*!< SYSCON_PDRUNCFG: NOTUSED2 Position      */
#define SYSCON_PDRUNCFG_NOTUSED2(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_NOTUSED2_SHIFT))&SYSCON_PDRUNCFG_NOTUSED2_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_NOTUSED3_MASK            (0x800U)                                            /*!< SYSCON_PDRUNCFG: NOTUSED3 Mask          */
#define SYSCON_PDRUNCFG_NOTUSED3_SHIFT           (11U)                                               /*!< SYSCON_PDRUNCFG: NOTUSED3 Position      */
#define SYSCON_PDRUNCFG_NOTUSED3(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_NOTUSED3_SHIFT))&SYSCON_PDRUNCFG_NOTUSED3_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_NOTUSED4_MASK            (0x1000U)                                           /*!< SYSCON_PDRUNCFG: NOTUSED4 Mask          */
#define SYSCON_PDRUNCFG_NOTUSED4_SHIFT           (12U)                                               /*!< SYSCON_PDRUNCFG: NOTUSED4 Position      */
#define SYSCON_PDRUNCFG_NOTUSED4(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_NOTUSED4_SHIFT))&SYSCON_PDRUNCFG_NOTUSED4_MASK) /*!< SYSCON_PDRUNCFG                         */
#define SYSCON_PDRUNCFG_NOTUSED5_MASK            (0xE000U)                                           /*!< SYSCON_PDRUNCFG: NOTUSED5 Mask          */
#define SYSCON_PDRUNCFG_NOTUSED5_SHIFT           (13U)                                               /*!< SYSCON_PDRUNCFG: NOTUSED5 Position      */
#define SYSCON_PDRUNCFG_NOTUSED5(x)              (((uint32_t)(((uint32_t)(x))<<SYSCON_PDRUNCFG_NOTUSED5_SHIFT))&SYSCON_PDRUNCFG_NOTUSED5_MASK) /*!< SYSCON_PDRUNCFG                         */
/* ------- DEVICE_ID Bit Fields                     ------ */
#define SYSCON_DEVICE_ID_DEVICEID_MASK           (0xFFFFFFFFU)                                       /*!< SYSCON_DEVICE_ID: DEVICEID Mask         */
#define SYSCON_DEVICE_ID_DEVICEID_SHIFT          (0U)                                                /*!< SYSCON_DEVICE_ID: DEVICEID Position     */
#define SYSCON_DEVICE_ID_DEVICEID(x)             (((uint32_t)(((uint32_t)(x))<<SYSCON_DEVICE_ID_DEVICEID_SHIFT))&SYSCON_DEVICE_ID_DEVICEID_MASK) /*!< SYSCON_DEVICE_ID                        */
/**
 * @} */ /* End group SYSCON_Register_Masks_GROUP 
 */

/* SYSCON - Peripheral instance base addresses */
#define SYSCON_BasePtr                 0x40048000UL //!< Peripheral base address
#define SYSCON                         ((SYSCON_Type *) SYSCON_BasePtr) //!< Freescale base pointer
#define SYSCON_BASE_PTR                (SYSCON) //!< Freescale style base pointer
/**
 * @} */ /* End group SYSCON_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup UART_Peripheral_access_layer_GROUP UART Peripheral Access Layer
* @brief C Struct for UART
* @{
*/

/* ================================================================================ */
/* ================           UART (file:UART_LPC11Cxx)            ================ */
/* ================================================================================ */

/**
 * @brief UART
 */
/**
* @addtogroup UART_structs_GROUP UART struct
* @brief Struct for UART
* @{
*/
typedef struct {                                /*       UART Structure                                               */
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  DLL;                       /**< 0000: Divisor Latch LSB. Least significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1) */
      __I  uint32_t  RBR;                       /**< 0000: Receiver Buffer Register. Contains the next received character to be read. (DLAB=0) */
      __O  uint32_t  THR;                       /**< 0000: Transmit Holding Register. The next character to be transmitted is written here. (DLAB=0) */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __IO uint32_t  DLM;                       /**< 0004: Divisor Latch MSB. Most significant byte of the baud rate divisor value. The full divisor is used to generate a baud rate from the fractional rate divider. (DLAB=1) */
      __IO uint32_t  IER;                       /**< 0004: Interrupt Enable Register. Contains individual interrupt enable bits for the 7 potential UART interrupts. (DLAB=0) */
   };
   union {                                      /**< 0000: (size=0004)                                                  */
      __O  uint32_t  FCR;                       /**< 0008: FIFO Control Register. Controls UART FIFO usage and modes    */
      __I  uint32_t  IIR;                       /**< 0008: Interrupt ID Register. Identifies which interrupt(s) are pending */
   };
   __IO uint32_t  LCR;                          /**< 000C: Line Control Register. Contains controls for frame formatting and break generation */
   __IO uint32_t  MCR;                          /**< 0010: Modem control register                                       */
   __I  uint32_t  LSR;                          /**< 0014: Line Status Register. Contains flags for transmit and receive status, including line errors */
   __I  uint32_t  MSR;                          /**< 0018: Modem status register                                        */
   __IO uint32_t  SCR;                          /**< 001C: Scratch Pad Register. Eight-bit temporary storage for software */
   __IO uint32_t  ACR;                          /**< 0020: Auto-baud Control Register. Contains controls for the auto-baud feature */
        uint8_t   RESERVED_0[4];               
   __IO uint32_t  FDR;                          /**< 0028: Fractional Divider Register. Generates a clock input for the baud rate divider */
        uint8_t   RESERVED_1[4];               
   __IO uint32_t  TER;                          /**< 0030: Transmit Enable Register. Turns off UART transmitter for use with software flow control */
        uint8_t   RESERVED_2[24];              
   __IO uint32_t  RS485CTRL;                    /**< 004C: RS-485/EIA-485 Control. Contains controls to configure various aspects of RS-485/EIA-485 modes */
   __IO uint32_t  RS485ADRMATCH;                /**< 0050: RS-485/EIA-485 address match. Contains the address match value for RS-485/EIA-485 mode */
   __IO uint32_t  RS485DLY;                     /**< 0054: RS-485/EIA-485 direction control delay                       */
} UART_Type;

/**
 * @} */ /* End group UART_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'UART' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

