podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
/**
* @addtogroup UART_Register_Masks_GROUP UART Register Masks
* @brief Register Masks for UART
* @{
*/
/* ------- DLL Bit Fields                           ------ */
#define UART_DLL_DLLSB_MASK                      (0xFFU)                                             /*!< UART_DLL: DLLSB Mask                    */
#define UART_DLL_DLLSB_SHIFT                     (0U)                                                /*!< UART_DLL: DLLSB Position                */
#define UART_DLL_DLLSB(x)                        (((uint32_t)(((uint32_t)(x))<<UART_DLL_DLLSB_SHIFT))&UART_DLL_DLLSB_MASK) /*!< UART_DLL                                */
/* ------- RBR Bit Fields                           ------ */
#define UART_RBR_RBR_MASK                        (0xFFU)                                             /*!< UART_RBR: RBR Mask                      */
#define UART_RBR_RBR_SHIFT                       (0U)                                                /*!< UART_RBR: RBR Position                  */
#define UART_RBR_RBR(x)                          (((uint32_t)(((uint32_t)(x))<<UART_RBR_RBR_SHIFT))&UART_RBR_RBR_MASK) /*!< UART_RBR                                */
/* ------- THR Bit Fields                           ------ */
#define UART_THR_THR_MASK                        (0xFFU)                                             /*!< UART_THR: THR Mask                      */
#define UART_THR_THR_SHIFT                       (0U)                                                /*!< UART_THR: THR Position                  */
#define UART_THR_THR(x)                          (((uint32_t)(((uint32_t)(x))<<UART_THR_THR_SHIFT))&UART_THR_THR_MASK) /*!< UART_THR                                */
/* ------- DLM Bit Fields                           ------ */
#define UART_DLM_DLMSB_MASK                      (0xFFU)                                             /*!< UART_DLM: DLMSB Mask                    */
#define UART_DLM_DLMSB_SHIFT                     (0U)                                                /*!< UART_DLM: DLMSB Position                */
#define UART_DLM_DLMSB(x)                        (((uint32_t)(((uint32_t)(x))<<UART_DLM_DLMSB_SHIFT))&UART_DLM_DLMSB_MASK) /*!< UART_DLM                                */
/* ------- IER Bit Fields                           ------ */
#define UART_IER_RBRIE_MASK                      (0x1U)                                              /*!< UART_IER: RBRIE Mask                    */
#define UART_IER_RBRIE_SHIFT                     (0U)                                                /*!< UART_IER: RBRIE Position                */
#define UART_IER_RBRIE(x)                        (((uint32_t)(((uint32_t)(x))<<UART_IER_RBRIE_SHIFT))&UART_IER_RBRIE_MASK) /*!< UART_IER                                */
#define UART_IER_THREIE_MASK                     (0x2U)                                              /*!< UART_IER: THREIE Mask                   */
#define UART_IER_THREIE_SHIFT                    (1U)                                                /*!< UART_IER: THREIE Position               */
#define UART_IER_THREIE(x)                       (((uint32_t)(((uint32_t)(x))<<UART_IER_THREIE_SHIFT))&UART_IER_THREIE_MASK) /*!< UART_IER                                */
#define UART_IER_RXLIE_MASK                      (0x4U)                                              /*!< UART_IER: RXLIE Mask                    */
#define UART_IER_RXLIE_SHIFT                     (2U)                                                /*!< UART_IER: RXLIE Position                */
#define UART_IER_RXLIE(x)                        (((uint32_t)(((uint32_t)(x))<<UART_IER_RXLIE_SHIFT))&UART_IER_RXLIE_MASK) /*!< UART_IER                                */
#define UART_IER_ABEOINTEN_MASK                  (0x100U)                                            /*!< UART_IER: ABEOINTEN Mask                */
#define UART_IER_ABEOINTEN_SHIFT                 (8U)                                                /*!< UART_IER: ABEOINTEN Position            */
#define UART_IER_ABEOINTEN(x)                    (((uint32_t)(((uint32_t)(x))<<UART_IER_ABEOINTEN_SHIFT))&UART_IER_ABEOINTEN_MASK) /*!< UART_IER                                */
#define UART_IER_ABTOINTEN_MASK                  (0x200U)                                            /*!< UART_IER: ABTOINTEN Mask                */
#define UART_IER_ABTOINTEN_SHIFT                 (9U)                                                /*!< UART_IER: ABTOINTEN Position            */
#define UART_IER_ABTOINTEN(x)                    (((uint32_t)(((uint32_t)(x))<<UART_IER_ABTOINTEN_SHIFT))&UART_IER_ABTOINTEN_MASK) /*!< UART_IER                                */
/* ------- FCR Bit Fields                           ------ */
#define UART_FCR_FIFOEN_MASK                     (0x1U)                                              /*!< UART_FCR: FIFOEN Mask                   */
#define UART_FCR_FIFOEN_SHIFT                    (0U)                                                /*!< UART_FCR: FIFOEN Position               */
#define UART_FCR_FIFOEN(x)                       (((uint32_t)(((uint32_t)(x))<<UART_FCR_FIFOEN_SHIFT))&UART_FCR_FIFOEN_MASK) /*!< UART_FCR                                */
#define UART_FCR_RXFIFORES_MASK                  (0x2U)                                              /*!< UART_FCR: RXFIFORES Mask                */
#define UART_FCR_RXFIFORES_SHIFT                 (1U)                                                /*!< UART_FCR: RXFIFORES Position            */
#define UART_FCR_RXFIFORES(x)                    (((uint32_t)(((uint32_t)(x))<<UART_FCR_RXFIFORES_SHIFT))&UART_FCR_RXFIFORES_MASK) /*!< UART_FCR                                */
#define UART_FCR_TXFIFORES_MASK                  (0x4U)                                              /*!< UART_FCR: TXFIFORES Mask                */
#define UART_FCR_TXFIFORES_SHIFT                 (2U)                                                /*!< UART_FCR: TXFIFORES Position            */
#define UART_FCR_TXFIFORES(x)                    (((uint32_t)(((uint32_t)(x))<<UART_FCR_TXFIFORES_SHIFT))&UART_FCR_TXFIFORES_MASK) /*!< UART_FCR                                */
#define UART_FCR_RXTL_MASK                       (0xC0U)                                             /*!< UART_FCR: RXTL Mask                     */
#define UART_FCR_RXTL_SHIFT                      (6U)                                                /*!< UART_FCR: RXTL Position                 */
#define UART_FCR_RXTL(x)                         (((uint32_t)(((uint32_t)(x))<<UART_FCR_RXTL_SHIFT))&UART_FCR_RXTL_MASK) /*!< UART_FCR                                */
/* ------- IIR Bit Fields                           ------ */
#define UART_IIR_INTSTATUS_MASK                  (0x1U)                                              /*!< UART_IIR: INTSTATUS Mask                */
#define UART_IIR_INTSTATUS_SHIFT                 (0U)                                                /*!< UART_IIR: INTSTATUS Position            */
#define UART_IIR_INTSTATUS(x)                    (((uint32_t)(((uint32_t)(x))<<UART_IIR_INTSTATUS_SHIFT))&UART_IIR_INTSTATUS_MASK) /*!< UART_IIR                                */
#define UART_IIR_INTID_MASK                      (0xEU)                                              /*!< UART_IIR: INTID Mask                    */
#define UART_IIR_INTID_SHIFT                     (1U)                                                /*!< UART_IIR: INTID Position                */
#define UART_IIR_INTID(x)                        (((uint32_t)(((uint32_t)(x))<<UART_IIR_INTID_SHIFT))&UART_IIR_INTID_MASK) /*!< UART_IIR                                */
#define UART_IIR_FIFOENABLE_MASK                 (0xC0U)                                             /*!< UART_IIR: FIFOENABLE Mask               */
#define UART_IIR_FIFOENABLE_SHIFT                (6U)                                                /*!< UART_IIR: FIFOENABLE Position           */
#define UART_IIR_FIFOENABLE(x)                   (((uint32_t)(((uint32_t)(x))<<UART_IIR_FIFOENABLE_SHIFT))&UART_IIR_FIFOENABLE_MASK) /*!< UART_IIR                                */
#define UART_IIR_ABEOINT_MASK                    (0x100U)                                            /*!< UART_IIR: ABEOINT Mask                  */
#define UART_IIR_ABEOINT_SHIFT                   (8U)                                                /*!< UART_IIR: ABEOINT Position              */
#define UART_IIR_ABEOINT(x)                      (((uint32_t)(((uint32_t)(x))<<UART_IIR_ABEOINT_SHIFT))&UART_IIR_ABEOINT_MASK) /*!< UART_IIR                                */
#define UART_IIR_ABTOINT_MASK                    (0x200U)                                            /*!< UART_IIR: ABTOINT Mask                  */
#define UART_IIR_ABTOINT_SHIFT                   (9U)                                                /*!< UART_IIR: ABTOINT Position              */
#define UART_IIR_ABTOINT(x)                      (((uint32_t)(((uint32_t)(x))<<UART_IIR_ABTOINT_SHIFT))&UART_IIR_ABTOINT_MASK) /*!< UART_IIR                                */
/* ------- LCR Bit Fields                           ------ */
#define UART_LCR_WLS_MASK                        (0x3U)                                              /*!< UART_LCR: WLS Mask                      */
#define UART_LCR_WLS_SHIFT                       (0U)                                                /*!< UART_LCR: WLS Position                  */
#define UART_LCR_WLS(x)                          (((uint32_t)(((uint32_t)(x))<<UART_LCR_WLS_SHIFT))&UART_LCR_WLS_MASK) /*!< UART_LCR                                */
#define UART_LCR_SBS_MASK                        (0x4U)                                              /*!< UART_LCR: SBS Mask                      */
#define UART_LCR_SBS_SHIFT                       (2U)                                                /*!< UART_LCR: SBS Position                  */
#define UART_LCR_SBS(x)                          (((uint32_t)(((uint32_t)(x))<<UART_LCR_SBS_SHIFT))&UART_LCR_SBS_MASK) /*!< UART_LCR                                */
#define UART_LCR_PE_MASK                         (0x8U)                                              /*!< UART_LCR: PE Mask                       */
#define UART_LCR_PE_SHIFT                        (3U)                                                /*!< UART_LCR: PE Position                   */
#define UART_LCR_PE(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LCR_PE_SHIFT))&UART_LCR_PE_MASK) /*!< UART_LCR                                */
#define UART_LCR_PS_MASK                         (0x30U)                                             /*!< UART_LCR: PS Mask                       */
#define UART_LCR_PS_SHIFT                        (4U)                                                /*!< UART_LCR: PS Position                   */
#define UART_LCR_PS(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LCR_PS_SHIFT))&UART_LCR_PS_MASK) /*!< UART_LCR                                */
#define UART_LCR_BC_MASK                         (0x40U)                                             /*!< UART_LCR: BC Mask                       */
#define UART_LCR_BC_SHIFT                        (6U)                                                /*!< UART_LCR: BC Position                   */
#define UART_LCR_BC(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LCR_BC_SHIFT))&UART_LCR_BC_MASK) /*!< UART_LCR                                */
#define UART_LCR_DLAB_MASK                       (0x80U)                                             /*!< UART_LCR: DLAB Mask                     */
#define UART_LCR_DLAB_SHIFT                      (7U)                                                /*!< UART_LCR: DLAB Position                 */
#define UART_LCR_DLAB(x)                         (((uint32_t)(((uint32_t)(x))<<UART_LCR_DLAB_SHIFT))&UART_LCR_DLAB_MASK) /*!< UART_LCR                                */
/* ------- MCR Bit Fields                           ------ */
#define UART_MCR_DTRC_MASK                       (0x1U)                                              /*!< UART_MCR: DTRC Mask                     */
#define UART_MCR_DTRC_SHIFT                      (0U)                                                /*!< UART_MCR: DTRC Position                 */
#define UART_MCR_DTRC(x)                         (((uint32_t)(((uint32_t)(x))<<UART_MCR_DTRC_SHIFT))&UART_MCR_DTRC_MASK) /*!< UART_MCR                                */
#define UART_MCR_RTSC_MASK                       (0x2U)                                              /*!< UART_MCR: RTSC Mask                     */
#define UART_MCR_RTSC_SHIFT                      (1U)                                                /*!< UART_MCR: RTSC Position                 */
#define UART_MCR_RTSC(x)                         (((uint32_t)(((uint32_t)(x))<<UART_MCR_RTSC_SHIFT))&UART_MCR_RTSC_MASK) /*!< UART_MCR                                */
#define UART_MCR_LMS_MASK                        (0x10U)                                             /*!< UART_MCR: LMS Mask                      */
#define UART_MCR_LMS_SHIFT                       (4U)                                                /*!< UART_MCR: LMS Position                  */
#define UART_MCR_LMS(x)                          (((uint32_t)(((uint32_t)(x))<<UART_MCR_LMS_SHIFT))&UART_MCR_LMS_MASK) /*!< UART_MCR                                */
#define UART_MCR_RTSEN_MASK                      (0x40U)                                             /*!< UART_MCR: RTSEN Mask                    */
#define UART_MCR_RTSEN_SHIFT                     (6U)                                                /*!< UART_MCR: RTSEN Position                */
#define UART_MCR_RTSEN(x)                        (((uint32_t)(((uint32_t)(x))<<UART_MCR_RTSEN_SHIFT))&UART_MCR_RTSEN_MASK) /*!< UART_MCR                                */
#define UART_MCR_CTSEN_MASK                      (0x80U)                                             /*!< UART_MCR: CTSEN Mask                    */
#define UART_MCR_CTSEN_SHIFT                     (7U)                                                /*!< UART_MCR: CTSEN Position                */
#define UART_MCR_CTSEN(x)                        (((uint32_t)(((uint32_t)(x))<<UART_MCR_CTSEN_SHIFT))&UART_MCR_CTSEN_MASK) /*!< UART_MCR                                */
/* ------- LSR Bit Fields                           ------ */
#define UART_LSR_RDR_MASK                        (0x1U)                                              /*!< UART_LSR: RDR Mask                      */
#define UART_LSR_RDR_SHIFT                       (0U)                                                /*!< UART_LSR: RDR Position                  */
#define UART_LSR_RDR(x)                          (((uint32_t)(((uint32_t)(x))<<UART_LSR_RDR_SHIFT))&UART_LSR_RDR_MASK) /*!< UART_LSR                                */
#define UART_LSR_OE_MASK                         (0x2U)                                              /*!< UART_LSR: OE Mask                       */
#define UART_LSR_OE_SHIFT                        (1U)                                                /*!< UART_LSR: OE Position                   */
#define UART_LSR_OE(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LSR_OE_SHIFT))&UART_LSR_OE_MASK) /*!< UART_LSR                                */
#define UART_LSR_PE_MASK                         (0x4U)                                              /*!< UART_LSR: PE Mask                       */
#define UART_LSR_PE_SHIFT                        (2U)                                                /*!< UART_LSR: PE Position                   */
#define UART_LSR_PE(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LSR_PE_SHIFT))&UART_LSR_PE_MASK) /*!< UART_LSR                                */
#define UART_LSR_FE_MASK                         (0x8U)                                              /*!< UART_LSR: FE Mask                       */
#define UART_LSR_FE_SHIFT                        (3U)                                                /*!< UART_LSR: FE Position                   */
#define UART_LSR_FE(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LSR_FE_SHIFT))&UART_LSR_FE_MASK) /*!< UART_LSR                                */
#define UART_LSR_BI_MASK                         (0x10U)                                             /*!< UART_LSR: BI Mask                       */
#define UART_LSR_BI_SHIFT                        (4U)                                                /*!< UART_LSR: BI Position                   */
#define UART_LSR_BI(x)                           (((uint32_t)(((uint32_t)(x))<<UART_LSR_BI_SHIFT))&UART_LSR_BI_MASK) /*!< UART_LSR                                */
#define UART_LSR_THRE_MASK                       (0x20U)                                             /*!< UART_LSR: THRE Mask                     */
#define UART_LSR_THRE_SHIFT                      (5U)                                                /*!< UART_LSR: THRE Position                 */
#define UART_LSR_THRE(x)                         (((uint32_t)(((uint32_t)(x))<<UART_LSR_THRE_SHIFT))&UART_LSR_THRE_MASK) /*!< UART_LSR                                */
#define UART_LSR_TEMT_MASK                       (0x40U)                                             /*!< UART_LSR: TEMT Mask                     */
#define UART_LSR_TEMT_SHIFT                      (6U)                                                /*!< UART_LSR: TEMT Position                 */
#define UART_LSR_TEMT(x)                         (((uint32_t)(((uint32_t)(x))<<UART_LSR_TEMT_SHIFT))&UART_LSR_TEMT_MASK) /*!< UART_LSR                                */
#define UART_LSR_RXFE_MASK                       (0x80U)                                             /*!< UART_LSR: RXFE Mask                     */
#define UART_LSR_RXFE_SHIFT                      (7U)                                                /*!< UART_LSR: RXFE Position                 */
#define UART_LSR_RXFE(x)                         (((uint32_t)(((uint32_t)(x))<<UART_LSR_RXFE_SHIFT))&UART_LSR_RXFE_MASK) /*!< UART_LSR                                */
/* ------- MSR Bit Fields                           ------ */
#define UART_MSR_DCTS_MASK                       (0x1U)                                              /*!< UART_MSR: DCTS Mask                     */
#define UART_MSR_DCTS_SHIFT                      (0U)                                                /*!< UART_MSR: DCTS Position                 */
#define UART_MSR_DCTS(x)                         (((uint32_t)(((uint32_t)(x))<<UART_MSR_DCTS_SHIFT))&UART_MSR_DCTS_MASK) /*!< UART_MSR                                */
#define UART_MSR_DDSR_MASK                       (0x2U)                                              /*!< UART_MSR: DDSR Mask                     */
#define UART_MSR_DDSR_SHIFT                      (1U)                                                /*!< UART_MSR: DDSR Position                 */
#define UART_MSR_DDSR(x)                         (((uint32_t)(((uint32_t)(x))<<UART_MSR_DDSR_SHIFT))&UART_MSR_DDSR_MASK) /*!< UART_MSR                                */
#define UART_MSR_TERI_MASK                       (0x4U)                                              /*!< UART_MSR: TERI Mask                     */
#define UART_MSR_TERI_SHIFT                      (2U)                                                /*!< UART_MSR: TERI Position                 */
#define UART_MSR_TERI(x)                         (((uint32_t)(((uint32_t)(x))<<UART_MSR_TERI_SHIFT))&UART_MSR_TERI_MASK) /*!< UART_MSR                                */
#define UART_MSR_DDCD_MASK                       (0x8U)                                              /*!< UART_MSR: DDCD Mask                     */
#define UART_MSR_DDCD_SHIFT                      (3U)                                                /*!< UART_MSR: DDCD Position                 */
#define UART_MSR_DDCD(x)                         (((uint32_t)(((uint32_t)(x))<<UART_MSR_DDCD_SHIFT))&UART_MSR_DDCD_MASK) /*!< UART_MSR                                */
#define UART_MSR_CTS_MASK                        (0x10U)                                             /*!< UART_MSR: CTS Mask                      */
#define UART_MSR_CTS_SHIFT                       (4U)                                                /*!< UART_MSR: CTS Position                  */
#define UART_MSR_CTS(x)                          (((uint32_t)(((uint32_t)(x))<<UART_MSR_CTS_SHIFT))&UART_MSR_CTS_MASK) /*!< UART_MSR                                */
#define UART_MSR_DSR_MASK                        (0x20U)                                             /*!< UART_MSR: DSR Mask                      */
#define UART_MSR_DSR_SHIFT                       (5U)                                                /*!< UART_MSR: DSR Position                  */
#define UART_MSR_DSR(x)                          (((uint32_t)(((uint32_t)(x))<<UART_MSR_DSR_SHIFT))&UART_MSR_DSR_MASK) /*!< UART_MSR                                */
#define UART_MSR_RI_MASK                         (0x40U)                                             /*!< UART_MSR: RI Mask                       */
#define UART_MSR_RI_SHIFT                        (6U)                                                /*!< UART_MSR: RI Position                   */
#define UART_MSR_RI(x)                           (((uint32_t)(((uint32_t)(x))<<UART_MSR_RI_SHIFT))&UART_MSR_RI_MASK) /*!< UART_MSR                                */
#define UART_MSR_DCD_MASK                        (0x80U)                                             /*!< UART_MSR: DCD Mask                      */
#define UART_MSR_DCD_SHIFT                       (7U)                                                /*!< UART_MSR: DCD Position                  */
#define UART_MSR_DCD(x)                          (((uint32_t)(((uint32_t)(x))<<UART_MSR_DCD_SHIFT))&UART_MSR_DCD_MASK) /*!< UART_MSR                                */
/* ------- SCR Bit Fields                           ------ */
#define UART_SCR_pad_MASK                        (0xFFU)                                             /*!< UART_SCR: pad Mask                      */
#define UART_SCR_pad_SHIFT                       (0U)                                                /*!< UART_SCR: pad Position                  */
#define UART_SCR_pad(x)                          (((uint32_t)(((uint32_t)(x))<<UART_SCR_pad_SHIFT))&UART_SCR_pad_MASK) /*!< UART_SCR                                */
/* ------- ACR Bit Fields                           ------ */
#define UART_ACR_START_MASK                      (0x1U)                                              /*!< UART_ACR: START Mask                    */
#define UART_ACR_START_SHIFT                     (0U)                                                /*!< UART_ACR: START Position                */
#define UART_ACR_START(x)                        (((uint32_t)(((uint32_t)(x))<<UART_ACR_START_SHIFT))&UART_ACR_START_MASK) /*!< UART_ACR                                */
#define UART_ACR_MODE_MASK                       (0x2U)                                              /*!< UART_ACR: MODE Mask                     */
#define UART_ACR_MODE_SHIFT                      (1U)                                                /*!< UART_ACR: MODE Position                 */
#define UART_ACR_MODE(x)                         (((uint32_t)(((uint32_t)(x))<<UART_ACR_MODE_SHIFT))&UART_ACR_MODE_MASK) /*!< UART_ACR                                */
#define UART_ACR_AUTORESTART_MASK                (0x4U)                                              /*!< UART_ACR: AUTORESTART Mask              */
#define UART_ACR_AUTORESTART_SHIFT               (2U)                                                /*!< UART_ACR: AUTORESTART Position          */
#define UART_ACR_AUTORESTART(x)                  (((uint32_t)(((uint32_t)(x))<<UART_ACR_AUTORESTART_SHIFT))&UART_ACR_AUTORESTART_MASK) /*!< UART_ACR                                */
