podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Project_Headers/LPC11Cxx.h
#define UART_ACR_ABEOINTCLR_MASK                 (0x100U)                                            /*!< UART_ACR: ABEOINTCLR Mask               */
#define UART_ACR_ABEOINTCLR_SHIFT                (8U)                                                /*!< UART_ACR: ABEOINTCLR Position           */
#define UART_ACR_ABEOINTCLR(x)                   (((uint32_t)(((uint32_t)(x))<<UART_ACR_ABEOINTCLR_SHIFT))&UART_ACR_ABEOINTCLR_MASK) /*!< UART_ACR                                */
#define UART_ACR_ABTOINTCLR_MASK                 (0x200U)                                            /*!< UART_ACR: ABTOINTCLR Mask               */
#define UART_ACR_ABTOINTCLR_SHIFT                (9U)                                                /*!< UART_ACR: ABTOINTCLR Position           */
#define UART_ACR_ABTOINTCLR(x)                   (((uint32_t)(((uint32_t)(x))<<UART_ACR_ABTOINTCLR_SHIFT))&UART_ACR_ABTOINTCLR_MASK) /*!< UART_ACR                                */
/* ------- FDR Bit Fields                           ------ */
#define UART_FDR_DIVADDVAL_MASK                  (0xFU)                                              /*!< UART_FDR: DIVADDVAL Mask                */
#define UART_FDR_DIVADDVAL_SHIFT                 (0U)                                                /*!< UART_FDR: DIVADDVAL Position            */
#define UART_FDR_DIVADDVAL(x)                    (((uint32_t)(((uint32_t)(x))<<UART_FDR_DIVADDVAL_SHIFT))&UART_FDR_DIVADDVAL_MASK) /*!< UART_FDR                                */
#define UART_FDR_MULVAL_MASK                     (0xF0U)                                             /*!< UART_FDR: MULVAL Mask                   */
#define UART_FDR_MULVAL_SHIFT                    (4U)                                                /*!< UART_FDR: MULVAL Position               */
#define UART_FDR_MULVAL(x)                       (((uint32_t)(((uint32_t)(x))<<UART_FDR_MULVAL_SHIFT))&UART_FDR_MULVAL_MASK) /*!< UART_FDR                                */
/* ------- TER Bit Fields                           ------ */
#define UART_TER_TXEN_MASK                       (0x80U)                                             /*!< UART_TER: TXEN Mask                     */
#define UART_TER_TXEN_SHIFT                      (7U)                                                /*!< UART_TER: TXEN Position                 */
#define UART_TER_TXEN(x)                         (((uint32_t)(((uint32_t)(x))<<UART_TER_TXEN_SHIFT))&UART_TER_TXEN_MASK) /*!< UART_TER                                */
/* ------- RS485CTRL Bit Fields                     ------ */
#define UART_RS485CTRL_NMMEN_MASK                (0x1U)                                              /*!< UART_RS485CTRL: NMMEN Mask              */
#define UART_RS485CTRL_NMMEN_SHIFT               (0U)                                                /*!< UART_RS485CTRL: NMMEN Position          */
#define UART_RS485CTRL_NMMEN(x)                  (((uint32_t)(((uint32_t)(x))<<UART_RS485CTRL_NMMEN_SHIFT))&UART_RS485CTRL_NMMEN_MASK) /*!< UART_RS485CTRL                          */
#define UART_RS485CTRL_RXDIS_MASK                (0x2U)                                              /*!< UART_RS485CTRL: RXDIS Mask              */
#define UART_RS485CTRL_RXDIS_SHIFT               (1U)                                                /*!< UART_RS485CTRL: RXDIS Position          */
#define UART_RS485CTRL_RXDIS(x)                  (((uint32_t)(((uint32_t)(x))<<UART_RS485CTRL_RXDIS_SHIFT))&UART_RS485CTRL_RXDIS_MASK) /*!< UART_RS485CTRL                          */
#define UART_RS485CTRL_AADEN_MASK                (0x4U)                                              /*!< UART_RS485CTRL: AADEN Mask              */
#define UART_RS485CTRL_AADEN_SHIFT               (2U)                                                /*!< UART_RS485CTRL: AADEN Position          */
#define UART_RS485CTRL_AADEN(x)                  (((uint32_t)(((uint32_t)(x))<<UART_RS485CTRL_AADEN_SHIFT))&UART_RS485CTRL_AADEN_MASK) /*!< UART_RS485CTRL                          */
#define UART_RS485CTRL_SEL_MASK                  (0x8U)                                              /*!< UART_RS485CTRL: SEL Mask                */
#define UART_RS485CTRL_SEL_SHIFT                 (3U)                                                /*!< UART_RS485CTRL: SEL Position            */
#define UART_RS485CTRL_SEL(x)                    (((uint32_t)(((uint32_t)(x))<<UART_RS485CTRL_SEL_SHIFT))&UART_RS485CTRL_SEL_MASK) /*!< UART_RS485CTRL                          */
#define UART_RS485CTRL_DCTRL_MASK                (0x10U)                                             /*!< UART_RS485CTRL: DCTRL Mask              */
#define UART_RS485CTRL_DCTRL_SHIFT               (4U)                                                /*!< UART_RS485CTRL: DCTRL Position          */
#define UART_RS485CTRL_DCTRL(x)                  (((uint32_t)(((uint32_t)(x))<<UART_RS485CTRL_DCTRL_SHIFT))&UART_RS485CTRL_DCTRL_MASK) /*!< UART_RS485CTRL                          */
#define UART_RS485CTRL_OINV_MASK                 (0x20U)                                             /*!< UART_RS485CTRL: OINV Mask               */
#define UART_RS485CTRL_OINV_SHIFT                (5U)                                                /*!< UART_RS485CTRL: OINV Position           */
#define UART_RS485CTRL_OINV(x)                   (((uint32_t)(((uint32_t)(x))<<UART_RS485CTRL_OINV_SHIFT))&UART_RS485CTRL_OINV_MASK) /*!< UART_RS485CTRL                          */
/* ------- RS485ADRMATCH Bit Fields                 ------ */
#define UART_RS485ADRMATCH_ADRMATCH_MASK         (0xFFU)                                             /*!< UART_RS485ADRMATCH: ADRMATCH Mask       */
#define UART_RS485ADRMATCH_ADRMATCH_SHIFT        (0U)                                                /*!< UART_RS485ADRMATCH: ADRMATCH Position   */
#define UART_RS485ADRMATCH_ADRMATCH(x)           (((uint32_t)(((uint32_t)(x))<<UART_RS485ADRMATCH_ADRMATCH_SHIFT))&UART_RS485ADRMATCH_ADRMATCH_MASK) /*!< UART_RS485ADRMATCH                      */
/* ------- RS485DLY Bit Fields                      ------ */
#define UART_RS485DLY_DLY_MASK                   (0xFFU)                                             /*!< UART_RS485DLY: DLY Mask                 */
#define UART_RS485DLY_DLY_SHIFT                  (0U)                                                /*!< UART_RS485DLY: DLY Position             */
#define UART_RS485DLY_DLY(x)                     (((uint32_t)(((uint32_t)(x))<<UART_RS485DLY_DLY_SHIFT))&UART_RS485DLY_DLY_MASK) /*!< UART_RS485DLY                           */
/**
 * @} */ /* End group UART_Register_Masks_GROUP 
 */

/* UART - Peripheral instance base addresses */
#define UART_BasePtr                   0x40008000UL //!< Peripheral base address
#define UART                           ((UART_Type *) UART_BasePtr) //!< Freescale base pointer
#define UART_BASE_PTR                  (UART) //!< Freescale style base pointer
/**
 * @} */ /* End group UART_Peripheral_access_layer_GROUP 
 */
/**
* @addtogroup WWDT_Peripheral_access_layer_GROUP WWDT Peripheral Access Layer
* @brief C Struct for WWDT
* @{
*/

/* ================================================================================ */
/* ================           WWDT (file:WWDT_LPC11Cxx)            ================ */
/* ================================================================================ */

/**
 * @brief Windowed WatchDog Timer
 */
/**
* @addtogroup WWDT_structs_GROUP WWDT struct
* @brief Struct for WWDT
* @{
*/
typedef struct {                                /*       WWDT Structure                                               */
   __IO uint32_t  WDMOD;                        /**< 0000: Watchdog mode register. This register contains the basic mode and status of the Watchdog Timer */
   __IO uint32_t  WDTC;                         /**< 0004: Watchdog timer constant register. This register determines the time-out value */
   __O  uint32_t  WDFEED;                       /**< 0008: Watchdog feed sequence register. Writing 0xAA followed by 0x55 to this register reloads the Watchdog timer with the value contained in WDTC */
   __I  uint32_t  WDTV;                         /**< 000C: Watchdog timer value register. This register reads out the current value of the Watchdog timer */
        uint8_t   RESERVED_0[4];               
   __IO uint32_t  WDWARNINT;                    /**< 0014: Watchdog Warning Interrupt compare value                     */
   __IO uint32_t  WDWINDOW;                     /**< 0018: Watchdog Window compare value                                */
} WWDT_Type;

/**
 * @} */ /* End group WWDT_structs_GROUP 
 */

/* -------------------------------------------------------------------------------- */
/* -----------     'WWDT' Position & Mask macros                        ----------- */
/* -------------------------------------------------------------------------------- */

/**
* @addtogroup WWDT_Register_Masks_GROUP WWDT Register Masks
* @brief Register Masks for WWDT
* @{
*/
/* ------- WDMOD Bit Fields                         ------ */
#define WWDT_WDMOD_WDEN_MASK                     (0x1U)                                              /*!< WWDT_WDMOD: WDEN Mask                   */
#define WWDT_WDMOD_WDEN_SHIFT                    (0U)                                                /*!< WWDT_WDMOD: WDEN Position               */
#define WWDT_WDMOD_WDEN(x)                       (((uint32_t)(((uint32_t)(x))<<WWDT_WDMOD_WDEN_SHIFT))&WWDT_WDMOD_WDEN_MASK) /*!< WWDT_WDMOD                              */
#define WWDT_WDMOD_WDRESET_MASK                  (0x2U)                                              /*!< WWDT_WDMOD: WDRESET Mask                */
#define WWDT_WDMOD_WDRESET_SHIFT                 (1U)                                                /*!< WWDT_WDMOD: WDRESET Position            */
#define WWDT_WDMOD_WDRESET(x)                    (((uint32_t)(((uint32_t)(x))<<WWDT_WDMOD_WDRESET_SHIFT))&WWDT_WDMOD_WDRESET_MASK) /*!< WWDT_WDMOD                              */
#define WWDT_WDMOD_WDTOF_MASK                    (0x4U)                                              /*!< WWDT_WDMOD: WDTOF Mask                  */
#define WWDT_WDMOD_WDTOF_SHIFT                   (2U)                                                /*!< WWDT_WDMOD: WDTOF Position              */
#define WWDT_WDMOD_WDTOF(x)                      (((uint32_t)(((uint32_t)(x))<<WWDT_WDMOD_WDTOF_SHIFT))&WWDT_WDMOD_WDTOF_MASK) /*!< WWDT_WDMOD                              */
#define WWDT_WDMOD_WDINT_MASK                    (0x8U)                                              /*!< WWDT_WDMOD: WDINT Mask                  */
#define WWDT_WDMOD_WDINT_SHIFT                   (3U)                                                /*!< WWDT_WDMOD: WDINT Position              */
#define WWDT_WDMOD_WDINT(x)                      (((uint32_t)(((uint32_t)(x))<<WWDT_WDMOD_WDINT_SHIFT))&WWDT_WDMOD_WDINT_MASK) /*!< WWDT_WDMOD                              */
#define WWDT_WDMOD_WDPROTECT_MASK                (0x10U)                                             /*!< WWDT_WDMOD: WDPROTECT Mask              */
#define WWDT_WDMOD_WDPROTECT_SHIFT               (4U)                                                /*!< WWDT_WDMOD: WDPROTECT Position          */
#define WWDT_WDMOD_WDPROTECT(x)                  (((uint32_t)(((uint32_t)(x))<<WWDT_WDMOD_WDPROTECT_SHIFT))&WWDT_WDMOD_WDPROTECT_MASK) /*!< WWDT_WDMOD                              */
/* ------- WDTC Bit Fields                          ------ */
#define WWDT_WDTC_Count_MASK                     (0xFFFFFFU)                                         /*!< WWDT_WDTC: Count Mask                   */
#define WWDT_WDTC_Count_SHIFT                    (0U)                                                /*!< WWDT_WDTC: Count Position               */
#define WWDT_WDTC_Count(x)                       (((uint32_t)(((uint32_t)(x))<<WWDT_WDTC_Count_SHIFT))&WWDT_WDTC_Count_MASK) /*!< WWDT_WDTC                               */
/* ------- WDFEED Bit Fields                        ------ */
#define WWDT_WDFEED_Feed_MASK                    (0xFFU)                                             /*!< WWDT_WDFEED: Feed Mask                  */
#define WWDT_WDFEED_Feed_SHIFT                   (0U)                                                /*!< WWDT_WDFEED: Feed Position              */
#define WWDT_WDFEED_Feed(x)                      (((uint32_t)(((uint32_t)(x))<<WWDT_WDFEED_Feed_SHIFT))&WWDT_WDFEED_Feed_MASK) /*!< WWDT_WDFEED                             */
/* ------- WDTV Bit Fields                          ------ */
#define WWDT_WDTV_Count_MASK                     (0xFFFFFFU)                                         /*!< WWDT_WDTV: Count Mask                   */
#define WWDT_WDTV_Count_SHIFT                    (0U)                                                /*!< WWDT_WDTV: Count Position               */
#define WWDT_WDTV_Count(x)                       (((uint32_t)(((uint32_t)(x))<<WWDT_WDTV_Count_SHIFT))&WWDT_WDTV_Count_MASK) /*!< WWDT_WDTV                               */
/* ------- WDWARNINT Bit Fields                     ------ */
#define WWDT_WDWARNINT_WARNINT_MASK              (0x3FFU)                                            /*!< WWDT_WDWARNINT: WARNINT Mask            */
#define WWDT_WDWARNINT_WARNINT_SHIFT             (0U)                                                /*!< WWDT_WDWARNINT: WARNINT Position        */
#define WWDT_WDWARNINT_WARNINT(x)                (((uint32_t)(((uint32_t)(x))<<WWDT_WDWARNINT_WARNINT_SHIFT))&WWDT_WDWARNINT_WARNINT_MASK) /*!< WWDT_WDWARNINT                          */
/* ------- WDWINDOW Bit Fields                      ------ */
#define WWDT_WDWINDOW_WINDOW_MASK                (0xFFFFFFU)                                         /*!< WWDT_WDWINDOW: WINDOW Mask              */
#define WWDT_WDWINDOW_WINDOW_SHIFT               (0U)                                                /*!< WWDT_WDWINDOW: WINDOW Position          */
#define WWDT_WDWINDOW_WINDOW(x)                  (((uint32_t)(((uint32_t)(x))<<WWDT_WDWINDOW_WINDOW_SHIFT))&WWDT_WDWINDOW_WINDOW_MASK) /*!< WWDT_WDWINDOW                           */
/**
 * @} */ /* End group WWDT_Register_Masks_GROUP 
 */

/* WWDT - Peripheral instance base addresses */
#define WWDT_BasePtr                   0x40004000UL //!< Peripheral base address
#define WWDT                           ((WWDT_Type *) WWDT_BasePtr) //!< Freescale base pointer
#define WWDT_BASE_PTR                  (WWDT) //!< Freescale style base pointer
/**
 * @} */ /* End group WWDT_Peripheral_access_layer_GROUP 
 */
/* --------------------  End of section using anonymous unions  ------------------- */
#if defined(__CC_ARM)
  #pragma pop
#elif defined(__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined(__TASKING__)
  #pragma warning restore
#else
  #warning Not supported compiler type
#endif
/**
 * @} */ /* End group Peripheral_access_layer_GROUP 
 */

#ifdef __cplusplus
}
#endif


#endif  /* MCU_LPC11CXX */

